{
  "sources": [
    {
      "title": "7-Zip",
      "feedUrl": "https://sourceforge.net/projects/sevenzip/rss?path=/7-Zip",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "Releases – APKMirror",
      "feedUrl": "https://www.apkmirror.com/apk/apkmirror/apkmirror-installer-official/feed/",
      "siteUrl": "https://www.apkmirror.com",
      "articles": []
    },
    {
      "title": "Equalizer APO",
      "feedUrl": "https://sourceforge.net/projects/equalizerapo/rss?path=/",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "mpv player (Windows)",
      "feedUrl": "https://sourceforge.net/projects/mpv-player-windows/rss?path=/release",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "Arch Linux",
      "feedUrl": "https://www.reddit.com/r/archlinux/.rss",
      "siteUrl": "https://www.reddit.com/r/archlinux/",
      "articles": [
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq6ml3/relying_on_login_password_with_tpm2_and_secure/",
          "author": null,
          "description": "Hi everyone,\n When using secure boot with custom keys, and luks full disk encryption tied to the TPM PCR 7 (secure boot state), a system can be encrypted but booted unattended up to the login prompt (GDM in my case).\n What steps, if any, can be taken to secure the login prompt in order to achieve security level similar to a luks password prompt at boot ? \n Thanks !\n    submitted by    /u/cvlc12  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq6ml3/relying_on_login_password_with_tpm2_and_secure/",
          "publishedOn": "2022-07-03T01:53:19.000Z",
          "wordCount": 25091,
          "title": "Relying on login password with tpm2 and Secure boot",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq5ho8/noob_trying_to_understand_xterm/",
          "author": null,
          "description": "I have used pre-fab distros for years. I got hooked on building Arch into my dream machine about 6 months ago and have built and rebuilt my OS at least 15 times. I have decided to build a server without a DE and only the items I need to serve what I need. I do have a monitor on it and would like Xterm to look as good as possible.\n If I am understanding the Arch Wiki there is no config file and all configuration must be done through X Resources. I could use some tips or opinions on the best settings and the best way to go about making it look decent. I am using zsh.... I'm sure some will find that to be blasphemy but I love the powerlevel look and I have built a decent config that I am used to.\n    submitted by    /u/TheGassyNinja  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq5ho8/noob_trying_to_understand_xterm/",
          "publishedOn": "2022-07-03T00:48:35.000Z",
          "wordCount": 25482,
          "title": "[NOOB] Trying to understand Xterm",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq5anf/my_audio_output_keeps_switching_between_analogue/",
          "author": null,
          "description": "Pretty much the title.\n So I ran Arch on my previous PC (using gnome), and one day after an update my audio started playing up in a kind of peculiar way. Let's say that I have two options in my settings to pick from for audio output, Analogue Hi Res, and Digital Hi Res. When I would boot and triy to do something like play a song, the song would be stuck in a kind of \"pending to play\" state until I open the settings panel and changed from whatever output device had been selected on boot (let's say digital) to whatever option wasn't yet selected (so let's say analogue).\n Ok so it's choosing the wrong audio device on startup yeah? Nope lol. After choosing the correct output device and having sound play, if I would pause or halt the system audio for even a short amount of time (I'm talking less than 10 seconds), when I would resume playback the audio player would be stuck in the same halted loading state until I go back into the settings panel and change the output device back again (so back to digital from analogue in this example). This would have to have been repeated every time I paused system audio, because the audio would just continuously ping pong between analogue and digital.\n I thought this was just something I had done stupidly having had Arch running on this system for over 4 years, and didn't bother digging into the problem because I was building a new machine anyway.\n Well, I built the new machine, and it was working fine for a few weeks until today. I ran a system update and noticed that wireplumber was in conflict with pipewire-media-session. I chose to replace the lib wireplumber, and then boom. The output device switching issue resumed again.\n Does anyone have any idea what's doing on? Or where I would start to debug this? It's driving me mad hahaha.\n Thanks in advance.\n    submitted by    /u/Tigh_Gherr  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq5anf/my_audio_output_keeps_switching_between_analogue/",
          "publishedOn": "2022-07-03T00:37:28.000Z",
          "wordCount": 25716,
          "title": "My audio output keeps switching between analogue and digital",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq4pjp/slow_boot_time_on_dualboot_laptop/",
          "author": null,
          "description": "I have a laptop where I set up an installation of Arch and an installation of Debian. Whenever I boot into Arch, I get a message \"start job is running for /dev/disk/by-uuid/aa....\", which lasts a minute and a half, followed by the message \"dependency failed for /dev/disk/by-uuid/aa....\" and then \"dependency failed for Swaps\" (note the uuid value shown matches the swap partition's). After this the system does successfully boot into Arch. Any help you can offer will be much appreciated, I have provided more details bellow.\n - The Arch installation uses sytemd-boot to boot, Debian's comes using grub.\n - The two installations each have their own root partition, they share an EFI partition, a swap partition, and a storage partition I made to store pictures, documents, etc.\n - As far as I can tell the fstab file in the Arch installation is correct (has the partitions I would expect to be there).\n -The computer defaults to Debian's boot menu, where there is an option to boot into Arch. I have tried going into the BIOS and entering through Arch's boot menu, when I do this the problem persists.\n ​\n Once again, any help will be greatly appreciated.\n Edit: Added a detail I thought was important.\n    submitted by    /u/RRRitter  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq4pjp/slow_boot_time_on_dualboot_laptop/",
          "publishedOn": "2022-07-03T00:04:54.000Z",
          "wordCount": 25595,
          "title": "Slow boot time on dual-boot laptop.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq489x/arch_iso_20220701_got_thinner_by_65_mib/",
          "author": null,
          "description": "Well, that's not a big deal (or a great post either), but there were posts on the subreddit about ISO getting fattier and fattier over time, and this time it got decently slimmer.\n  \n2022.07.01 - 833957888 B ~ 795.32421875 MiB\n 2022.06.01 - 903163904 B ~ 861.32421875 MiB\n  \nInterestingly the decimal fractional part stayed the same.\n    submitted by    /u/murlakatamenka  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq489x/arch_iso_20220701_got_thinner_by_65_mib/",
          "publishedOn": "2022-07-02T23:38:59.000Z",
          "wordCount": 25130,
          "title": "Arch ISO 2022.07.01 got thinner by ~65 MiB",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq3uey/suspend_is_failing_with_nvidia_and_wayland/",
          "author": null,
          "description": "After hit suspend on gnome menu Screen turns black for ~1 minute, suspend eventually fails (or crash), the machine resumes to Gnome lock screen.\n ​\n Ive set those arguments in modprobe.d: (Wihtout those flags the suspend service works but all video returns currupted.)\n ​\n options nvidia NVreg_PreserveVideoMemoryAllocations=1 NVreg_TemporaryFilePath=/var/tmp \n ​\n and 3 nvidia services are active: nvidia-suspend, nvidia-hibernate and nvidia-resume (this i was forced to enable in order to GDM display \"wayland\" options. With this disabled it was needed to change 61-gdm rules with same suspend behaviour.)\n ​\n [gabriel@arch ~]$ systemctl status nvidia-suspend.service ○ nvidia-suspend.service - NVIDIA system suspend actions Loaded: loaded (/usr/lib/systemd/system/nvidia-suspend.service; enabled; …",
          "link": "https://www.reddit.com/r/archlinux/comments/vq3uey/suspend_is_failing_with_nvidia_and_wayland/",
          "publishedOn": "2022-07-02T23:18:29.000Z",
          "wordCount": 31252,
          "title": "Suspend is failing with nvidia and wayland.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq38rh/anyone_else_get_this_with_the_new_iso/",
          "author": null,
          "description": "There was a ding that came out of my pc speaker everytime I boot the new iso. Also, there's new grub options such as the speakup screen reader. Anyone else have the pc speaker ding ding?\n    submitted by    /u/UnixElitist  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq38rh/anyone_else_get_this_with_the_new_iso/",
          "publishedOn": "2022-07-02T22:47:16.000Z",
          "wordCount": 25027,
          "title": "Anyone else get this with the new iso?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq26e1/iwd_unable_to_detect_or_connect_to_wifi_networks/",
          "author": null,
          "description": "Hello. My Dell Latitude E6420 running Arch recently had an unexpected abrupt poweroff (battery came loose by accident) and now it won't connect to wifi. I'm using iwd with dhcpcd.\n Output of iwctl station wlan0 scan && iwctl station wlan0 get-networks just says \"No networks available\". iwd.service and dhcpcd.service are running; I enabled them manually with systemctl to make sure.\n rfkill shows two wlan devices, phy0 and dell-wifi. Both are soft and hard unblocked.\n ping 9.9.9.9 simply says \"Network is unreachable\".\n Output of uname -a:\n Linux little-iron-4 5.18.7-arch1-1 #1 SMP PREEMPT_DYNAMIC Sat, 25 Jun 2022 20:22:01 +0000 x86_64 GNU/Linux\n    submitted by    /u/anon25783  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq26e1/iwd_unable_to_detect_or_connect_to_wifi_networks/",
          "publishedOn": "2022-07-02T21:53:54.000Z",
          "wordCount": 25373,
          "title": "iwd unable to detect or connect to wifi networks after hard crash",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq1r74/how_can_i_make_my_laptop_keyboard_work_for/",
          "author": null,
          "description": "Hello Archers,\n I've just gotten up and running with my first ever Arch install, on my laptop, and almost everything is working great. \n The one snag is: I've encrypted the hard drive using [https://wiki.archlinux.org/title/Dm-crypt/Encrypting_an_entire_system#LVM_on_LUKS](LVM on LUKS). At boot, I'm prompted to type the encryption passphrase. With a USB keyboard, I can type it in no problem. But during boot my laptop's built-in keyboard is non-functional - no keystrokes register at all, it's as though it's disconnected - so I have no way of booting without a USB keyboard attached. \n The keyboard itself is physically fine, and works perfectly in the bootloader and in the DE. \n /etc/mkinitcpio.conf:\n MODULES=(usbhid xhci_hcd i915) HOOKS=(base udev keyboard keymap numlock autodetect modconf b…",
          "link": "https://www.reddit.com/r/archlinux/comments/vq1r74/how_can_i_make_my_laptop_keyboard_work_for/",
          "publishedOn": "2022-07-02T21:32:29.000Z",
          "wordCount": 25603,
          "title": "How can I make my laptop keyboard work for entering the LUKS encryption PIN at boot?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vq1r3l/pc_recognizes_live_usb_only_after_switching/",
          "author": null,
          "description": "I don't think the issue is in the arch itself, but as the thing happened while I was trying to install arch, I decided to write here.\n So, I have been trying to install Arch from a USB drive and PC just doesn't see the USB until I switch Secure Boot mode to either on of off. Then the system boots up normally (of course, if I turned SB back off after that), but if I reboot, it happens again.\n I made the installation medium using Rufus, installation is in UEFI mode.\n Laptop: Lenovo Ideapad Gaming 3 15IMH05 \n    submitted by    /u/elpsykongaroo  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vq1r3l/pc_recognizes_live_usb_only_after_switching/",
          "publishedOn": "2022-07-02T21:32:20.000Z",
          "wordCount": 25261,
          "title": "PC recognizes live USB only after switching Secure Boot",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpytnx/how_to_reduce_home_partition_size_and_increase/",
          "author": null,
          "description": "I have recently switched to Arch and out of my 2TB HDD i want to allocate 50 or 100GB to Root partition by reducing the Home partition. Can someone suggest me how to do that ? in google search i found ways to extend the partition with free space already existing, I want help in creating the free space from Home partition and then extending / partition with fdisk. Or is it better to have same partition for both root & home? if yes, how to merge both the partitions?\n ​\n sda 8:0 0 1.8T 0 disk \n ├─sda1 8:1 0 511M 0 part /boot\n ├─sda2 8:2 0 19.5G 0 part /\n └─sda3 8:3 0 1.8T 0 part /home\n    submitted by    /u/adarigirishkumar  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpytnx/how_to_reduce_home_partition_size_and_increase/",
          "publishedOn": "2022-07-02T19:09:54.000Z",
          "wordCount": 25613,
          "title": "How to reduce Home partition size and increase root partition?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpyjiv/different_ram_capacity_reported_on_two_machines/",
          "author": null,
          "description": "Hi everyone,\n on my desktop system, the total ram size is reported as 32021 (free -m), whereas on my laptop, it is reported as 27893 with the same command.\n This puzzles me, as both systems have 2 16GB RAM sticks installed, so to my understanding free -m should show the same (or at least very similar) total capacity.\n Any idea why this happens, and how to fix it?\n (Both systems were installed using the same install script, both run the same software, nothing has been changed in terms of memory, both systems are up to date)\n    submitted by    /u/XyZaaH  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpyjiv/different_ram_capacity_reported_on_two_machines/",
          "publishedOn": "2022-07-02T18:56:16.000Z",
          "wordCount": 25301,
          "title": "Different RAM capacity reported on two machines with same amount of RAM",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpy5vv/anyone_notice_problems_with_proton_since_latest/",
          "author": null,
          "description": "I did an update this morning and found that all proton games would crash afterwards.\n I couldn't pin down exactly what the problem is but it appears that all proton versions, experimental and otherwise would cause directx errors. This was with forcing radv and regular radeon drivers. \n I ended up restoring from a timeshift backup for now as I didn't have a lot of time to crawl through journalctl.\n    submitted by    /u/jdfthetech  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpy5vv/anyone_notice_problems_with_proton_since_latest/",
          "publishedOn": "2022-07-02T18:37:26.000Z",
          "wordCount": 25197,
          "title": "Anyone Notice Problems with Proton Since Latest Update?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpxx68/how_does_kernel_deal_with_multiple_initrd_boot/",
          "author": null,
          "description": "microcode and DSDT are examples where an extra initramfs file is inserted before the regular one (generated by mkinitcpio). So how does kernel deal with those?\n I know for the regular one, such as \\initramfs-linux.img, kernel would mount it to / and execute the /init file. But if there are more than one initrd= params, does boot loader load all of them in one shot to some memory area and kernel process them one by one according to some rules? Does kernel unmount/delete the first one before mounting the next one to /? For example, if I insert an intel-ucode.img in front of initramfs-linux.img, does kernel also mount it at /? what happens afterwards then since there is no /init file in the ucode image, so how does kernel know what to do with it? and how does kernel know it needs to load the next initramfs file which is initramfs-linux.img?\n I tried adding debug boot parameter, but still didn't see any log file under /run/initramfs/, what did I miss?\n    submitted by    /u/notnullnone  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpxx68/how_does_kernel_deal_with_multiple_initrd_boot/",
          "publishedOn": "2022-07-02T18:25:48.000Z",
          "wordCount": 25431,
          "title": "How does kernel deal with multiple 'initrd=' boot parameters?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpx4ao/alacritty_not_applying_opacity/",
          "author": null,
          "description": "Hi, I'm farily new to arch and I'm trying it out on VirtualBox before using it on my actual PC.\n Right now I have qtile installed as a window manager, and I'm using picom as a compositor. My problem is that when changing my shell fomr bash to zsh (or any other, like fish), the opacity in my terminal (alacritty) just stops working.\n I Have no idea what the problem could be, since by using bash and picom it works just fine. Also alacritty itself does not change its background opacity when I set it inside the configuration file, but only if I have picom running.\n Any help?\n    submitted by    /u/_shunpo_  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpx4ao/alacritty_not_applying_opacity/",
          "publishedOn": "2022-07-02T17:47:21.000Z",
          "wordCount": 25477,
          "title": "Alacritty not applying opacity",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpvdwk/nvidia_xwayland_stutter/",
          "author": null,
          "description": "Hi, few weeks ago, I switched to using Wayland. Setup was quite easy following the wiki. However, when I try to run XWayland applications (wine/proton games in my case), I get massive stuttering - especially when moving camera or when character are moving in the scene. The weird thing is, there was originally no such problem and this seems to only start last week. I went through the wiki again, reinstalling what was needed, but without any luck. I am running Gnome, but had the same problem when I switched to KDE on Wayland. \n I also saw wiki mentioning EGLStreams vs GBM buffer APIs, but I not sure what to make of it as this only occurs in XWayland applications - native games that are not running through wine work flawlessly.\n Am I missing something or do others have the same problem?\n    submitted by    /u/citizen_418  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpvdwk/nvidia_xwayland_stutter/",
          "publishedOn": "2022-07-02T16:23:38.000Z",
          "wordCount": 25777,
          "title": "Nvidia + XWayland = stutter?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpusa4/safe_to_remove_old_kernel_modules/",
          "author": null,
          "description": "Hey all, I recently noticed every time a dkms module needed to be updated it was installing into a whole bunch of old kernels. I went to look into /lib/modules and found that it was over 5GB in size and full of old kernel modules. Are these safe to delete?\n lsing the directory:\n drwxr-xr-x 3 root root 4.0K Jun 17 2021 5.12.10-arch1-1 drwxr-xr-x 3 root root 4.0K Jun 20 2021 5.12.11-arch1-1 drwxr-xr-x 3 root root 4.0K Jun 27 2021 5.12.12-arch1-1 drwxr-xr-x 3 root root 4.0K May 18 2021 5.12.3-arch1-1 drwxr-xr-x 3 root root 4.0K May 20 2021 5.12.4-arch1-2 drwxr-xr-x 3 root root 4.0K May 25 2021 5.12.5-arch1-1 drwxr-xr-x 3 root root 4.0K May 28 2021 5.12.6-arch1-1 drwxr-xr-x 3 root root 4.0K May 31 2021 5.12.7-arch1-1 drwxr-xr-x 3 root root 4.0K Jun 4 2021 5.12.8-arch1-1 drwxr-xr-x 3 root root 4.0K Jun 14 2021 5.12.9-arch1-1 drwxr-xr-x 5 root root 4.0K Sep 10 2021 5.13.13-arch1-1 drwxr-xr-x 3 root root 4.0K Jan 17 10:15 5.16.0-arch1-1 drwxr-xr-x 3 root root 4.0K Jan 17 10:15 5.16.0-zen1-1-zen drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.17.5-arch1-2 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.17.6-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.17.7-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.17.7-arch1-2 drwxr-xr-x 5 root root 4.0K Jul 2 16:42 5.17.8-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.17.9-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:42 5.18.0-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:42 5.18.1-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.18.2-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:42 5.18.3-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.18.5-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:42 5.18.6-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:42 5.18.7-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.18.8-arch1-1 drwxr-xr-x 5 root root 4.0K Jul 2 16:43 5.18.8-zen1-1-zen \n This is 100% due to the kernel-modules-hook package I had installed which I've since removed\n    submitted by    /u/big_Gorb  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpusa4/safe_to_remove_old_kernel_modules/",
          "publishedOn": "2022-07-02T15:56:41.000Z",
          "wordCount": 25719,
          "title": "Safe to remove old kernel modules?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpugvs/wlan0_powered_off/",
          "author": null,
          "description": "Hey, I'm trying to connect to my wifi on the arch installation but when i: device list, it shows that wlan0 is powered off. Like:\n Name address powered adapter mode Wlan0 mac addr off phy0 station\n When I: station wlan0 scan, it says; No station on device: 'wlan0\n Can I get help?\n    submitted by    /u/Hen0r  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpugvs/wlan0_powered_off/",
          "publishedOn": "2022-07-02T15:41:27.000Z",
          "wordCount": 25457,
          "title": "wlan0 powered off",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpts3i/parallel_downloads/",
          "author": null,
          "description": "Is there a way to color code the completed or downloading (Doesn't really matter) files? I have ParellelDownloads set to 8 and it's difficult to keep track of what's been downloaded and what's downloading on a large screen. Mostly for aesthetics really.\n    submitted by    /u/Phydoux  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpts3i/parallel_downloads/",
          "publishedOn": "2022-07-02T15:07:13.000Z",
          "wordCount": 25218,
          "title": "Parallel Downloads",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpsv5f/gui_elements_of_some_applications_are_not/",
          "author": null,
          "description": "There are few applications like vlc, VirtualBox, etc. that have their GUI elements somewhat not positioned properly. The screenshots below will explain what I mean. This wasn't a problem before reinstalling my arch linux.\n https://ibb.co/QCnV3Kd\n It looks the same even on full screen\n    submitted by    /u/Wonderful-Conflict-3  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpsv5f/gui_elements_of_some_applications_are_not/",
          "publishedOn": "2022-07-02T14:22:34.000Z",
          "wordCount": 25156,
          "title": "GUI elements of some applications are not positioned properly",
          "imageUrl": "https://external-preview.redd.it/It5SD8cUsOJhfygv1mrnYC4ZVftZ2OTY3-qLEIMTywI.jpg?auto=webp&s=837e2b80482350b879cc36a8e1cc6bcc8894f915"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpr6qj/grub_issue_after_install/",
          "author": null,
          "description": "I’ve just installed Arch for the first time. I’m sure everything is okay, worked fine in the chroot environment, but now Arch won’t show up in GRUB. GRUB itself boots just fine. What’s wrong here?\n    submitted by    /u/StarFighterThree  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpr6qj/grub_issue_after_install/",
          "publishedOn": "2022-07-02T12:54:13.000Z",
          "wordCount": 25903,
          "title": "GRUB issue after install",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpprbt/managing_binary_package_repositories/",
          "author": null,
          "description": "submitted by    /u/dvzrv  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpprbt/managing_binary_package_repositories/",
          "publishedOn": "2022-07-02T11:29:31.000Z",
          "wordCount": 25244,
          "title": "Managing binary package repositories",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpoyfx/need_recommendation_for_minimalist_wayland_window/",
          "author": null,
          "description": "I'm about to get an old laptop (from 2012, don't know other specifics). Need recommendations for something that increases battery life to maximum, preferably tiling window manager\n    submitted by    /u/Qwart376  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpoyfx/need_recommendation_for_minimalist_wayland_window/",
          "publishedOn": "2022-07-02T10:37:12.000Z",
          "wordCount": 25189,
          "title": "Need recommendation for minimalist Wayland window manager",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpgu7v/upgrading_dkms_causes_error_sha512_command_not/",
          "author": null,
          "description": "As the title suggests, upgrading dkms to 3.0.5-1 causes it to err:\n  /usr/bin/dkms: line 1033: sha512: command not found \n Looks like the script hardcodes the command sha512. Looks like this is a change introduced recently ([GitHub]) and breaks dkms on Arch.\n If anyone else experiences a similar problem, soft-linking sha512 to sha512sum seems to solve the problem for now. (sudo ln -s /usr/bin/sha512sum /usr/bin/sha512)\n Although I'm curious, should we suggest the upstream to change this behavior (how?), or should we suggest Arch developers to add a patch to the dkms package (changing sha512 to sha512sum)?\n    submitted by    /u/yechs  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpgu7v/upgrading_dkms_causes_error_sha512_command_not/",
          "publishedOn": "2022-07-02T01:58:01.000Z",
          "wordCount": 25138,
          "title": "Upgrading dkms causes error `sha512: command not found`",
          "imageUrl": "https://external-preview.redd.it/SIgnkBP8liSPjoeIuw3dX0oDbQ7BM_oYE5TS3QfOd0Q.jpg?auto=webp&s=c658003dde9595abd74d7ddd31a4ee1bc2fd15c9"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpgec3/need_help_with_x_errors_and_steam/",
          "author": null,
          "description": "I know there's solutions for this but they haven't worked at all yet (even after reboot) so I came here.\n i just reinstalled arch linux and im trying to play garrys mod. . . but steam dose't work\n when i run steam command I get\n $ steam\n Running Steam on arch rolling 64-bit\n STEAM_RUNTIME is enabled automatically\n Steam runtime environment up-to-date!\n Can't find 'steam-runtime-check-requirements', continuing anyway\n [2022-07-02 01:21:36] Startup - updater built Nov 22 2021 22:06:59\n ILocalize::AddFile() failed to load file \"public/steambootstrapper_english.txt\".\n Installing breakpad exception handler for appid(steam)/version(0)\n SteamUpdateUI: An X Error occurred\n X Error of failed request: BadValue (integer parameter out of range for operation)\n ​\n I have every thing updated with pacman -Syyu. and installed these drivers\n  \nnvidia-515.48.07-13\n nvidia-utils-515.48.07-2\n lib32-nvidia-utils-515.57-1\n  \n​\n if it matters I used archinstall to install arch linux\n ​\n GPU: gt 1030\n Kernel: stock\n    submitted by    /u/joffif  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpgec3/need_help_with_x_errors_and_steam/",
          "publishedOn": "2022-07-02T01:33:34.000Z",
          "wordCount": 25218,
          "title": "Need Help with X Errors and steam",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpfwhb/stuck_booting/",
          "author": null,
          "description": "Hi, I have been trying to fix issues with my GPU drivers and upon rebooting I'm stuck on : Starting arch (Drive) recovering journal (Drive) clean, (number) files , (number) blocks.\n Its been stuck on this when booting and even a hard reboot didnt fix this. What am I doing wrong ?\n    submitted by    /u/JSV007  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpfwhb/stuck_booting/",
          "publishedOn": "2022-07-02T01:06:21.000Z",
          "wordCount": 25144,
          "title": "Stuck booting",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpf80u/how_can_i_setup_qemu_for_graphics_acceleration/",
          "author": null,
          "description": "I have a Optimus laptop, with AMD iGPU & Nvidia dGPU. On the arch wiki there seems to be multiple methods, which would be the best way to do this?\n    submitted by    /u/theguysk21  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpf80u/how_can_i_setup_qemu_for_graphics_acceleration/",
          "publishedOn": "2022-07-02T00:30:14.000Z",
          "wordCount": 25015,
          "title": "How can I set-up qemu for graphics acceleration?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vped8b/arch_wont_boot/",
          "author": null,
          "description": "So I have installed arch on a USB following the top tutorial on YouTube. By EF - Linux made simple. And at the end when rebooting into the arch USB. I'm met with.\n Starting version 251.2-1-arch /dev/sdc2: clean, 311370/15605760 files, 3267143/62416384 blocks\n Using alt+Ctrl+f2\n I am able to login and edit things around\n In googling attempts to fix the issue. I have Both added nomodeset and removed it. Along with quiet. In all different variations and then regenerate the configuration file for grub. All has not worked. \n I have installed Nvidia video drivers with Sudo -S nvidia\n Did not help\n I have tried adding systemd to the begging of the HOOK line. \n Just recently I got a new msg on boot telling me to run fsck manually. I did. Rebooted. And I'm back at the same screen.\n Anyone know how I can get past this to a desktop.\n Please be descriptive as possible I'm not great with Linux.\n    submitted by    /u/Roxasofthedark2793  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vped8b/arch_wont_boot/",
          "publishedOn": "2022-07-01T23:44:31.000Z",
          "wordCount": 25516,
          "title": "Arch won't boot.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpe9vc/arch_linux_20220701_iso_available/",
          "author": null,
          "description": "For those looking for the most recent ISO, it's now available for download.\n https://archlinux.org/download/\n    submitted by    /u/AussieAn0n  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpe9vc/arch_linux_20220701_iso_available/",
          "publishedOn": "2022-07-01T23:39:44.000Z",
          "wordCount": 24969,
          "title": "Arch Linux 2022.07.01 iso available",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpduht/home_assistants_hass_user_cannot_access/",
          "author": null,
          "description": "After upgrading Home Assistant to 1:2022.6.7-1, the hass user seems to have lost read and write access to /var/lib/hass. Of course, this means that HA will not start.\n If I watch /var/log/hass/home-assistant.log while the home-assistant systemd service starts up, I see entries like:\n 2022-07-01 16:06:47 ERROR (SyncWorker_0) [homeassistant.util.package] Unable to install package sqlalchemy==1.4.37: ERROR: Could not install packages due to an OSError: [Errno 30] Read-only file system: '/lib/python3.10/site-packages/sqlalchemy/processors.py' 2022-07-01 16:06:49 ERROR (SyncWorker_0) [homeassistant.util.package] Unable to install package sqlalchemy==1.4.37: ERROR: Could not install packages due to an OSError: [Errno 30] Read-only file system: '/lib/python3.10/site-packages/sqlalchemy/processors…",
          "link": "https://www.reddit.com/r/archlinux/comments/vpduht/home_assistants_hass_user_cannot_access/",
          "publishedOn": "2022-07-01T23:18:19.000Z",
          "wordCount": 25881,
          "title": "Home Assistant's hass user cannot access /var/lib/hass after upgrade to 1:2022.6.7-1",
          "imageUrl": "https://external-preview.redd.it/F35v9ZLtmZEOTXOmr6oC0V8sqyR9DEglsA3GGoNsoQc.jpg?auto=webp&s=2e13276c330cda985bec73debdcb755a1cb4e524"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vpammr/that_feeling_when_you_fix_your_borked_install/",
          "author": null,
          "description": "You guys will understand me. Rebooted my laptop and suddenly the boot process is hanging with no reason given. It just stopped in a Bluetooth firmware warning.\n Opened another TTY and checked with journalctl - getting a “xyz is not an ELF file”. Can’t remember which file it was to begin with. But it was causing NetworkManager to fail. \n Booted into the live USB Chrootd into the install pacman -Qo’d the lib file that journalctl was complaining about, and then proceeded down a pathway of:\n  \npacman -R <package the file belongs to>\n Receive ELF error for another file\n Repeat until I landed at kdecoration\n  \nTurns out somehow this package was corrupt, and it was somehow causing a cascading “is not an ELF file” issues throughout a bunch of /usr/lib/lib* files.\n  \npacman -R kdecoration\n pacman -Syu kdecoration\n exit\n reboot\n it boots!!\n pat self on the back\n  \nI fixed my Arch BTW. Thanks for listening.\n    submitted by    /u/siege801  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vpammr/that_feeling_when_you_fix_your_borked_install/",
          "publishedOn": "2022-07-01T20:48:07.000Z",
          "wordCount": 25906,
          "title": "That feeling when you fix your borked install",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vp9uo2/trackerminerfs3_eating_ram_cpu/",
          "author": null,
          "description": "I'm not sure when it started; I've had this problem for months. I use GNOME-Shell, and lately tracker-miner-fs-3 has been hogging a full CPU core and just devouring my RAM until it either freezes my system or I kill the process (which restarts itself eventually as well). I'm running a quad core CPU with 16G RAM, so it's not just my computer being a POS. I figured it would resolve itself with updates eventually, but it's been months and hasn't. \n Is there anything I can do to figure out why it's doing this, or fix it? \n I've taken some screenshots of the system monitor and some tracker commands I ran to see if it had any errors, but nothing seems to show up.\n    submitted by    /u/theRealPadster  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vp9uo2/trackerminerfs3_eating_ram_cpu/",
          "publishedOn": "2022-07-01T20:12:24.000Z",
          "wordCount": 25315,
          "title": "tracker-miner-fs-3 eating RAM + CPU",
          "imageUrl": "https://external-preview.redd.it/XFNaEzWycGAahtK-nys-recLrK4dLeIj-HbBt39q8HM.jpg?auto=webp&s=9ae11d586a071b447d22954757cedc13ad32a21a"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vp723u/grub_bootloader_wont_show_up_when_i_reboot_oracle/",
          "author": null,
          "description": "Hello, its my first time installing arch or a distro similar to arch. \n I have been trying it 4 times, manually and with the archinstall script.\n but everytime when i am the LAST step which is to reboot, so i get into the grub bootloader it just resets it.\n The bootloader wont show up, my vm is rebooting and im at the screen again which is showed at the begining. what am I supposed to do?\n    submitted by    /u/SosseKun  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vp723u/grub_bootloader_wont_show_up_when_i_reboot_oracle/",
          "publishedOn": "2022-07-01T18:07:15.000Z",
          "wordCount": 25313,
          "title": "Grub bootloader wont show up when i Reboot (Oracle vm)",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vp640j/is_pacman_update_replacing_pipewiremediasession/",
          "author": null,
          "description": "Last time it happened there were a few issues and it was reverted soon after. Is this attempt#2 by the devs to implement wireplumber for pipewire?\n    submitted by    /u/blueToyCar  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vp640j/is_pacman_update_replacing_pipewiremediasession/",
          "publishedOn": "2022-07-01T17:25:20.000Z",
          "wordCount": 25513,
          "title": "Is pacman update replacing pipewire-media-session with wireplumber for you guys (again)?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vp384k/questions_about_archiso/",
          "author": null,
          "description": "I want to create my own customized arch \"fork\". I've been making the installer iso with archiso but there's a few things I'm not fully clear on.\n  \nArchiso just makes the installer, right? If I use it to install the os doesn't it just install normal arch Linux? I need to know how to change this. For example: Having a different /etc/os-release file generated when it installs.\n \nDoes adding an /etc/os-release file to the airootfs of archiso change the installed OS name?\n \nIs the desktop environment on the live iso copied over to the installed system, with all of the settings on it? How would I do this?\n \n I'm making this for fun, please don't be an asshole just because I'm \"doing it wrong\" or whatever.\n    submitted by    /u/Mizosu  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vp384k/questions_about_archiso/",
          "publishedOn": "2022-07-01T15:15:22.000Z",
          "wordCount": 25179,
          "title": "Questions about archiso",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vp35h2/the_system_constantly_freezes_without_any_error/",
          "author": null,
          "description": "I have used arch for quite a long now but lately, I've started to get unexpected freezes. There's no error message. Nothing wrong with the system logs. I even made a memory test and all are good. I noticed it started getting worse when I added a couple of hard drives. Then I switched to the LTS kernel and all were working perfectly.\n Now system hangs multiple times during the day. Especialy when I use a browser or play some Steam games.\n ​\n Specs:\n kernel: 5.15.50-1-lts\n DE: KDE Plasma 5.25.2\n WM: KWin\n Terminal: ZSH\n CPU: i5-9600k\n GPU: Nvidia Geforce GTX 750 Ti\n Memory: 24GB HyperX 2666MHz\n Graphic driver module: nvidia-dkms 515.48.07-13\n Monitors: two 1920x1080\n lsblk command output: \n NAME MAJ:MIN RM SIZE RO TYPE MOUNTPOINTS\n sda 8:0 0 7.3T 0 disk /mnt/c97953b6-b0bc-406f-8621-05507c56a4a1\n sdb 8:16 0 7.3T 0 disk \n └─sdb1 8:17 0 7.3T 0 part /mnt/d6af250d-ed8e-46c4-b2f3-6fef1a71787c\n sdc 8:32 0 7.3T 0 disk /mnt/0917fba7-c114-4c1c-9353-6cbddc408b3f\n sdd 8:48 0 931.5G 0 disk \n └─sdd1 8:49 0 931.5G 0 part /mnt/89d666ee-3837-4344-b843-90d150115a72\n sde 8:64 0 447.1G 0 disk \n └─sde1 8:65 0 447.1G 0 part /home/igor/Extra\n sdf 8:80 0 7.3T 0 disk \n └─sdf1 8:81 0 7.3T 0 part /mnt/c8623ca0-5864-413e-b570-68287e7152f7\n sdg 8:96 0 1.8T 0 disk \n └─sdg1 8:97 0 1.8T 0 part /mnt/CE08765108763893\n sdh 8:112 0 1.8T 0 disk \n └─sdh1 8:113 0 1.8T 0 part /mnt/60825857-ef1f-40ac-b26e-9747da05fc88\n sdi 8:128 0 1.8T 0 disk \n └─sdi1 8:129 0 1.8T 0 part /mnt/0b28ce18-c35f-43fd-84d0-c07ec84ab0a1\n sdj 8:144 0 1.8T 0 disk \n └─sdj1 8:145 0 1.8T 0 part /mnt/328f14a2-f2b8-4c3e-9a67-df5d4b9aa586\n zram0 254:0 0 4G 0 disk [SWAP]\n nvme0n1 259:0 0 465.8G 0 disk \n ├─nvme0n1p1 259:1 0 511M 0 part /boot\n ├─nvme0n1p2 259:2 0 19.5G 0 part /\n └─nvme0n1p3 259:3 0 445.8G 0 part /home \n ​\n ​\n Thanks for all of you. Have a great day!\n    submitted by    /u/ZyzzBrah05  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vp35h2/the_system_constantly_freezes_without_any_error/",
          "publishedOn": "2022-07-01T15:12:08.000Z",
          "wordCount": 25925,
          "title": "The system constantly freezes without any error message",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vp28w5/locale_not_getting_set_correctly_and_i_cant/",
          "author": null,
          "description": "I have been having this problem since a month probably. This is more than an year old installation but earlier I didn't have this problem.\n I have uncommented en_US.UTF-8 UTF-8 from /etc/locale.gen, have run locale-gen and have done localectl set-locale LANG=en_US.UTF-8 already. This was done during the initial installation but the problem presented itself a month back.\n The problem is, when running locale I get the following error:\n locale: Cannot set LC_ALL to default locale: No such file or directory LANG=en_US LC_CTYPE=C.UTF-8 LC_NUMERIC=\"en_US\" LC_TIME=\"en_US\" LC_COLLATE=\"en_US\" LC_MONETARY=\"en_US\" LC_MESSAGES=C LC_PAPER=\"en_US\" LC_NAME=\"en_US\" LC_ADDRESS=\"en_US\" LC_TELEPHONE=\"en_US\" LC_MEASUREMENT=\"en_US\" LC_IDENTIFICATION=\"en_US\" LC_ALL= \n And when running locale -a, I get:\n locale: Cannot set LC_COLLATE to default locale: No such file or directory C C.UTF-8 POSIX en_US.utf8 \n Due to this, applications fallback to the default 'C' locale but some applications like easyeffects just fail to launch. I have already tried editing /etc/locale.gen and running locale-gen etc., but to no avail. What else can I do?\n    submitted by    /u/needsleep31  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vp28w5/locale_not_getting_set_correctly_and_i_cant/",
          "publishedOn": "2022-07-01T14:32:56.000Z",
          "wordCount": 25734,
          "title": "Locale not getting set correctly and I can't figure out what's wrong.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arch Linux: Releases",
      "feedUrl": "https://archlinux.org/feeds/releases/",
      "siteUrl": "https://archlinux.org/download/",
      "articles": []
    },
    {
      "title": "Arch Linux: Recent news updates",
      "feedUrl": "https://archlinux.org/feeds/news/",
      "siteUrl": "https://archlinux.org/news/",
      "articles": []
    },
    {
      "title": "BleepingComputer",
      "feedUrl": "https://www.bleepingcomputer.com/feed/",
      "siteUrl": "https://www.bleepingcomputer.com/",
      "articles": [
        {
          "id": "https://www.bleepingcomputer.com/news/security/rogue-hackerone-employee-steals-bug-reports-to-sell-on-the-side/",
          "author": "Ionut Ilascu",
          "description": "A HackerOne employee stole vulnerability reports submitted through the bug bounty platform and disclosed them to affected customers to claim financial rewards. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/rogue-hackerone-employee-steals-bug-reports-to-sell-on-the-side/",
          "publishedOn": "2022-07-02T15:36:48.000Z",
          "wordCount": 2286,
          "title": "Rogue HackerOne employee steals bug reports to sell on the side",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/07/02/insider_threat_ed.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/verified-twitter-accounts-hacked-to-send-fake-suspension-notices/",
          "author": "Lawrence Abrams",
          "description": "[...]",
          "link": "https://www.bleepingcomputer.com/news/security/verified-twitter-accounts-hacked-to-send-fake-suspension-notices/",
          "publishedOn": "2022-07-02T15:12:06.000Z",
          "wordCount": 2348,
          "title": "Verified Twitter accounts hacked to send fake suspension notices",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/06/30/twitter-verified-attack.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/microsoft-finds-raspberry-robin-worm-in-hundreds-of-windows-networks/",
          "author": "Sergiu Gatlan",
          "description": "Microsoft says that a recently spotted Windows worm has been found on the networks of hundreds of organizations from various industry sectors. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/microsoft-finds-raspberry-robin-worm-in-hundreds-of-windows-networks/",
          "publishedOn": "2022-07-02T14:07:00.000Z",
          "wordCount": 2170,
          "title": "Microsoft finds Raspberry Robin worm in hundreds of Windows networks",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/07/01/Red_bird.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/zoho-manageengine-adaudit-plus-bug-gets-public-rce-exploit/",
          "author": "Ionut Ilascu",
          "description": "Security researchers have published technical details and proof-of-concept exploit code for CVE-2022-28219, a critical vulnerability in the Zoho ManageEngine ADAudit Plus tool for monitoring activities in the Active Directory. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/zoho-manageengine-adaudit-plus-bug-gets-public-rce-exploit/",
          "publishedOn": "2022-07-01T19:45:04.000Z",
          "wordCount": 2377,
          "title": "Zoho ManageEngine ADAudit Plus bug gets public RCE exploit",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/09/16/ZOHO.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-july-1st-2022-bug-bounties/",
          "author": "Lawrence Abrams",
          "description": "It has been relatively busy this week with new ransomware attacks unveiled, a bug bounty program introduced, and new tactics used by the threat actors to distribute their encryptors. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-july-1st-2022-bug-bounties/",
          "publishedOn": "2022-07-01T19:35:53.000Z",
          "wordCount": 2678,
          "title": "The Week in Ransomware - July 1st 2022 - Bug Bounties",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/12/23/AvosLocker_ransomware_headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/cisa-orders-agencies-to-patch-windows-lsa-bug-exploited-in-the-wild/",
          "author": "Sergiu Gatlan",
          "description": "CISA has re-added a security bug affecting Windows devices to its list of bugs exploited in the wild after removing it in May due to Active Directory (AD) certificate authentication issues caused by Microsoft's May 2022 updates. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-agencies-to-patch-windows-lsa-bug-exploited-in-the-wild/",
          "publishedOn": "2022-07-01T17:20:20.000Z",
          "wordCount": 2165,
          "title": "CISA orders agencies to patch Windows LSA bug exploited in the wild",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/09/20/Windows.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/microsoft/microsoft-updates-azure-ad-with-support-for-temporary-passcodes/",
          "author": "Sergiu Gatlan",
          "description": "Azure Active Directory (Azure AD) now allows admins to issue time-limited passcodes that can be used to register new passwordless authentication methods, during Windows onboarding, or to recover accounts easier when losing credentials or FIDO2 keys. [...]",
          "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-updates-azure-ad-with-support-for-temporary-passcodes/",
          "publishedOn": "2022-07-01T16:05:46.000Z",
          "wordCount": 2216,
          "title": "Microsoft updates Azure AD with support for temporary passcodes",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/09/15/Microsoft_passwordless.jpg"
        }
      ]
    },
    {
      "title": "gHacks Technology News",
      "feedUrl": "https://www.ghacks.net/feed/",
      "siteUrl": "https://www.ghacks.net",
      "articles": [
        {
          "id": "https://www.ghacks.net/?p=179499",
          "author": "Martin Brinkmann",
          "description": "Can you learn a new language by just browsing the web, like you always do? Toucan, a browser extension for Chrome, Edge, other Chromium-based browsers, and Firefox, suggests that you can. Learning […]\nThank you for being a Ghacks reader. The post Toucan: Can you learn a language while browsing the web? appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/07/02/toucan-can-you-learn-a-language-while-browsing-the-web/",
          "publishedOn": "2022-07-02T09:28:39.000Z",
          "wordCount": 3277,
          "title": "Toucan: Can you learn a language while browsing the web?",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/07/toucan-learn-languages.png"
        },
        {
          "id": "https://www.ghacks.net/?p=179490",
          "author": "Martin Brinkmann",
          "description": "All downloads in the Microsoft Edge web browser are scanned using Microsoft Defender's SmartScreen feature. Designed to weed out malicious files before they land on the user system, SmartScreen is the first […]\nThank you for being a Ghacks reader. The post How to deal with Microsoft Edge's \"isn't commonly downloaded\" warning appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/07/02/how-to-deal-with-microsoft-edges-isnt-commonly-downloaded-warning/",
          "publishedOn": "2022-07-02T05:19:56.000Z",
          "wordCount": 3077,
          "title": "How to deal with Microsoft Edge's \"isn't commonly downloaded\" warning",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/07/microsoft-defender-smartscreen.png"
        },
        {
          "id": "https://www.ghacks.net/?p=179486",
          "author": "Martin Brinkmann",
          "description": "When Google launched its Chrome web browser in 2008, Google included native integration of the company's translate service in the browser shortly after. Chrome users could use the feature to translate webpages […]\nThank you for being a Ghacks reader. The post A Year after other browsers, Chrome is finally getting a partial translate feature appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/07/01/years-after-other-browsers-chrome-is-finally-getting-a-partial-translate-feature/",
          "publishedOn": "2022-07-01T16:19:37.000Z",
          "wordCount": 2960,
          "title": "A Year after other browsers, Chrome is finally getting a partial translate feature",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/07/edge-translate.png"
        }
      ]
    },
    {
      "title": "Hongkiat",
      "feedUrl": "http://feeds2.feedburner.com/24thfloor",
      "siteUrl": "https://www.hongkiat.com/blog",
      "articles": []
    },
    {
      "title": "How-To Geek",
      "feedUrl": "https://www.howtogeek.com/feed/",
      "siteUrl": "https://www.howtogeek.com",
      "articles": [
        {
          "id": "http://www.howtogeek.com/?p=190107",
          "author": "Chris Hoffman",
          "description": "Smartphones are expensive — you wouldn’t want to spend up to $1,000 or more and end up with a scratched screen. Many people still buy screen protectors to protect their purchase, but are they still necessary with modern display advancements?",
          "link": "https://www.howtogeek.com/190107/does-your-smartphone-really-need-a-screen-protector/",
          "publishedOn": "2022-07-02T21:00:00.000Z",
          "wordCount": 16564,
          "title": "Does Your Smartphone Really Need a Screen Protector?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2014/06/Screen-protector.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/121849/what-were-playing-backbone-is-a-neat-noir-adventure/",
          "author": "Sarah Chaney",
          "description": "If you’re at all interested in solving mysteries or exploring a post-noir, dystopian world, you’ll love playing Backbone. It has elements of a visual novel, but you actually move around the world and have to interact with things and solve puzzles to progress the story.",
          "link": "https://www.reviewgeek.com/121849/what-were-playing-backbone-is-a-neat-noir-adventure/",
          "publishedOn": "2022-07-02T20:04:16.000Z",
          "wordCount": 8823,
          "title": "What We're Playing: 'Backbone' Is a Neat Noir Adventure",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/aafde84e.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=799173",
          "author": "Jason Fitzpatrick",
          "description": "Saving money is always a great idea, but with inflation eating into everything and streaming service price hikes, cutting streaming expenses feels particularly important. Here’s how to save money while still enjoying your favorite streaming services.",
          "link": "https://www.howtogeek.com/799173/heres-the-best-way-to-save-money-on-streaming-in-2022/",
          "publishedOn": "2022-07-02T20:00:00.000Z",
          "wordCount": 16095,
          "title": "Here’s the Best Way to Save Money on Streaming in 2022",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/04/SaveMoneyStreaming1.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=809676",
          "author": "Mahesh Makvana",
          "description": "Have a cool video that you’d like to share with your friends on Discord? If so, the platform makes it easy to share your video content in both channels and direct messages. We’ll show you how to do that on Discord on both desktop and mobile.",
          "link": "https://www.howtogeek.com/809676/how-to-send-videos-on-discord/",
          "publishedOn": "2022-07-02T19:00:31.000Z",
          "wordCount": 15993,
          "title": "How to Send Videos on Discord",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/discord-smartphone-desk-school.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=812275",
          "author": "Mahesh Makvana",
          "description": "Have you customized too many setting options on your iPhone and now want to start from scratch? If so, your iPhone makes it easy to bring all your settings to their factory values. We’ll show you how to do just that.",
          "link": "https://www.howtogeek.com/812275/reset-all-settings-iphone/",
          "publishedOn": "2022-07-02T18:00:58.000Z",
          "wordCount": 15626,
          "title": "How to Reset All Settings on iPhone",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/iphone_settings_hero_1.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122258/sony-announces-new-inzone-gaming-monitors-and-headsets/",
          "author": "Andrew Heinzman",
          "description": "If you want a bunch of PS5-themed hardware, prepare to get in the zone. Sony is about to launch a new gaming brand called InZone with a focus on monitors and headsets. Interestingly, these products work with both PlayStation and PC.",
          "link": "https://www.reviewgeek.com/122258/sony-announces-new-inzone-gaming-monitors-and-headsets/",
          "publishedOn": "2022-07-02T18:00:45.000Z",
          "wordCount": 8261,
          "title": "Sony Announces New \"InZone\" Gaming Monitors and Headsets",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/45b6cc4e.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=811214",
          "author": "Benj Edwards",
          "description": "Every photo you take on your iPhone includes EXIF metadata, which records information about how, when, and where you took the photo. Previously, you needed a special utility to see EXIF metadata on iPhone, but with iOS 15 and up, you can see it directly in the Photos app. Here’s how.",
          "link": "https://www.howtogeek.com/811214/how-to-see-exif-metadata-in-photos-on-iphone/",
          "publishedOn": "2022-07-02T17:00:41.000Z",
          "wordCount": 15660,
          "title": "How to See EXIF Metadata in Photos on iPhone",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/apple_photos_app_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122245/supercharge-your-tesla-for-free-during-off-peak-hours-this-holiday-weekend/",
          "author": "Cory Gunther",
          "description": "For the long 4th of July weekend, Tesla will offer free Supercharging in select regions for customers during off-peak hours. This is likely a move to help limit traffic and lines at popular charging stations during one of the year’s busiest travel days.",
          "link": "https://www.reviewgeek.com/122245/supercharge-your-tesla-for-free-during-off-peak-hours-this-holiday-weekend/",
          "publishedOn": "2022-07-02T16:34:15.000Z",
          "wordCount": 8205,
          "title": "Supercharge Your Tesla for Free During Off-Peak Hours This Holiday Weekend",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/03/4a806f39.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=813849",
          "author": "Joe Fedewa",
          "description": "User profiles are a great way to give everyone in your house their own personal place on Google TV. It’s easy to add user profiles, but what about removing them? We’ll show you how it’s done.",
          "link": "https://www.howtogeek.com/813849/how-to-remove-google-tv-profiles/",
          "publishedOn": "2022-07-02T16:00:02.000Z",
          "wordCount": 15617,
          "title": "How to Remove Google TV Profiles",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/Shutterstock_1951053493.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=731035",
          "author": "Joe Fedewa",
          "description": "There’s nothing like a beautiful sunny day, but it can end in itchy pain if you’re not careful. Using sunscreen and knowing when the sun is harshest can help with that. The UV Index makes that easier to understand.",
          "link": "https://www.howtogeek.com/731035/how-to-check-the-uv-index/",
          "publishedOn": "2022-07-02T15:00:00.000Z",
          "wordCount": 16043,
          "title": "How to Check the UV Index",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/sun-burst.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=774439",
          "author": "Gaurav Shukla",
          "description": "QLED TVs promise to offer fantastic picture quality, but in a market full of televisions with quantum dot technology, it can be hard to choose the best. To help, we have handpicked the best QLED TVs you can buy.",
          "link": "https://www.howtogeek.com/774439/best-qled-tv/",
          "publishedOn": "2022-07-02T14:00:00.000Z",
          "wordCount": 18471,
          "title": "The Best QLED TVs of 2022",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/12/TV-in-living-room-header.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/121570/what-are-solid-state-ev-batteries/",
          "author": "Cory Gunther",
          "description": "Electric vehicles are new, fun, and evolving at a rapid pace. And while we’re seeing major improvements to charging speeds and mileage, there’s still a long way to go. One of the more exciting advancements is solid-state batteries, and you’ll be hearing a lot about them in the near future.",
          "link": "https://www.reviewgeek.com/121570/what-are-solid-state-ev-batteries/",
          "publishedOn": "2022-07-02T13:00:51.000Z",
          "wordCount": 8875,
          "title": "What Are Solid-State EV Batteries?",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/2b317609.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=808435",
          "author": "Sydney Butler",
          "description": "We’ve all been there: sitting in front of the TV, looking for something to watch on Netflix, but eventually just giving up and doing something else. You’re experiencing choice paralysis, but don’t worry because there are ways to unfreeze yourself again.",
          "link": "https://www.howtogeek.com/808435/how-to-pick-something-on-netflix/",
          "publishedOn": "2022-07-02T13:00:00.000Z",
          "wordCount": 16597,
          "title": "How to Pick Something on Netflix (and Spend Less Time Scrolling)",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/woman-watching-tv.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=814178",
          "author": "Joe Fedewa",
          "description": "Saving money on groceries isn’t just about finding the lowest price on tortillas. The quantity of food you buy is also important. There are some handy apps you can use to make your trips to the grocery store less stressful.",
          "link": "https://www.howtogeek.com/814178/apps-to-save-money-on-groceries-and-waste-less-food/",
          "publishedOn": "2022-07-02T12:00:00.000Z",
          "wordCount": 16125,
          "title": "Use These Apps to Save Money on Groceries & Waste Less Food",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/meal-apps.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=805957",
          "author": "Tim Brookes",
          "description": "The Nintendo Switch is quickly on the way to being the most successful console of all time. This is thanks in large part to an excellent catalog of games, both exclusive and third-party. Here are some of our favorites as of 2022.",
          "link": "https://www.howtogeek.com/805957/what-are-the-best-nintendo-switch-games-in-2022/",
          "publishedOn": "2022-07-02T11:00:42.000Z",
          "wordCount": 18476,
          "title": "What Are the Best Nintendo Switch Games in 2022?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/shutterstock_1454397305.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=814337",
          "author": "Josh Bell",
          "description": "Israel Adesanya and Jared Cannonier face off for the middleweight championship at UFC 276, broadcast from Las Vegas’ T-Mobile Arena on July 2, 2022, at 10 p.m. ET / 7 p.m. PT. Here’s how to stream it live.",
          "link": "https://www.howtogeek.com/814337/how-to-watch-ufc-276/",
          "publishedOn": "2022-07-02T10:00:14.000Z",
          "wordCount": 16048,
          "title": "How to Watch UFC 276 Adesanya vs Cannonier Live Online",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/ufc-276.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=425623",
          "author": "Chris Hoffman",
          "description": "Did you know your keyboard has a menu key? On full-size keyboards, you’ll find it to the left of your right Ctrl key. This key opens context menus, but you can tweak it to make it more useful.",
          "link": "https://www.howtogeek.com/425623/what-is-the-menu-key-for-and-how-to-remap-it/",
          "publishedOn": "2022-07-01T21:00:00.000Z",
          "wordCount": 16446,
          "title": "What Is the Menu Key For? (and How to Remap It)",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2019/06/img_5d0a9b02b5119.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122251/sprints-networks-are-permanently-out-of-service/",
          "author": "Andrew Heinzman",
          "description": "It took a long time, but Sprint’s awful LTE network is finally retired. That leaves zero Sprint networks in operation, as T-Mobile shut down the provider’s ancient 3G CDMA network earlier this year. If you’re a long-time Sprint customer and your phone’s acting up, it’s time to upgrade or ask T-Mobile for a new SIM card.",
          "link": "https://www.reviewgeek.com/122251/sprints-networks-are-permanently-out-of-service/",
          "publishedOn": "2022-07-01T20:33:29.000Z",
          "wordCount": 8220,
          "title": "Sprint's Network Is Permanently Out of Service",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/16362bc1.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=763825",
          "author": "Marshall Gunnell",
          "description": "Tired of your still desktop background? You can liven things up by setting a live wallpaper or animated desktop background. Unfortunately, there’s no native way to do this in Windows 11, but there’s a handy third-party app you can use.",
          "link": "https://www.howtogeek.com/763825/how-to-get-live-wallpapers-on-windows-11/",
          "publishedOn": "2022-07-01T20:00:00.000Z",
          "wordCount": 16198,
          "title": "How to Get Live Wallpapers on Windows 11",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/windows_11_basic_hero_dark.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122229/does-your-internet-provider-know-that-youre-using-a-vpn/",
          "author": "Andrew Heinzman",
          "description": "We often use VPNs to obscure our identity online. This opens the door to region-locked content, and more importantly, it hides our activity from companies who collect and sell private data. There’s just one awkward fact to consider; your internet service provider (ISP) also collects private data, and it knows that you’re using a VPN.",
          "link": "https://www.reviewgeek.com/122229/does-your-internet-provider-know-that-youre-using-a-vpn/",
          "publishedOn": "2022-07-01T19:36:29.000Z",
          "wordCount": 8993,
          "title": "Does Your Internet Provider Know That You're Using a VPN?",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/0760723c.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=811043",
          "author": "Mahesh Makvana",
          "description": "Superfetch (known as SysMain in Windows 10 and Windows 11) is a built-in Windows service that preloads your frequently used apps in the RAM. If you experience sluggish performance on your PC, you may want to turn this feature off. Here’s how to do that.",
          "link": "https://www.howtogeek.com/811043/disable-superfetch/",
          "publishedOn": "2022-07-01T19:00:53.000Z",
          "wordCount": 15831,
          "title": "How to Disable Superfetch on Windows 10 and 11",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/08/windows-11-and-10.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=811066",
          "author": "Sandy Writtenhouse",
          "description": "Have you ever started adding text to your document only to discover it would be better suited in a table? After all, a table provides a solid structure and appearance. In Word, you can simply convert text to table.",
          "link": "https://www.howtogeek.com/811066/convert-text-to-table-in-word/",
          "publishedOn": "2022-07-01T18:00:07.000Z",
          "wordCount": 16078,
          "title": "How to Convert Text to a Table in Microsoft Word",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/microsoft_word_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=815524",
          "author": "Corbin Davenport",
          "description": "Starlink is an internet service operated by SpaceX that uses thousands of small satellites in low Earth orbit. It has been limited to fixed stations, like homes and parked RVs, but now Starlink is coming to moving vehicles.",
          "link": "https://www.howtogeek.com/815524/your-next-flight-could-have-fast-starlink-satellite-internet/",
          "publishedOn": "2022-07-01T17:10:27.000Z",
          "wordCount": 15625,
          "title": "Your Next Flight Could Have Fast Starlink Satellite Internet",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/07/shutterstock_1929563561.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122233/this-gmc-hummer-ev-problem-should-have-buyers-worried/",
          "author": "Cory Gunther",
          "description": "GMC started filling pre-orders and shipping its impressively powerful Hummer EV late last year. So many people bought one that the company closed the reservation list, and it’s sold out until 2024. But GMC has a big problem that should worry buyers—it’s only building 12 Hummer electric trucks per day.",
          "link": "https://www.reviewgeek.com/122233/this-gmc-hummer-ev-problem-should-have-buyers-worried/",
          "publishedOn": "2022-07-01T17:08:18.000Z",
          "wordCount": 8329,
          "title": "This GMC Hummer EV Problem Should Have Buyers Worried",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/04/c2c5c29b.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=814465",
          "author": "Colin Brightfield",
          "description": "Solana is a high-speed and permissionless layer 1 public blockchain that is sometimes called an “Ethereum Killer” because it features cheap fees and fast transactions compared to the often expensive “gas” fees due to high traffic on Ethereum.",
          "link": "https://www.howtogeek.com/814465/what-is-solana-and-why-is-it-called-an-ethereum-killer/",
          "publishedOn": "2022-07-01T17:00:41.000Z",
          "wordCount": 16914,
          "title": "What Is Solana, and Why Is It Called an “Ethereum Killer”?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/solana-logo.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=813664",
          "author": "Joe Fedewa",
          "description": "QR codes have become increasingly common as more of the world transitions away from paper. All you need is your trusty Android phone to scan one, but how? We’ll show you the easiest and fastest way to do it.",
          "link": "https://www.howtogeek.com/813664/the-fastest-way-to-scan-a-qr-code-on-android/",
          "publishedOn": "2022-07-01T16:00:51.000Z",
          "wordCount": 15819,
          "title": "The Fastest Way to Scan a QR Code on Android",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/Android-QR-code.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122228/cruises-self-driving-taxi-program-is-off-to-a-terrible-start/",
          "author": "Cory Gunther",
          "description": "These vehicles are autonomous, with no humans inside in case anything goes wrong, and that’s exactly what happened. According to TechCrunch, images of the situation quickly appeared all over Twitter and Reddit, with users quick to make jokes about robots coming to take over the human resistance.",
          "link": "https://www.reviewgeek.com/122228/cruises-self-driving-taxi-program-is-off-to-a-terrible-start/",
          "publishedOn": "2022-07-01T15:59:27.000Z",
          "wordCount": 8421,
          "title": "Cruise's Self-Driving Taxi Program Is Off to a Terrible Start",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/464aaf6b.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=815492",
          "author": "Corbin Davenport",
          "description": "Comcast Xfinity normally uses a cable connection for TV access, but the company does have an ‘Xfinity Stream‘ app for watching TV over the internet instead. Now the app is finally available on Apple TV streaming devices.",
          "link": "https://www.howtogeek.com/815492/you-can-now-watch-xfinity-tv-on-apple-tv/",
          "publishedOn": "2022-07-01T15:27:07.000Z",
          "wordCount": 15660,
          "title": "You Can Now Watch Xfinity TV on Apple TV",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/07/Stream_on_Apple_TV_image.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122224/buy-an-apple-tv-get-a-50-gift-card-for-free/",
          "author": "Andrew Heinzman",
          "description": "In what can only be described as a pleasant surprise, Apple is running a huge promotion on its streaming boxes. New purchases of an Apple TV 4K or Apple TV HD come with a $50 Apple Gift Card, which you can use to buy media, apps, subscriptions, or new Apple products.",
          "link": "https://www.reviewgeek.com/122224/buy-an-apple-tv-get-a-50-gift-card-for-free/",
          "publishedOn": "2022-07-01T15:18:17.000Z",
          "wordCount": 8200,
          "title": "Buy an Apple TV, Get a $50 Gift Card for Free",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/fb2c35e0.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=808757",
          "author": "Benj Edwards",
          "description": "If you’re getting older like me, you might find that it’s harder to see what is on your computer screen than it used to be. Here are some tips to make using your Windows 10 or 11 machine easier and more comfortable with diminished sight.",
          "link": "https://www.howtogeek.com/808757/getting-older-heres-how-to-make-windows-more-comfortable/",
          "publishedOn": "2022-07-01T15:00:50.000Z",
          "wordCount": 16124,
          "title": "Getting Older? Here’s How to Make Windows More Comfortable",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/squinting_at_computer_hero_2.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122222/rufus-lets-you-install-windows-11-without-a-microsoft-account/",
          "author": "Andrew Heinzman",
          "description": "Thanks to the 2H22 update, installing Windows 11 without a Microsoft account is nearly impossible. This update patches some of the easiest workarounds for Microsoft’s silly requirement, and it even forces Pro users to type in a username and password. But you can still avoid this nonsense using Rufus, an open-source formatting utility.",
          "link": "https://www.reviewgeek.com/122222/rufus-lets-you-install-windows-11-without-a-microsoft-account/",
          "publishedOn": "2022-07-01T14:52:21.000Z",
          "wordCount": 8167,
          "title": "Rufus Lets You Install Windows 11 Without a Microsoft Account",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2021/10/59b2900a.png"
        },
        {
          "id": "https://www.reviewgeek.com/121142/this-month-in-tech-history-july/",
          "author": "Danny Chadwick",
          "description": "July sees the beginnings of several tech icons. From the births of portable music and two beloved video game characters to the founding of two tech industry behemoths, find out what happened below.",
          "link": "https://www.reviewgeek.com/121142/this-month-in-tech-history-july/",
          "publishedOn": "2022-07-01T14:24:55.000Z",
          "wordCount": 9714,
          "title": "This Month in Tech History: July",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/1cec7dbd.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=815285",
          "author": "Corbin Davenport",
          "description": "3D Pinball Space Cadet was a game first included in the ‘Microsoft Plus!’ pack for Windows 95, and it gained popularity for its inclusion in Windows XP. Even though the game doesn’t ship with Windows anymore, you can still play it on just about anything.",
          "link": "https://www.howtogeek.com/815285/you-can-now-play-3d-pinball-from-windows-on-nearly-anything/",
          "publishedOn": "2022-07-01T14:23:21.000Z",
          "wordCount": 15746,
          "title": "You Can Now Play 3D Pinball From Windows on Nearly Anything",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/3D-Pinball.png?height=200p&trim=2,2,2,2"
        }
      ]
    },
    {
      "title": "IlSoftware.it",
      "feedUrl": "https://www.ilsoftware.it/rss.asp",
      "siteUrl": "https://www.ilsoftware.it",
      "articles": [
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Proteggere-PDF-con-password-e-crittografia-gratis_24735",
          "author": null,
          "description": "Windows 10 e 11 integrano la stampante virtuale Microsoft Print to PDF che permette di creare documenti PDF senza installare nient'altro. Come nel caso delle precedenti versioni del sistema operativo Microsoft, tuttavia, Windows 10 e 11 non includono un'opzione per proteggere PDF con password.Eppure fare in modo che un documento PDF sia leggibile soltanto dalla persona in possesso della password corretta si rivela spesso molto utile.Buona parte delle soluzioni software che permettono di proteggere i documenti PDF sono a pagamento e questo tipo di funzione di solito fa parte di costose applicazioni.La buona notizia è che esiste un programma open source in grado di crittografare i documenti PDF usando algoritmi come AES-256 supportato ad esempio Adobe Acrobat 8 e successivi.Il software si chiama PDFEncrypt, utilizza la libreria open source iTextPDF e il suo codice sorgente è disponibile su GitHub.Scaricabile da questa pagina (consigliamo l'uso della versione portabile che non necessita di installazione), PDFEncrypt consente di proteggere PDF senza dover acquistare alcun costoso software.Per usare il programma basta estrarre il contenuto del file Zip in una cartella di propria scelta quindi cliccare due volte sull'eseguibile PDFEncrypt.exe.Il funzionamento è semplicissimo: basta indicare il file PDF da proteggere con password nel campo Choose a file to encrypt, il nome del file che si desidera ottenere e dove si vuole memorizzarlo nel campo Choose a destination for the encrypted file.Nel campo Specify a password si può specificare la password richiesta per l'apertura del file (dovrebbe essere scelta in maniera tale che sia sufficientemente lunga e complessa): con un clic su Generate PDFEncrypt si occupa della generazione di una password adeguata.\n\nPDFEncrypt non nasconde i caratteri inseriti nel campo della password con i classici asterischi o pallini.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Proteggere-PDF-con-password-e-crittografia-gratis_24735",
          "publishedOn": "2022-07-01T15:02:00.000Z",
          "wordCount": null,
          "title": "Proteggere PDF con password e crittografia gratis",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Make Tech Easier",
      "feedUrl": "https://feeds.maketecheasier.com/MakeTechEasier",
      "siteUrl": "https://www.maketecheasier.com",
      "articles": [
        {
          "id": "https://www.maketecheasier.com/?p=247380",
          "author": "Megan Glosson",
          "description": "There’s no denying we all love our electronic devices these days. In fact, even seniors enjoy using iPads and iPhones to FaceTime with loved ones or entertain themselves. But, as people age, these devices may not be fully accessible to them fresh out of the box. Enter Apple’s inbuilt accessibility settings – the best way to set up an iOS device for seniors to help them use an iPad or an iPhone more simply. Let’s see how to configure these devices for ease of access.\n    \nNote: Most of the suggestions listed below can be accessed from “Settings -> Accessibility.”\n   \n\nContent\n\n1. Increase Icon Size\n2. Adjust Font Size and Boldness\n3. Enable Zoom and Magnify\n4. Increase Screen Contrast\n5. Enable Voice Commands\n6. Turn on Subtitles and Captioning\n7. Adjust Hearing Settings\n8. Turn On Assistive Touch\n9. Turn On Touch Accommodations\n10. Enable Guided Access\n11. Set Up Shortcuts\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/8275897/iphone-accessibility-hacks",
          "publishedOn": "2022-07-02T19:25:00.000Z",
          "wordCount": 2588,
          "title": "How to Set Up an iPad or iPhone for Seniors",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/iPad-iPhone-Seniors-Feature-Image.jpg"
        },
        {
          "id": "http://maketecheasier.com/?post_type=post-ideas&p=63108",
          "author": "Crystal Crowder",
          "description": "Microsoft SharePoint may be a powerhouse when it comes to project management and collaboration, but the best SharePoint alternatives prove Microsoft is far from the only option. From individuals to large businesses, productivity, collaboration, and project management apps are a must. SharePoint gives you all of this in one convenient platform, but it gets expensive quickly. Free SharePoint alternatives are ideal for saving money without sacrificing features.\n   \n\nContent\n\n1. ClickUp\n2. Atlassian Confluence\n3. Bitrix24\n4. Slack\n5. Process Street\n6. ONLYOFFICE Workspace\n7. Jostle\n8. Monday\n9. Google\n10. WordPress\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:7 Project Management Tools Made For Any Team\n    \n1. ClickUp\n    \nClickUp seeks to be a one-app solution to all of your collaborative needs and works well as a free SharePoint alternative. It’s designed to handle everything from project management to team meetings all in... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/8844615/5-free-alternatives-to-microsoft-sharepoint",
          "publishedOn": "2022-07-02T00:25:00.000Z",
          "wordCount": 2924,
          "title": "10 Free Microsoft SharePoint Alternatives",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/06/best-free-microsoft-sharepoint-alternatives-featured.jpg"
        },
        {
          "id": "https://www.maketecheasier.com/?p=368404",
          "author": "Ryan Lynch",
          "description": "DIG is a one of the best emulator frontends for Android devices. DIG makes categorizing your video game emulators and ROMs easy and attractive. With support for Android, everyone can now take advantage of DIG to play retro games.\n   \n\nContent\n\nWhat Is DIG and What Does It Do?\nWhat Is a ROM? What Is an emulator?\n1. How to Install DIG\n2. Add ROMs to Your Device\n3. Scan for ROMS\n4. Configure the Emulators\n5. Change the Default Emulator\n6. Scrape for Missing Cover Art and Metadata\n7. Customize the Theme\n8. Customize How Games Are Displayed\n9. Set DIG to Auto-Start\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:Best iOS and Android Games With Controller Support\n    \nWhat Is DIG and What Does It Do?\n    \nThere are a ton of emulators available for Android devices that mimic the hardware of retro video... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/13951282/configure-dig-emulator-frontend-android",
          "publishedOn": "2022-07-01T21:25:00.000Z",
          "wordCount": 3566,
          "title": "How to Configure DIG Emulator Frontend for Android",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/03/dig-feature.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=deal&p=501825",
          "author": "Laura Tucker",
          "description": "When you have to wear a headset all day long while working, you need all-day comfort. You’ll get that and more with a LostSoul Bluetooth Headset with Microphone. Add on noise canceling and extra-long battery life, and you’ll have everything you need. The $80 discount is just a bonus.\n    \nThe wireless headset has a comfortable earcup made of ultra-soft protein leather to be comfortable on your ears throughout the day. The microphone rotates 270º and can be used on either the left or the right, whichever suits you best.\n    \nThe mute function and dual-mic noise canceling on the LostSoul Bluetooth Headset with Microphone are great for office work and outdoors, such as on construction sites. The features work especially well for truckers as well. Easily answer and hang up calls through the headset. It works with Skype, Zoom, and Teams if set up through the software ahead of time.\n   \n \n   \nUse them all day without worrying about them dying. Wear them for up to 60 hours of continuous talk time or... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15405886/lostsoul-bluetooth-headset-with-microphone",
          "publishedOn": "2022-07-01T19:25:00.000Z",
          "wordCount": 940,
          "title": "Save $80 on a LostSoul Bluetooth Headset with Microphone",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/07/lostsoul-bluetooth-headset-featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=pitch&p=477257",
          "author": "Ramces Red",
          "description": "The Linux Kernel is a brilliant piece of software engineering. At more than a million lines of code, it is arguably one of the most complex programs that is still in active development today. Since the late 1990s, the Linux kernel has been used in both computationally intensive projects as well as barebones embedded applications.\n   \n\nContent\n\nWhat is a Kernel and Why Configure It?\n1. Use the Help System\n2. Disable Unnecessary HID Support\n3. Disable Unnecessary Filesystem Support\n4. Disable Unnecessary Graphics Drivers\n5. Install Drivers as Modules\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:5 Best Linux-Libre Distributions for Better Security\n    \nWhat is a Kernel and Why Configure It?\n    \nDespite all of that, the Linux kernel is just a program that serves as a link between the hardware in your computer and the software that you use everyday. It is what allows... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15405563/useful-tips-compile-linux-kernel",
          "publishedOn": "2022-07-01T15:25:00.000Z",
          "wordCount": 3131,
          "title": "5 Useful Tips When Compiling Your Own Linux Kernel",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/04/5-kernel-tips-00-featured-image.jpg"
        }
      ]
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/feed/",
      "siteUrl": "https://blog.mozilla.org",
      "articles": []
    },
    {
      "title": "Navigaweb.net",
      "feedUrl": "https://feeds.feedburner.com/navigaweb/",
      "siteUrl": "https://www.navigaweb.net/",
      "articles": [
        {
          "id": "https://www.navigaweb.net/2013/02/giochi-piu-divertenti-android-ipad-iphone.html",
          "author": null,
          "description": "Con gli smartphone diventati ormai delle console portatili per videogiochi, data l'abbondanza di titoli disponibili per pochi Euro o anche gratis dagli Store dei vari modelli, vale la pena scorrere una nuova lista di giochi divertenti, che possono essere giocati per 5 minuti o più, ogni momento libero o di attesa.\r\n\r\n Vediamo quindi, in questa selezione, i giochi simili e successori di Angry Birds,...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2013/02/giochi-piu-divertenti-android-ipad-iphone.html",
          "publishedOn": "2022-07-02T13:25:00.000Z",
          "wordCount": 5658,
          "title": "Giochi più divertenti e veloci da 5 minuti su Android e iPhone",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhk27blgk4J8BuAJ3tIS0XkRYGlTwFpapcdZRc3L9Rk6FwRC9dDER5WifGFW_gv1KwDheoAG516tjUtTVLNeYl9nLeSVbc0uASd8zz6jmqJaxNaV1amOdpr_r0A9kpev68apwlUprHdJ_AmHEIqp4RcxfVctlQ5orYfuSnRyrAaGAKA3ZY4OtPMPPz6/w1200-h630-p-k-no-nu/Migliori%20giochi%20rapidi%20per%20telefono.jpg"
        },
        {
          "id": "https://www.navigaweb.net/2014/05/entrare-nel-router-per-accedere-alle.html",
          "author": null,
          "description": "Il modem (conosciuto anche come router o modem/router) è l'apparecchio che ci consente di collegare un gran numero di dispositivi alla nostra rete Internet. I computer in nostro possesso si collegano alla rete creata dal router tramite connessione wireless oppure via cavo Ethernet, così da avere i parametri d'accesso e navigare su Internet.\r\n\r\n In qualsiasi caso, qualsiasi sia il router che si sta...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2014/05/entrare-nel-router-per-accedere-alle.html",
          "publishedOn": "2022-07-01T15:49:00.000Z",
          "wordCount": 5093,
          "title": "Entrare nel router per accedere alle impostazioni in modo semplice",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEijhGKGg1qCiTiT4-C3n6Pyc_5B6uuQsTvezRjd8HH7GcBw4nxIh3eIokiJOVpH2GWSMI6-BBnEoWL_mg1Tzk6i4_IsOl72rLqGKGbe5UFusnV7l0IJLoxau1lBMHo92RXpxW9qrOQkQ2dhdMR6Xl7juzRFUljL8zm4Jxt8JFfQPRQ3dnJJRvKUTGyc/w1200-h630-p-k-no-nu/Accedere%20impostazioni%20modem%20router.jpg"
        },
        {
          "id": "https://www.navigaweb.net/2022/07/come-installare-windows-su-disco.html",
          "author": null,
          "description": "I dischi esterni USB possono essere utilizzati in molteplici scenari; nella maggior parte dei casi vengono utilizzati come dischi di backup per i file personali, ma i più esperti possono utilizzare un disco esterno come un vero e proprio sistema operativo d'emergenza, ottimo quando il PC non si avvia più ed è necessario mettere in salvo i file personali. \r\nSe anche noi vogliamo creare il nostro...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2022/07/come-installare-windows-su-disco.html",
          "publishedOn": "2022-07-01T14:20:00.001Z",
          "wordCount": 5275,
          "title": "Come installare Windows su disco esterno USB",
          "imageUrl": "https://blogger.googleusercontent.com/img/a/AVvXsEjzx5sIMl6eHVIMgK7UIt9J7_9inWcl1mM6-IacvXjy6yu7w8vps3n26fqeGr8XNxrx53dKOA83KOfcPjGlPpAaJ91SvMmTkctXanmRRfCSWvjMfbq_Spt8ioBx8IcNledszSTwTyB8slzGL6CbpPDisPgLyyOKcqEA7BHtltLIC-u5iBQzqmERyIwI=w1200-h630-p-k-no-nu"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-515.49.06-Linux-Beta",
          "author": null,
          "description": "For those enjoying some Linux gaming over the US holiday weekend, NVIDIA issued a rare Saturday driver update in the form of new Vulkan driver betas for Windows and Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-515.49.06-Linux-Beta",
          "publishedOn": "2022-07-02T23:16:06.000Z",
          "wordCount": 1300,
          "title": "NVIDIA 515.49.06 Linux Vulkan Beta Driver Released",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Darktable-4.0-Released",
          "author": null,
          "description": "Darktable 4.0 has debuted today as a major update to this open-source, cross-platform RAW photography software suite...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Darktable-4.0-Released",
          "publishedOn": "2022-07-02T17:15:28.000Z",
          "wordCount": 1257,
          "title": "Darktable 4.0 Released With Rewritten UI, Much Improved OpenCL Performance",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DG2-ATS-M-DIDs-Small-BAR",
          "author": null,
          "description": "After many months and a lot of work by the open-source Intel Linux graphics driver developers, Linux 5.20 looks like it will be the base kernel where the DG2/Alchemist Arc Graphics desktop GPUs and Arctic Sound M (ATS-M) server graphics card support will be ready in usable shape...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DG2-ATS-M-DIDs-Small-BAR",
          "publishedOn": "2022-07-02T13:11:26.000Z",
          "wordCount": 1650,
          "title": "Linux 5.20 Looks To Be Primed For Usable DG2/Alchemist Desktop Graphics & ATS-M Support",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Mint-17-No-OOMD",
          "author": null,
          "description": "Linux Mint 21 is working its way toward release this summer as the latest version of this desktop OS that is being built atop Ubuntu 22.04 LTS. Unlike Ubuntu 22.04 upstream that is now using systemd-oomd by default on the desktop to try to improve the low memory / system memory pressure experience, Linux Mint has now decided to avoid this daemon due to user criticism...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Mint-17-No-OOMD",
          "publishedOn": "2022-07-02T11:09:37.000Z",
          "wordCount": 1395,
          "title": "Linux Mint 21 Is Going To Avoid systemd-oomd",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Xonotic-0.8.5-Released",
          "author": null,
          "description": "It's sadly been years since having anything major to report on for Xonotic, the open-source first person shooter game that started out many years ago as Nexuiz. Thankfully a new version of Xonotic was published this week and while it's just a point release, it does come with many improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Xonotic-0.8.5-Released",
          "publishedOn": "2022-07-02T10:30:00.000Z",
          "wordCount": 1381,
          "title": "Xonotic 0.8.5 Improves This Prominent Open-Source Game",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Firewalld-1.2-Released",
          "author": null,
          "description": "Firewalld 1.2 was released on Friday as the newest feature release for this Linux firewall daemon. Bug fix releases for existing stable series were released with Firewalld 1.1.2, 1.0.5, and 0.9.9...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Firewalld-1.2-Released",
          "publishedOn": "2022-07-02T10:00:00.000Z",
          "wordCount": 1225,
          "title": "Firewalld 1.2 Released With New Services Added",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Starts-July-2022",
          "author": null,
          "description": "The summer months aren't slowing down KDE developers as it's been another busy week of bug fixes and feature work for KDE developers to kick off July...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Starts-July-2022",
          "publishedOn": "2022-07-02T09:16:31.000Z",
          "wordCount": 1321,
          "title": "KDE Kicks Off July With UI Polishing, Bug Fixing",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.3.219-Released",
          "author": null,
          "description": "Vulkan 1.3.219 released this week and in addition to a number of documentation clarifications/corrections there are two new extensions...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.3.219-Released",
          "publishedOn": "2022-07-02T09:00:15.000Z",
          "wordCount": 1278,
          "title": "Vulkan 1.3.219 Released With Two New Extensions",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Linux-June-2022",
          "author": null,
          "description": "With the new month comes the latest figures from Valve regarding the Steam on Linux marketshare and other metrics for the past month as a result of the Steam Survey...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Linux-June-2022",
          "publishedOn": "2022-07-02T00:44:36.000Z",
          "wordCount": 1414,
          "title": "Steam On Linux Marketshare Ticks Up To 1.18% For June",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-7.12-Released",
          "author": null,
          "description": "Wine 7.12 is out as the newest development release of this program for running Windows games and applications under Linux and other platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-7.12-Released",
          "publishedOn": "2022-07-01T19:22:36.000Z",
          "wordCount": 1286,
          "title": "Wine 7.12 Released With Theming For Qt5 Apps, VKD3D v1.4",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-37-Firmware-Growth",
          "author": null,
          "description": "The size of the linux-firmware.git tree continues to grow with Linux continuing to support more and more modern hardware that is increasingly reliant upon firmware blobs for operation.  Most Linux distributions like Fedora end up installing this entire set of Linux firmware files that can easily be 200~300MB even though most systems only use a few select files. With Fedora 37 later this year they are hoping to better deal with the situation by splitting up of linux-firmware and only installing sets of firmware packages depending upon the actual hardware in use...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-37-Firmware-Growth",
          "publishedOn": "2022-07-01T18:38:04.000Z",
          "wordCount": 1485,
          "title": "Fedora 37 Looks To Better Manage Its 175MB+ Of Linux Firmware Blobs",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RISC-V-Dev-Laptop",
          "author": null,
          "description": "RISC-V International has relayed word to us that in China the DeepComputing and Xcalibyte organizations have announced pre-orders on the first RISC-V laptop intended for developers. The \"ROMA\" development platform features a quad-core RISC-V processor, up to 16GB of RAM, up to 256GB of storage, and should work with most RISC-V Linux distributions...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RISC-V-Dev-Laptop",
          "publishedOn": "2022-07-01T17:55:18.000Z",
          "wordCount": 1509,
          "title": "The First RISC-V Laptop Announced With Quad-Core CPU, 16GB RAM, Linux Support",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Feed principale [TurboLab.it]",
      "feedUrl": "https://turbolab.it/feed",
      "siteUrl": "http://turbolab.it",
      "articles": [
        {
          "id": "3615|20220702000001",
          "author": "info@turbolab.it (TurboLab.it)",
          "description": "Non hai tempo di leggerci tutti i giorni? nessun problema! ecco a te il riepilogo di quanto proposto da TurboLab.it nel corso della settimana in conclusione.\n›› Leggi tutto",
          "link": "https://turbolab.it/newsletter-turbolab.it-1349/questa-settimana-tli-02-luglio-2022-3615",
          "publishedOn": "2022-07-01T22:00:01.000Z",
          "wordCount": 1598,
          "title": "Questa settimana su TLI (02 luglio 2022)",
          "imageUrl": "https://turbolab.it/immagini/17503/max"
        }
      ]
    },
    {
      "title": "Latest topics for ZDNet in Windows",
      "feedUrl": "https://www.zdnet.com/topic-windows/rss.xml",
      "siteUrl": "https://www.zdnet.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}