{
  "sources": [
    {
      "title": "7-Zip",
      "feedUrl": "https://sourceforge.net/projects/sevenzip/rss?path=/7-Zip",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "Releases – APKMirror",
      "feedUrl": "https://www.apkmirror.com/apk/apkmirror/apkmirror-installer-official/feed/",
      "siteUrl": "https://www.apkmirror.com",
      "articles": []
    },
    {
      "title": "Equalizer APO",
      "feedUrl": "https://sourceforge.net/projects/equalizerapo/rss?path=/",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "mpv player (Windows)",
      "feedUrl": "https://sourceforge.net/projects/mpv-player-windows/rss?path=/release",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "Arch Linux",
      "feedUrl": "https://www.reddit.com/r/archlinux/.rss",
      "siteUrl": "https://www.reddit.com/r/archlinux/",
      "articles": [
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vvg7oq/binary_version_of_vaapi_patched_chromium_on/",
          "author": null,
          "description": "Is the only source for chromium with VAAPI support on Wayland only available as source code from AUR/chromium-wayland-vaapi that you need to compile on your own system? If so what have you done to speed up time? For me downloading and building took 5 hours on my i5-1135G7 CPU.\n    submitted by    /u/ZD_plguy17  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vvg7oq/binary_version_of_vaapi_patched_chromium_on/",
          "publishedOn": "2022-07-10T01:23:03.000Z",
          "wordCount": 25607,
          "title": "Binary version of VAAPI patched chromium on native Wayland",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vvfzbb/i_shouldnt_have_doubted_myself/",
          "author": null,
          "description": "So first of all, I'm an idiot. I unironically bought a new Macbook Pro in 2017. I know, I know. I should have known better. In 2015 I daily drove Ubuntu on an old Dell laptop and that experience was less than pleasant. I walked away thinking, \"I'll keep my Ubuntu servers, but the desktop is just too much of a headache.\"\n Fast foward to 2018. I get a once in a lifetime chance to visit a foreign country with my dad. No way I'm bringing a $2500 laptop with me, so I bought one of the 2011 Lenovo no HDD specials on eBay, threw a SSD in there, and installed Pop!_OS. Sure as hell wasn't going to run Windows.\n After we checked into a hotel, my dad asked to use the laptop to check his emails, the news, etc. He commented how nice the computer was, \"Where did you get this?\" Lol. I had to agree, it wa…",
          "link": "https://www.reddit.com/r/archlinux/comments/vvfzbb/i_shouldnt_have_doubted_myself/",
          "publishedOn": "2022-07-10T01:10:06.000Z",
          "wordCount": 26382,
          "title": "I shouldn't have doubted myself",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vvejym/help_firefox_playing_through_wrong_device_after/",
          "author": null,
          "description": "Question\n How can I set my default audio device to \"EasyEffects Sink\" using WirePlumber, such that every audio output plays through EasyEffects before going to my sound card?\n Details\n A few days ago, an update swapped out pipewire-media-session for wireplumber, and now Firefox doesn't play nice with EasyEffects.\n For all other programs, the audio plays through the correct devices. However, Firefox skips out the EasyEffects steps and goes straight to my USB sound card.\n spotify -> EasyEffects Sink -> equalizer -> USB Sound Card firefox -> USB Sound Card \n You can see my full patchbay here; https://imgur.com/a/6XlTLKl\n Using the Helvum patchbay, I can pipe the firefox audio output through EasyEffects Sink first, but it reverts back to going straight to my sound card after pausing any playing audio.\n    submitted by    /u/TheCrazyPhoenix416  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vvejym/help_firefox_playing_through_wrong_device_after/",
          "publishedOn": "2022-07-09T23:55:06.000Z",
          "wordCount": 25589,
          "title": "[Help] Firefox playing through wrong device after WirePlumber update",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv9r0s/do_i_need_to_install_a_scaling_governor_and_driver/",
          "author": null,
          "description": "Hi! I'm installing Arch for the first time and am following the general recommendations page. One thing that's not quite clear to me is the CPU frequency scaling. The wiki mentions scaling governors aswell as drivers and lists a few for both.\n However, it also states this:\n  \nA default scaling driver and governor are selected automatically \n  \nDo I need to install those governors and drivers or are there some defaults in place that will handle basic CPU frequency scaling for now?\n    submitted by    /u/t-to4st  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv9r0s/do_i_need_to_install_a_scaling_governor_and_driver/",
          "publishedOn": "2022-07-09T19:58:11.000Z",
          "wordCount": 25666,
          "title": "Do I need to install a scaling governor and driver?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv7ik7/windows_vm_change_permission_for/",
          "author": null,
          "description": "There was update for libvirt today and again there was information, that my /var/log/swtpm/libvirt/qemu have wrong permission - 730 instead 755. It's not first time I see this, but this time I was curious, what in the hell. I always change that to 755, but somehow it's back to 730. Today I understand what causing this: Windows VM... Any Linux or BSD VM don't do this, but Windows, sadly yes. Only file in this folder is win10-swtpm.log. Anyone has identical problem? Where I should report this?\n    submitted by    /u/antyhrabia  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv7ik7/windows_vm_change_permission_for/",
          "publishedOn": "2022-07-09T18:10:01.000Z",
          "wordCount": 25519,
          "title": "Windows VM change permission for /var/log/swtpm/libvirt/qemu after every start",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv6n26/terminal_font_size_really_large_on_one_monitor/",
          "author": null,
          "description": "https://imgur.com/Bf1X12n\n ​\n I'm using ZSH. I don't know what other information to provide. If you need any more information I'll be happy to provide it.\n    submitted by    /u/voltaf4  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv6n26/terminal_font_size_really_large_on_one_monitor/",
          "publishedOn": "2022-07-09T17:28:01.000Z",
          "wordCount": 25542,
          "title": "Terminal font size really large on one monitor but not on the others",
          "imageUrl": "https://external-preview.redd.it/zkvCc8CbHx8jZRBZnUsPQkI-6cefYuHTK2ACxeyWCFc.jpg?auto=webp&s=1d92c307ee945f4c53285a9c1ad22ee052e6caa0"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv6ibz/whats_up_with_mesagit/",
          "author": null,
          "description": "I'd really like some clarification on this. I asked this in the stickied thread but got no answer, so I'm making a post.\n In the AUR there is a stickied comment with instructions on how to manually build mesa-git, because apparently it's necessary due to compatibility with llvm.\n Okay, it kind of defeats the whole purpose of using an AUR helper if I have to do this manually, but surely I'm not the only person using mesa-git, and thus surely someone smarter than me must've written a script or something to automate this process right?\n Right?\n Apparently not. Why not? Is no one using mesa-git? Is every user using mesa-git taking the time to manually download and build mesa-git on every upgrade?\n Loving the downvotes from asking a question. How are people supposed to learn?\n    submitted by    /u/vimdiesel  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv6ibz/whats_up_with_mesagit/",
          "publishedOn": "2022-07-09T17:21:32.000Z",
          "wordCount": 26296,
          "title": "What's up with mesa-git?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv5n4v/help_wont_boot_snapshot_generated_by_grubbtrfs/",
          "author": null,
          "description": "Hi, sorry sorry for the English, it's not my mother tongue, I'm just translating.\n ​\n I recently reinstalled my Arch and decided to give Btrfs a try. Since creating snapshots is so easy, I was wondering if I might have some mechanism to recover from a damaged system without any external bootable media?\n ​\n For work purposes, I dualboot Arch and Windows, use the Windows boot partition mounted at /boot, and use grub as the bootloader.\n ​\n Create the subvolumes:\n @ --> /\n @home --> /home\n @snapshots --> /.snapshots\n I saw some cool tools like snapper, pacman hooks and grub-btrfs to automatically create snapshots and add them as entries in grub.\n Everything works as expected when I try to boot a snapshot with the same kernel, but if there is an update I can't boot the snapshots with an old kernel, it gives me the following error messages:\n ​\n Failed to mount /boot\n Dependency failed for Local File Systems\n ​\n Someone who knows what may be wrong in my configuration... Thanks\n    submitted by    /u/medicendav  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv5n4v/help_wont_boot_snapshot_generated_by_grubbtrfs/",
          "publishedOn": "2022-07-09T16:40:01.000Z",
          "wordCount": 25740,
          "title": "Help... Won't boot snapshot generated by grub-btrfs with separate /boot partition and old kernel.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv3i5c/35mm_microphone_doesnt_work_realtek_alc3254/",
          "author": null,
          "description": "Hi, I'm using pipewire, and pipewire-pulse package. I got a 3.5mm mic so I can record videos for a talk. They gave me a TRSS pin too for the computer.\n I haven't messed around much with audio before so it's a bit confusing to me, I ran the alsa-info scripthttp://alsa-project.org/db/?f=2ee94be11eab9c9abcea641d6b74392c5db9ea98\n And this is the output of `amixer -c1`.\n https://gist.github.com/afro-coder/b112a9631555dd4d302eba481cc10cba\n I've added the following to modprodbe.d/hda.conf\n options snd-hda-intel power_save=0 power_save_controller=N model=dell-headset-multi \n In my Volume control, I can see that there is an option for a headset microphone\n https://i.imgur.com/cJhpv1B.png\n Output of `pactl list-sources`\n https://gist.github.com/afro-coder/9ed3a2788797e831164dbdebd10381ce\n I can't seem to figure out if it's actually picking up the audio from the microphone or from the internal microphone and even OBS studio doesn't seem to be able to use it, the background noise that I get in the microphone is too loud\n The internal microphone picks up sounds from quite far away I tested the 3.5 mm with android and it silences the surrounding noise, so I'm not sure what more to check. Any help or nudge would help, been trying to figure this out for days.\n    submitted by    /u/afro_coder  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv3i5c/35mm_microphone_doesnt_work_realtek_alc3254/",
          "publishedOn": "2022-07-09T14:59:15.000Z",
          "wordCount": 25678,
          "title": "3.5mm Microphone doesn't work Realtek ALC3254",
          "imageUrl": "https://external-preview.redd.it/JLT112xQhW122uyFEdfP7FU-xJURqCfFtQS72mS_lf8.png?auto=webp&s=029f800282dc59ce61cf7270cacf2a9b55574111"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv1ttu/extending_root_partition/",
          "author": null,
          "description": "Hi! Im trying to extend my root partiotion.\n ​\n I've tried booting into a live usb Linux but neither gparted or gnome-disk GUI tools will let me do it.\n Is there no other way but creating a new partition then copy the content over ? \n Trying to extend sda2 here:\n https://i.imgur.com/Eo0Fo9y.png\n    submitted by    /u/Ok-Composer9185  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv1ttu/extending_root_partition/",
          "publishedOn": "2022-07-09T13:33:46.000Z",
          "wordCount": 26008,
          "title": "Extending root partition",
          "imageUrl": "https://external-preview.redd.it/5XetGdvX59ZgfieokirpZSYsL_8Rv3cC3FEjgsanjmE.png?auto=webp&s=172207c68ec9e4ae59e457444940378b8dfdd7f4"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vv15lu/arch_linux_failures_at_boot_and_soft_cpu_stuck/",
          "author": null,
          "description": "I'm running arch on a VirtualBox VM on Windows 10. \n I've managed to set up arch and had it running fine however, after making changes to my ~/.bash_profile to include startx so it starts on boot. Yes have tested startx before trying to boot into it and it worked fine.\n Im now getting these errors at boot: https://imgur.com/a/xVLkXXk\n This is the log from virtualbox: https://pastebin.com/irYX1XCK\n Any idea's how i go about fixing this?\n    submitted by    /u/DrShadyBusiness  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vv15lu/arch_linux_failures_at_boot_and_soft_cpu_stuck/",
          "publishedOn": "2022-07-09T12:57:18.000Z",
          "wordCount": 25715,
          "title": "Arch Linux failures at boot and soft CPU stuck. Arch guest in VirtualBox running on Win10",
          "imageUrl": "https://external-preview.redd.it/z3gkl1cqLm6bhS0kHIpBK6hLdGLpbQx0q2TJsRN5RtA.jpg?auto=webp&s=6a4c8028a1d63a3cdfd941991035eb6bada97a41"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuypo2/nvidia_mx_250_which_driver/",
          "author": null,
          "description": "I've been having ongoing issues with using my laptops GeForce mx 250 GPU. I was able to get things sorted and am using the lts kernel. However I'm really confused when rereading the Nvidia page, https://wiki.archlinux.org/title/NVIDIA#Installation :\n  \n Determine the necessary driver version for your card by:\n  \nVisiting NVIDIA's driver download site and using the dropdown lists. Finding the code name (e.g. NV50, NVC0, etc.) on nouveau wiki's code names page or nouveau's GitLab, then looking up the name in NVIDIA's legacy card list: if your card is not there you can use the latest driver.\n  \nI'm not sure that the mx 250 should be using latest driver or not? \n If it's not the GPU I have no idea what is going on at this point... I was able to use steam to game np, but last night all of a sudden any game I try to play is super laggy and killing the game freezes my whole system?! I can't find anything useful in the logs, and I've been scratching my head all day. Feel like it's the driver still but I could be wrong.\n    submitted by    /u/undeadalex  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuypo2/nvidia_mx_250_which_driver/",
          "publishedOn": "2022-07-09T10:22:09.000Z",
          "wordCount": 26090,
          "title": "NVIDIA MX 250 which driver?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuy7mw/x_wont_start_with_nvidia_driver/",
          "author": null,
          "description": "I am on a fresh install, on a newly built pc. I do not yet have a display manager, a de, or a wm. \n without any drivers, or with nouveau installed, everything is fine, normal boot, normal aspect ratio (small font), and startx launches normally, with a few xterms open.\n as soon as i install the proprietary nvidia driver and reboot, i get loads of udev output during boot, the aspect ratio seems to be off (the font is much larger and pixelated), and when I try running startx the system freezes. i am unable to type anything, kill the process, or switch TTY's. I have to hard shutdown by holding the power button. \n after reboot, Xorg logs are clear, no errors. \n i have installed both the normal and the dkms packages, both do the same thing. I have made sure to add the module to the kernel parameters, and is early loaded. i have blacklisted nouveau every way possible. before running startx, lsmod shows the nvidia module loaded, and shows no sign of nouveau.\n any ideas?\n    submitted by    /u/rangerlatham  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuy7mw/x_wont_start_with_nvidia_driver/",
          "publishedOn": "2022-07-09T09:45:32.000Z",
          "wordCount": 25970,
          "title": "X won't start with nvidia driver",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuxoez/aur_pointing_sources_to_archiveorg_yesno/",
          "author": null,
          "description": "You maintain a PKGBUILD in AUR and after a while you notice that upstream source/website is gone. Choose the correct answer (multiple choices possible).\n A) you give it a couple more weeks (optionally pinging the author via social networks/e-mail etc), if upstream website is not restored you disown PKGBUILD and/or file request for deletion. Using software without a maintainer is dangerous and should be avoided by all means!\n B1) despite lacking any advanced coding skills (or having no interest in maintaining the app codebase) you get the app source from archive.org/google cache and upload it to github/gitlab, then update PKGBUILD. You are ready to step down if someone shows up showing a real interest in the application.\n B2) you upload scavenged sources to your personal website (could be Nextcloud) and update PKGBUILD\n C) you update source array to point to archive.org - simple solutions are the best! If the app is useful you keep a copy for yourself (just in case).\n    submitted by    /u/Revolutionary_Gur583  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuxoez/aur_pointing_sources_to_archiveorg_yesno/",
          "publishedOn": "2022-07-09T09:04:52.000Z",
          "wordCount": 26560,
          "title": "AUR - pointing sources to archive.org (yes/no)",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuww6d/why_does_it_is_recommended_to_wipe_the_partition/",
          "author": null,
          "description": "I didn't wipe my partition when I encrypted it and installed arch linux on it. so, will there be any problem? do I need to re-encrypt or something?\n    submitted by    /u/windows_sucks_  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuww6d/why_does_it_is_recommended_to_wipe_the_partition/",
          "publishedOn": "2022-07-09T08:07:14.000Z",
          "wordCount": 25959,
          "title": "why does it is recommended to wipe the partition while encrypting using LUKS?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuws5h/alacritty_freezes_when_opening_vim_or_nvim/",
          "author": null,
          "description": "This is my first time trying someting else than Konsole. Alacritty pops up way snappier and is more lightweight. Why I can't open vim nor neovim with it? It just hangs and responds to nothing anymore.\n I tried to open alacritty from other terminal to see what messages it prints prior to hang, but it prints nothing.\n Is this a common problem?\n    submitted by    /u/Lord_Schnitzel  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuws5h/alacritty_freezes_when_opening_vim_or_nvim/",
          "publishedOn": "2022-07-09T07:59:24.000Z",
          "wordCount": 25544,
          "title": "Alacritty freezes when opening vim or nvim",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuvls3/apps_try_to_create_a_new_keyring_entry_after_each/",
          "author": null,
          "description": "Hi all! I am using an small arch install (i3wm + ly dm) with gnome-keying as my keyring app. It used to work fine (I had small password I would enter every time), however today I installed seahorse and tried to change the password to be empty (to stop inputting it every time, I do not worry about security of apps that require it too much), something went wrong. \n Now, after every reboot, apps that require keyring do not see the existing \"Default keyring\" which I can see from seahorse and instead prompt to create another \"Default keyring\" with no regards to the previous one. If you close the app and reopen it during a single session however it seems to be able to use the keyring it has just created no problem. \n I checked, I do have both gnome-keyring and libsecret up do date, I also tried creating new keyrings with random passwords, empty password, matching my login password. I have also edited PAM config to attempt automatic unlock. Nothing has seem to change and it is really frustrating since everything worked just fine and I am not sure what exactly I did to break it today.\n    submitted by    /u/TheDenast  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuvls3/apps_try_to_create_a_new_keyring_entry_after_each/",
          "publishedOn": "2022-07-09T06:36:41.000Z",
          "wordCount": 25959,
          "title": "Apps try to create a new keyring entry after each reboot",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuqe7s/cant_get_gnomeextensions_to_work/",
          "author": null,
          "description": "I'm trying to install a gnome extension, but it just doesn't let me, no matter which extension I try. I also don't get any extensions on the main page, unless I select compatible with all versions. I have chrome-gnome-shell, and the firefox extension installed. Has anyone encountered this issue? It's a fresh install. Thanks :)\n    submitted by    /u/LiveTart335  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuqe7s/cant_get_gnomeextensions_to_work/",
          "publishedOn": "2022-07-09T01:35:04.000Z",
          "wordCount": 25442,
          "title": "Can't get gnome-extensions to work",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuq6w4/efistub_entry_prevents_all_boot_entries_from/",
          "author": null,
          "description": "I've been trying to add an EFISTUB boot entry using efibootmgr, but every time I add it, all boot entries boot to a black screen. Removing the new entry from the boot order through the firmware allows the others to boot normally again.\n Command used:  sudo efibootmgr --disk /dev/sda --part 1 --create --label \"Arch EFISTUB\" --loader /vmlinuz-linux --unicode 'initrd=\\initramfs-linux.img cryptdevice=UUID=XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX:root root=/dev/mapper/root rootflags=rw,subvol=@ loglevel=3 quiet' --verbose \n The same command without the --unicode option will boot to a kernel panic (expected) and allows the other entries to boot normally. The kernel parameters may not be correct, but I don't think that should cause other entries to be unbootable. The machine is Thinkpad T420 with fully updated firmware.\n    submitted by    /u/ninjabobby06  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuq6w4/efistub_entry_prevents_all_boot_entries_from/",
          "publishedOn": "2022-07-09T01:24:10.000Z",
          "wordCount": 25569,
          "title": "EFISTUB entry prevents all boot entries from booting",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vupy2d/system_with_btrfs_and_storage_with_ext4/",
          "author": null,
          "description": "Hi, this is my first post here and I wanna ask if this a good idea make an arch installation in a 240GB SSD with BTRFS, because I'm interested in the snapshot and COW features of Btrfs. In another hand I have a 1Tb HDD, which I wanna use for storage large files (photos, videos and various stuff). This idea really make sense and which are your suggestions?\n Ps: Sorry for my English, this isn't my first language\n Ps 2: I'm a noob in Linux\n    submitted by    /u/agucolon9  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vupy2d/system_with_btrfs_and_storage_with_ext4/",
          "publishedOn": "2022-07-09T01:11:03.000Z",
          "wordCount": 25521,
          "title": "System with Btrfs and storage with ext4",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vupio2/nvme_storage_detected_as_sata/",
          "author": null,
          "description": "I've installed arch and I've noticed that the newest kernel (5.18.9-arch1-1) detected my SSD disk as SATA device and labeled it as /dev/sdb. This is not exactly true as it's actually an NVMe device. Previously I've installed other distributions like 1-2 years ago and the same device in the same machine was detected as NVMe (labeled as /dev/nvme0n1). Now even nvme list shows nothing.\n Did I missed something or libata really started to pick up some NVMe controllers (because my other machine running arch still relies on nvme kernel module)? Will it affect the performance?\n Yes, I'm running it in EFI mode and CSM disabled.\n    submitted by    /u/Raxp  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vupio2/nvme_storage_detected_as_sata/",
          "publishedOn": "2022-07-09T00:49:16.000Z",
          "wordCount": 25557,
          "title": "NVMe storage detected as SATA?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vup9d5/what_aur_package_do_yall_recommend_for_java_15_it/",
          "author": null,
          "description": "I can download it from oracle (I have an account so that I can download java 6). I would rather get it from the AUR, but the packages only have one or two votes. I was hoping one of ya'll have a recommendation otherwise I'll just download it directly from oracle.\n    submitted by    /u/slohobo  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vup9d5/what_aur_package_do_yall_recommend_for_java_15_it/",
          "publishedOn": "2022-07-09T00:35:50.000Z",
          "wordCount": 25501,
          "title": "What AUR package do ya'll recommend for java 15? It HAS to be java 15.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuos49/i_wiped_varlib/",
          "author": null,
          "description": "Fun fact, you can't remove :\n /var/lib/pacman/cache\n Without having problems with pacman. I tried to repair it from a live usb but I can't find a way to do it. \n I just bought a new sdd of 1T since nix (in arch) and games (in windows) takes a lot of space. When the new sdd arrive I was planning to use mi old ssd for Windows and the new one exclusive for linux, so I was in need to do a fresh install anyway.\n So, Some recommendations to add to my configs/system? I had my process of fresh installs quite pulished over the years, but maybe (most probably thing) some of you would have nice recommendations that I have been missing.\n About my system:\n I have the following partitions: - Uefi of 1G - Windows rest of 1T disk - / 40G - /var 40G (docker got most my space here, that was what i was tryin…",
          "link": "https://www.reddit.com/r/archlinux/comments/vuos49/i_wiped_varlib/",
          "publishedOn": "2022-07-09T00:11:33.000Z",
          "wordCount": 27069,
          "title": "I wiped /var/lib",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vulcmn/gnome_thinks_a_btrfs_subvolume_mounted_at/",
          "author": null,
          "description": "I downloaded the Heroic Games Launcher yesterday and since it wanted to download games to /home/<me>/Games I figured I'd creates a btrfs subvolume for that so that any games aren't included in my snapshots. I set it up fine and added it to my fstab, but now Gnome keeps telling me it's removeable.\n I did just copy one of the other subvolume's sections in the fstab and change the subvol and mountpoint, but any advice would be appreciated. Thanks!\n # <file system> <dir> <type> <options> <dump> <pass> # /dev/sdc1 LABEL=root UUID=a631923b-8833-48df-b321-d35ef1ff87c3 / btrfs rw,relatime,compress=zstd:3,ssd,space_cache=v2,subvolid=256,subvol=/@root 0 1 # /dev/nvme0n1p1 UUID=634D-F148 /boot vfat rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=ascii,shortname=mixed,utf8,errors=remount-ro 0 2 # /dev/sdc1 LABEL=root UUID=a631923b-8833-48df-b321-d35ef1ff87c3 /home btrfs rw,relatime,compress=zstd:3,ssd,space_cache=v2,subvolid=257,subvol=/@home 0 2 # /dev/sdc1 LABEL=root UUID=a631923b-8833-48df-b321-d35ef1ff87c3 /var/log btrfs rw,relatime,compress=zstd:3,ssd,space_cache=v2,subvolid=258,subvol=/@var_log 0 0 # /dev/sdc1 LABEL=root UUID=a631923b-8833-48df-b321-d35ef1ff87c3 /home/<me>/Games btrfs rw,relatime,compress=zstd:3,ssd,space_cache=v2,subvol=/@games 0 0 # /dev/sdc1 LABEL=root UUID=a631923b-8833-48df-b321-d35ef1ff87c3 /.swapfile btrfs rw,relatime,compress=zstd:3,ssd,space_cache=v2,subvolid=259,subvol=/@swapfile 0 0 /.swapfile/swapfile none swap defaults 0 0 \n    submitted by    /u/NormGreen  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vulcmn/gnome_thinks_a_btrfs_subvolume_mounted_at/",
          "publishedOn": "2022-07-08T21:29:43.000Z",
          "wordCount": 25628,
          "title": "Gnome thinks a btrfs subvolume mounted at /home/<me>/Games is removeable",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vukyrl/no_internet_after_installation/",
          "author": null,
          "description": "After re-booting, now finding myself in GRUB, I have no internet (wireless, specifically). I am a noob. Any ideas?\n    submitted by    /u/VDI04  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vukyrl/no_internet_after_installation/",
          "publishedOn": "2022-07-08T21:11:43.000Z",
          "wordCount": 25655,
          "title": "No Internet after installation",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vujlk5/grub_cant_find_efi_directory/",
          "author": null,
          "description": "I mounted my EFI drive to /boot/efi with no problem, but now grub says it can't find it . \n Grepping mount for /boot/EFI does give me a result , so I'm not sure why it's not able to find it.\n    submitted by    /u/Aelrift  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vujlk5/grub_cant_find_efi_directory/",
          "publishedOn": "2022-07-08T20:08:50.000Z",
          "wordCount": 25898,
          "title": "Grub can't find EFI directory",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vujbek/pipewire_changing_sample_rate_automatically/",
          "author": null,
          "description": "Hi,I try to configure pipewire to automatically change the sample rate, but I have trouble understanding the wiki https://wiki.archlinux.org/title/PipeWire#Changing_the_allowed_sample_rate(s))\n Do I need to add the dots or remove them ? I have try with and without and it doesn't work.\n I would be really glad if someone could send me his working config file.\n Thanks you!\n ​\n EDIT : I have tried to copy the example conf file, and I have the same problem, as soon as I add a config file, I have no sound after restart\n    submitted by    /u/aantheoo  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vujbek/pipewire_changing_sample_rate_automatically/",
          "publishedOn": "2022-07-08T19:56:36.000Z",
          "wordCount": 25668,
          "title": "Pipewire - Changing sample rate automatically",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vugedb/laptop_247/",
          "author": null,
          "description": "How can I keep my laptop open 24/7 and automatically suspend/poweroff when it reaches a specific temperature or fan speed?\n Weird question I know\n    submitted by    /u/Lonely_Mechanic8161  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vugedb/laptop_247/",
          "publishedOn": "2022-07-08T17:44:11.000Z",
          "wordCount": 25698,
          "title": "Laptop 24/7",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vue0ev/nvidia_drivers_and_mkinitcpio/",
          "author": null,
          "description": "Hi, I'm using instructions on wiki to install nvidia drivers and I'm stuck on part after I edit mkinitcpio.conf\n As far as I understood, after editing the file I need to regenerate the initramfs running mkinitcpio command\n Should I use -p or -P as a option, and if I use the first one, which preset should I add after it and why ? I’m using standard kernel\n If I look at the next step (pacman hook), inside of it is a command with -P but I’m not sure\n Sorry if the question is stupid, I tried to find an answer but couldn't find anything\n    submitted by    /u/dabrrrr  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vue0ev/nvidia_drivers_and_mkinitcpio/",
          "publishedOn": "2022-07-08T15:58:14.000Z",
          "wordCount": 25865,
          "title": "nvidia drivers and mkinitcpio",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/vuc957/anyone_suddenly_seeing_gpg_openpgp_card_not/",
          "author": null,
          "description": "I just lost power, and rebooted to find my Yubikey OpenPGP 'smartcard' not working.\n At first I thought the device was damaged somehow in the 'forced' shutdown while plugged in (I won't say always, but typically I'd unplug it before sleeping/shutting down) - but it works fine still on another Arch system.\n One candidate difference is that this one has gnupg v2.2.36-1, built yesterday and which I installed today; so the agent was probably older before reboot.\n Has anyone else seen this recently?\n  $gpg --card-status gpg: OpenPGP card not available: Card error \n Another card ('4 Nano' I think) works fine on this machine with this gpg; the one that doesn't is a '5C NFC'.\n Edit: WebAuthn works fine, so that does also point towards gpg (/pcscd) specifically.\n    submitted by    /u/OJFord  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/vuc957/anyone_suddenly_seeing_gpg_openpgp_card_not/",
          "publishedOn": "2022-07-08T14:37:21.000Z",
          "wordCount": 25836,
          "title": "Anyone suddenly seeing 'gpg: OpenPGP card not available: Card error' with yubikey or similar, possibly gpg 2.2.36?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arch Linux: Releases",
      "feedUrl": "https://archlinux.org/feeds/releases/",
      "siteUrl": "https://archlinux.org/download/",
      "articles": []
    },
    {
      "title": "Arch Linux: Recent news updates",
      "feedUrl": "https://archlinux.org/feeds/news/",
      "siteUrl": "https://archlinux.org/news/",
      "articles": []
    },
    {
      "title": "BleepingComputer",
      "feedUrl": "https://www.bleepingcomputer.com/feed/",
      "siteUrl": "https://www.bleepingcomputer.com/",
      "articles": [
        {
          "id": "https://www.bleepingcomputer.com/news/security/pypi-mandates-2fa-for-critical-projects-developer-pushes-back/",
          "author": "Ax Sharma",
          "description": "On Friday, the Python Package Index (PyPI), repository of open source Python projects announced plans to rollout two factor authentication for maintainers of \"critical\" projects. Although many praised the move, the developer of a popular Python project decided to delete his code from PyPI in retaliation. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/pypi-mandates-2fa-for-critical-projects-developer-pushes-back/",
          "publishedOn": "2022-07-09T16:31:57.000Z",
          "wordCount": 3054,
          "title": "PyPI mandates 2FA for critical projects, developer pushes back",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/05/20/bg_pypi_smaller.png"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/mangatoon-data-breach-exposes-data-from-23-million-accounts/",
          "author": "Lawrence Abrams",
          "description": "Manga comic reading app Mangatoon has suffered a data breach that exposed the account information of 23 million users after a hacker stole it from an Elasticsearch database. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/mangatoon-data-breach-exposes-data-from-23-million-accounts/",
          "publishedOn": "2022-07-09T15:12:06.000Z",
          "wordCount": 2141,
          "title": "Mangatoon data breach exposes data from 23 million accounts",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/03/22/manga-comics-header.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outlook-email-searches-are-broken-again-in-windows-11/",
          "author": "Sergiu Gatlan",
          "description": "Microsoft is investigating an issue causing Outlook search not to display recent emails in desktop apps running on Windows 11 systems. [...]",
          "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outlook-email-searches-are-broken-again-in-windows-11/",
          "publishedOn": "2022-07-09T14:07:00.000Z",
          "wordCount": 2364,
          "title": "Microsoft Outlook email searches are broken again in Windows 11",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/05/11/Outlook_headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-july-8th-2022-one-down-many-to-go/",
          "author": "Lawrence Abrams",
          "description": "While we continue to see new ransomware operations launch, we also received some good news this week, with another ransomware shutting down. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-july-8th-2022-one-down-many-to-go/",
          "publishedOn": "2022-07-08T21:21:19.000Z",
          "wordCount": 2582,
          "title": "The Week in Ransomware - July 8th 2022 - One down, many to go",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2020/09/24/padlock.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/new-0mega-ransomware-targets-businesses-in-double-extortion-attacks/",
          "author": "Lawrence Abrams",
          "description": "A new ransomware operation named '0mega' targets organizations worldwide in double-extortion attacks and demands millions of dollars in ransoms. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/new-0mega-ransomware-targets-businesses-in-double-extortion-attacks/",
          "publishedOn": "2022-07-08T19:22:42.000Z",
          "wordCount": 2085,
          "title": "New 0mega ransomware targets businesses in double-extortion attacks",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/07/08/0mega-header.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/technology/ceo-charged-with-sale-of-counterfeit-cisco-devices-to-govt-health-orgs/",
          "author": "Sergiu Gatlan",
          "description": "Onur Aksoy, the CEO of a group of dozens of companies, was indicted for allegedly selling more than $1 billion worth of counterfeit Cisco network equipment to customers worldwide, including health, military, and government organizations. [...]",
          "link": "https://www.bleepingcomputer.com/news/technology/ceo-charged-with-sale-of-counterfeit-cisco-devices-to-govt-health-orgs/",
          "publishedOn": "2022-07-08T18:41:28.000Z",
          "wordCount": 2308,
          "title": "CEO charged with sale of counterfeit Cisco devices to govt, health orgs",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2020/08/31/Cisco.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-bug-crashing-office-apps-when-opening-cloud-documents/",
          "author": "Sergiu Gatlan",
          "description": "Microsoft has fixed a known issue that was causing Office applications like Word and Excel to crash when working with cloud documents. [...]",
          "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-bug-crashing-office-apps-when-opening-cloud-documents/",
          "publishedOn": "2022-07-08T16:22:14.000Z",
          "wordCount": 2254,
          "title": "Microsoft fixes bug crashing Office apps when opening cloud documents",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/10/20/Microsoft_365.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/technology/massive-rogers-outage-disrupts-mobile-service-payments-in-canada/",
          "author": "Lawrence Abrams",
          "description": "A massive Rogers outage is causing widespread disruption in Canada due to lack of mobile service, inability to process payment card transactions, and impacting 911 emergency services. [...]",
          "link": "https://www.bleepingcomputer.com/news/technology/massive-rogers-outage-disrupts-mobile-service-payments-in-canada/",
          "publishedOn": "2022-07-08T15:33:53.000Z",
          "wordCount": 2085,
          "title": "Massive Rogers outage disrupts mobile service, payments in Canada",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/07/08/rogers-sign.jpg"
        }
      ]
    },
    {
      "title": "gHacks Technology News",
      "feedUrl": "https://www.ghacks.net/feed/",
      "siteUrl": "https://www.ghacks.net",
      "articles": [
        {
          "id": "https://www.ghacks.net/?p=179631",
          "author": "Martin Brinkmann",
          "description": "When it comes to benchmarks, most computer users are probably interested in performance comparisons of hardware and software running on the same operating system. Is this or that graphics card better for […]\nThank you for being a Ghacks reader. The post Linux is performing better than Windows 11 according to this benchmark test appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/07/09/linux-is-performing-better-than-windows-11-according-to-this-benchmark-test/",
          "publishedOn": "2022-07-09T17:39:36.000Z",
          "wordCount": 2825,
          "title": "Linux is performing better than Windows 11 according to this benchmark test",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/04/Ubuntu_22.04-scaled.jpg"
        },
        {
          "id": "https://www.ghacks.net/?p=179627",
          "author": "Martin Brinkmann",
          "description": "Office macros are used by malicious actors to attack computer systems. The main use of macros is automation, to run a set of commands and actions without user interaction. The extensive capabilities […]\nThank you for being a Ghacks reader. The post Microsoft delays policy that blocks macros in Office documents from the Internet appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/07/09/microsoft-delays-policy-that-blocks-macros-in-office-documents-from-the-internet/",
          "publishedOn": "2022-07-09T05:23:44.000Z",
          "wordCount": 2874,
          "title": "Microsoft delays policy that blocks macros in Office documents from the Internet",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/07/office-macro-security.png"
        },
        {
          "id": "https://www.ghacks.net/?p=179624",
          "author": "Martin Brinkmann",
          "description": "A new update for the open source Android email client K-9 Mail introduces support for OAuth 2.0. The long-requested feature adds authentication support for Google's Gmail, Yahoo Mail, AOL Mail, and personal […]\nThank you for being a Ghacks reader. The post K-9 Mail (future Thunderbird for Android) adds OAuth 2.0 support appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/07/08/k-9-mail-future-thunderbird-for-android-adds-oauth-2-0-support/",
          "publishedOn": "2022-07-08T16:25:45.000Z",
          "wordCount": 2480,
          "title": "K-9 Mail (future Thunderbird for Android) adds OAuth 2.0 support",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/06/k-9-mail-android.png"
        }
      ]
    },
    {
      "title": "Hongkiat",
      "feedUrl": "http://feeds2.feedburner.com/24thfloor",
      "siteUrl": "https://www.hongkiat.com/blog",
      "articles": []
    },
    {
      "title": "How-To Geek",
      "feedUrl": "https://www.howtogeek.com/feed/",
      "siteUrl": "https://www.howtogeek.com",
      "articles": [
        {
          "id": "https://www.howtogeek.com/?p=769182",
          "author": "Benj Edwards",
          "description": "If the hardware devices in your Windows 11 PC—such as USB controllers, video cards, printers, or other peripherals—need new or updated drivers, it’s usually easy to install them. We’ll show you how.",
          "link": "https://www.howtogeek.com/769182/how-to-update-drivers-on-windows-11/",
          "publishedOn": "2022-07-09T21:00:00.000Z",
          "wordCount": 16476,
          "title": "How to Update Drivers on Windows 11",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/11/win11_devices_printers_hero.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=757192",
          "author": "Jordan Gloor",
          "description": "There’s no shortage of Linux websites hyping the trendiest distributions (distros) and dishing on the latest developer drama. To help you cut through the noise, we’ve curated a few sites worth your time that offer relevant news, useful information, or both.",
          "link": "https://www.howtogeek.com/757192/websites-every-linux-user-should-bookmark/",
          "publishedOn": "2022-07-09T20:00:00.000Z",
          "wordCount": 16451,
          "title": "5 Websites Every Linux User Should Bookmark",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/linux_tux_hero_2.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122671/samsung-and-philips-hue-will-integrate-music-with-your-smart-lights/",
          "author": "Andrew Heinzman",
          "description": "The Samsung SmartThings app will soon offer “enhanced music experiences” for Philips Hue lighting products, according to a statement provided to The Verge. It’s unclear how this integration will work, but it could simplify the existing Philips Hue music-syncing process, which requires a computer and a $250 Sync Box.",
          "link": "https://www.reviewgeek.com/122671/samsung-and-philips-hue-will-integrate-music-with-your-smart-lights/",
          "publishedOn": "2022-07-09T19:00:58.000Z",
          "wordCount": 8279,
          "title": "Samsung and Philips Hue Will Integrate Music with Your Smart Lights",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2021/08/cac4fc2a.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=813467",
          "author": "Mahesh Makvana",
          "description": "To help you share your schedules with other people, your iPhone allows you to share your entire iCloud calendars with anyone in read-only mode and with specific people in editing mode. We’ll show you how to make your calendars available to others.",
          "link": "https://www.howtogeek.com/813467/how-to-share-calendars-on-iphone/",
          "publishedOn": "2022-07-09T19:00:17.000Z",
          "wordCount": 15912,
          "title": "How to Share Calendars on iPhone",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/iphone_calendar_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=808226",
          "author": "Mohammed Abubakar",
          "description": "If you’ve recently stepped into the Linux world, you may have heard the term GNOME thrown around a lot. But what exactly is it? In this article, we’ll take a look at this popular desktop environment and what it offers.",
          "link": "https://www.howtogeek.com/808226/what-is-gnome-in-linux/",
          "publishedOn": "2022-07-09T18:00:57.000Z",
          "wordCount": 16331,
          "title": "What Is GNOME in Linux?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/What-is-GNOME-in-Linux.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122645/check-out-this-amazing-bicycle-with-its-rear-wheel-split-in-half/",
          "author": "Cory Gunther",
          "description": "As we all know, most bicycles have two wheels that are a complete circle. That’s just how wheels typically work. However, an engineer named Sergii Gordieiev recently released a video showing a bike with one regular wheel and two half wheels, and it’s absolutely amazing to watch in action. This bike shouldn’t work, but it does.",
          "link": "https://www.reviewgeek.com/122645/check-out-this-amazing-bicycle-with-its-rear-wheel-split-in-half/",
          "publishedOn": "2022-07-09T17:13:36.000Z",
          "wordCount": 8347,
          "title": "Check Out This Amazing Bicycle With Its Rear Wheel Split in Half",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/b06b61ec.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=813013",
          "author": "Tim Brookes",
          "description": "Once you’ve turned on Desktop & Documents sync under iCloud settings on a Mac, your files will be available on other macOS, iOS, and iPadOS devices provided you have the cloud storage available. But what if you don’t want every folder to sync?",
          "link": "https://www.howtogeek.com/813013/can-you-exclude-folders-from-icloud-sync-on-mac/",
          "publishedOn": "2022-07-09T17:00:00.000Z",
          "wordCount": 15862,
          "title": "Can You Exclude Folders From iCloud Sync on Mac?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/icloud_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=815178",
          "author": "Joe Fedewa",
          "description": "Playlists are a huge part of the Spotify experience. There are many premade playlists to choose from, but it’s more fun to make your own. What if you delete one of your playlists by mistake? It’s not gone forever.",
          "link": "https://www.howtogeek.com/815178/how-to-recover-deleted-spotify-playlists/",
          "publishedOn": "2022-07-09T16:00:00.000Z",
          "wordCount": 15616,
          "title": "How to Recover Deleted Spotify Playlists",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/08/spotify-logo.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122675/new-apple-lockdown-mode-blocks-mercenary-spyware/",
          "author": "Andrew Heinzman",
          "description": "As part of its continued effort to fight government-funded mercenary spyware, Apple will offer a new “Lockdown Mode” in iOS 16 and macOS Ventura. The average person will never use this setting, but it should offer enhanced protection for common targets of global governments, such as journalists and dissidents.",
          "link": "https://www.reviewgeek.com/122675/new-apple-lockdown-mode-blocks-mercenary-spyware/",
          "publishedOn": "2022-07-09T15:23:28.000Z",
          "wordCount": 8274,
          "title": "New Apple \"Lockdown\" Mode Blocks Mercenary Spyware",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/75c168b6.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=809398",
          "author": "Sandy Writtenhouse",
          "description": "When you spend time creating, formatting, and adding data to a table, you don’t want accidental changes. You can convert a table to an image in Microsoft Word to prevent changes or share it instead of sending an entire document.",
          "link": "https://www.howtogeek.com/809398/convert-table-to-image-in-word/",
          "publishedOn": "2022-07-09T15:00:42.000Z",
          "wordCount": 15839,
          "title": "How to Convert a Table to an Image in Microsoft Word",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/microsoft_word_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=809386",
          "author": "Haroun Adamu",
          "description": "Don’t risk it: You need a surge protector to save your electronics from power surges. The right surge protector can take a beating and will protect your gadgets even after it fails. We’ll help you pick the best ones for your situation.",
          "link": "https://www.howtogeek.com/809386/best-surge-protector/",
          "publishedOn": "2022-07-09T14:00:35.000Z",
          "wordCount": 18558,
          "title": "The Best Surge Protectors of 2022",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/07/tripp-lite-1.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/121722/how-safe-is-two-factor-authentication-exactly/",
          "author": "Dave McQuilling",
          "description": "Two-factor authentication (2FA) is becoming mandatory on many websites, and it’s easy to see why. On the face of it, requiring you to confirm your login via SMS or an app provides a solid second layer of security. But just how strong is it?",
          "link": "https://www.reviewgeek.com/121722/how-safe-is-two-factor-authentication-exactly/",
          "publishedOn": "2022-07-09T13:00:13.000Z",
          "wordCount": 9440,
          "title": "How Safe Is Two Factor Authentication Exactly?",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/ba14864d.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=808097",
          "author": "Tim Brookes",
          "description": "Apple Notes might just be the best free note-taking app you can use, provided you have an iPhone or a Mac (ideally both). The app is packed full of features that many note-taking apps charge money for, so if you’re not yet using it you might want to give it a shot.",
          "link": "https://www.howtogeek.com/808097/apple-notes-features-you-should-be-using/",
          "publishedOn": "2022-07-09T13:00:00.000Z",
          "wordCount": 17013,
          "title": "10 Apple Notes Features You Should Be Using",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/apple-notes-app-appstore.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=809034",
          "author": "Kris Wouk",
          "description": "Preamps appear in all kinds of audio setups, from headphones to home theaters. But what are they, and what can they do for you. These devices are fairly simple, but they’re used in some complex ways.",
          "link": "https://www.howtogeek.com/809034/what-is-a-preamp/",
          "publishedOn": "2022-07-09T12:00:30.000Z",
          "wordCount": 16206,
          "title": "What Is a Preamp?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/high-end-stereo-turntable-system.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=806798",
          "author": "John Bogna",
          "description": "Charging an electric car’s battery is a lot different than pumping gas. How long it takes to charge depends on a number of factors, including battery size and type, but it definitely takes longer than filling a gas car’s tank.",
          "link": "https://www.howtogeek.com/806798/how-long-does-it-take-to-charge-an-electric-car-2/",
          "publishedOn": "2022-07-09T11:00:00.000Z",
          "wordCount": 16455,
          "title": "How Long Does It Take to Charge an Electric Car?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/woman-charging-electric-car.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=769338",
          "author": "Mahesh Makvana",
          "description": "Thanks to the built-in Voice Memos app, you can record and share your audio recordings on your iPhone with ease. We’ll show you how to use the app to make your first-ever voice recording.",
          "link": "https://www.howtogeek.com/769338/how-to-record-audio-on-iphone/",
          "publishedOn": "2022-07-08T21:00:00.000Z",
          "wordCount": 16073,
          "title": "How to Record Audio on iPhone",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/iphone_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=764859",
          "author": "Sydney Butler",
          "description": "When you last downloaded a torrent file, you may have been offered a magnet link as an alternative. Magnet links are very different from torrent files and offer some advantages over them that all torrent users should be aware of.",
          "link": "https://www.howtogeek.com/764859/what-is-a-magnet-link-and-how-do-you-use-one/",
          "publishedOn": "2022-07-08T20:00:00.000Z",
          "wordCount": 16156,
          "title": "What Is a Magnet Link, and How Do You Use One?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/11/shutterstock_1474237442.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=810325",
          "author": "Mahesh Makvana",
          "description": "Whether you want to make structural changes or modify the content in your Microsoft Excel workbooks, you’ll have to unprotect those items first. We’ll show you how to do just that.",
          "link": "https://www.howtogeek.com/810325/how-to-unprotect-a-microsoft-excel-workbook/",
          "publishedOn": "2022-07-08T19:00:05.000Z",
          "wordCount": 15730,
          "title": "How to Unprotect a Microsoft Excel Workbook",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/microsoft_excel_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122621/rivian-r1s-everything-you-need-to-know-about-the-electric-suv/",
          "author": "Cory Gunther",
          "description": "Rivian is a new electric vehicle company with an adventurous side. Following the successful launch of its first vehicle, the well-received R1T truck, the automaker has finally released its beautiful Rivian R1S all-electric SUV.",
          "link": "https://www.reviewgeek.com/122621/rivian-r1s-everything-you-need-to-know-about-the-electric-suv/",
          "publishedOn": "2022-07-08T18:51:25.000Z",
          "wordCount": 9928,
          "title": "Rivian R1S: Everything You Need to Know About the Electric SUV",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/06/61fbfe12.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=817070",
          "author": "Corbin Davenport",
          "description": "Sony used to sell movies and TV shows through the PlayStation store, but that ended in August 2021. Existing purchases were still available, though some of them are now starting to disappear — another sign digital collections don’t last forever.",
          "link": "https://www.howtogeek.com/817070/your-digital-movies-will-not-last-forever-and-sony-just-proved-it/",
          "publishedOn": "2022-07-08T18:48:07.000Z",
          "wordCount": 15690,
          "title": "Your Digital Movies Will Not Last Forever, and Sony Just Proved It",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/07/A-Shaun-the-Sheep-Movie-Farmageddon.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122633/playstation-will-remove-customers-purchased-movies-in-select-regions/",
          "author": "Andrew Heinzman",
          "description": "Due to an expiring license agreement, the PlayStation Store will remove over 300 shows and movies from customers’ libraries in Germany and Australia. Customers who paid for titles like Django, King of the Hill, and John Wick through the PlayStation Store will completely lose access to such titles on August 31st.",
          "link": "https://www.reviewgeek.com/122633/playstation-will-remove-customers-purchased-movies-in-select-regions/",
          "publishedOn": "2022-07-08T18:14:22.000Z",
          "wordCount": 8289,
          "title": "PlayStation Will Remove Customers' Purchased Movies in Select Regions",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/ba6beb7a.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=808423",
          "author": "Sydney Butler",
          "description": "The Mail app that comes with your iPhone or iPad is great for integrating your email accounts into one app—that is, until it stops talking to your mail server. Here are some potential fixes for when Mail gives you a “Cannot Verify Server Identity” message.",
          "link": "https://www.howtogeek.com/808423/cannot-verify-server-identity/",
          "publishedOn": "2022-07-08T18:00:38.000Z",
          "wordCount": 16225,
          "title": "Fix a “Cannot Verify Server Identity” Error on iPhone or iPad",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/02/iphone-mail-app-icon-unread.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122625/nvidia-could-delay-rtx-40-series-gpus/",
          "author": "Andrew Heinzman",
          "description": "Graphics cards are finally affordable again, but we may need to wait a bit longer for the next generation of GPUs. Multiple sources claim that NVIDIA has delayed the launch of its RTX 40-series GPUs, citing supply chain issues and current market conditions.",
          "link": "https://www.reviewgeek.com/122625/nvidia-could-delay-rtx-40-series-gpus/",
          "publishedOn": "2022-07-08T17:09:07.000Z",
          "wordCount": 8256,
          "title": "NVIDIA Could Delay RTX 40-Series GPUs",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/88399fdc.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=814712",
          "author": "Sandy Writtenhouse",
          "description": "An out-of-office (OOO) reply for your emails is a convenient way to let others know when you’re away. We’ll show you how to set up an out-of-office reply in Microsoft Outlook on Windows and Mac.",
          "link": "https://www.howtogeek.com/814712/out-of-office-message-outlook/",
          "publishedOn": "2022-07-08T17:00:26.000Z",
          "wordCount": 15924,
          "title": "How to Set Up an Out of Office Message in Outlook",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/06/microsoft-outlook-logo-675.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122614/microsoft-finally-tackles-the-windows-app-stores-biggest-problem/",
          "author": "Andrew Heinzman",
          "description": "The Microsoft Store was supposed to give Windows 11 users a safe and easy means to find apps. But it’s only accomplished the opposite—the Microsoft Store is chock-full of scams, mainly paid versions of open-source apps like VLC or Firefox. Finally, Microsoft says it’ll take this problem seriously.",
          "link": "https://www.reviewgeek.com/122614/microsoft-finally-tackles-the-windows-app-stores-biggest-problem/",
          "publishedOn": "2022-07-08T16:02:24.000Z",
          "wordCount": 8371,
          "title": "Microsoft Finally Tackles the Windows App Store's Biggest Problem",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/1e412544.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=815115",
          "author": "Joe Fedewa",
          "description": "When you’re not watching TV, it becomes a boring black rectangle in your living room. A screensaver can make it more interesting. Roku devices have some great screensaver options to choose from. We’ll show you how to change it.",
          "link": "https://www.howtogeek.com/815115/how-to-change-the-screensaver-on-roku/",
          "publishedOn": "2022-07-08T16:00:38.000Z",
          "wordCount": 15672,
          "title": "How to Change the Screensaver on Roku",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/Roku-screensaver.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=815542",
          "author": "Zach Laidlaw",
          "description": "As we wait on the cusp of what’s bound to be an eventful Prime Day sales extravaganza, our friends at Roborock have unleashed an early torrent of discounts for your buying pleasure. Valid through July 16, you can save up to 44% on some of the hottest robot vacuums on the planet, but each sale happens during specific days, so be watchful as you seek out your savings.",
          "link": "https://www.howtogeek.com/815542/save-up-to-44-on-roborocks-robot-vacuums-through-prime-day/",
          "publishedOn": "2022-07-08T15:55:23.000Z",
          "wordCount": 15983,
          "title": "Save Up To 44% on Roborock’s Robot Vacuums Through Prime Day",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/06/Roborock-Prime-Day-2022-Hero.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=816992",
          "author": "Corbin Davenport",
          "description": "The iOS 16 update for iPhones is rapidly approaching, as we’re now on the third public beta. It turns out the latest beta includes a hidden surprise: a wallpaper used for promoting the original iPhone in 2007.",
          "link": "https://www.howtogeek.com/816992/apple-brought-back-the-original-iphone-wallpaper-for-ios-16/",
          "publishedOn": "2022-07-08T15:48:37.000Z",
          "wordCount": 15557,
          "title": "Apple Brought Back the Original iPhone Wallpaper for iOS 16",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/07/Original-iPhone.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122617/google-pixel-at-a-glance-feature-will-soon-show-rideshare-details/",
          "author": "Cory Gunther",
          "description": "One of the best Pixel features many users love are the At a Glance widgets. Seeing small bits of useful information on the home or lock screen is extremely helpful. Now, it looks like Google is readying another, which is rideshare details in At a Glance.",
          "link": "https://www.reviewgeek.com/122617/google-pixel-at-a-glance-feature-will-soon-show-rideshare-details/",
          "publishedOn": "2022-07-08T15:44:42.000Z",
          "wordCount": 8276,
          "title": "Google Pixel At a Glance Feature Will Soon Show Rideshare Details",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2021/11/ec3f690e.png"
        },
        {
          "id": "https://www.reviewgeek.com/122610/teslas-cute-little-key-fob-no-longer-comes-with-select-vehicles/",
          "author": "Cory Gunther",
          "description": "One of the coolest accessories Tesla offers for its vehicles is going away on select models. We’re talking about the cute little car-shaped key fob the internet loves. According to reports, it’s no longer a standard accessory for all vehicles.",
          "link": "https://www.reviewgeek.com/122610/teslas-cute-little-key-fob-no-longer-comes-with-select-vehicles/",
          "publishedOn": "2022-07-08T15:03:26.000Z",
          "wordCount": 8261,
          "title": "Tesla's Cute Little Key Fob No Longer Comes With Select Vehicles",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/779cebea.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=809793",
          "author": "Sandy Writtenhouse",
          "description": "When you take advantage of Word’s built-in bibliography, you may still need to edit it, whether for a requirement or personal preference. If you want to save that bibliography format and reuse it in future documents, create a template.",
          "link": "https://www.howtogeek.com/809793/how-to-create-your-own-bibliography-template-in-microsoft-word/",
          "publishedOn": "2022-07-08T15:00:32.000Z",
          "wordCount": 16015,
          "title": "How to Create Your Own Bibliography Template in Microsoft Word",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/microsoft_word_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=816919",
          "author": "Corbin Davenport",
          "description": "Microsoft announced earlier this year that it would block VBA macros in downloaded Office documents, due to how popular they are for distributing malware. However, those plans are now on hold.",
          "link": "https://www.howtogeek.com/816919/microsoft-office-delays-blocking-dangerous-downloaded-macros/",
          "publishedOn": "2022-07-08T14:44:51.000Z",
          "wordCount": 15582,
          "title": "Microsoft Office Delays Blocking Dangerous Downloaded Macros",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2015/07/microsoft-word-logo-on-a-blue-background.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/122606/this-new-checkmate-ransomware-targets-nas-devices/",
          "author": "Andrew Heinzman",
          "description": "In its latest security advisory, QNAP warns that hackers are targeting NAS devices with a new Checkmate ransomware. Everyone who exposes their NAS device through SMB services (remote access) need to take extra security steps and create a backup system for their NAS.",
          "link": "https://www.reviewgeek.com/122606/this-new-checkmate-ransomware-targets-nas-devices/",
          "publishedOn": "2022-07-08T14:42:30.000Z",
          "wordCount": 8397,
          "title": "This New Checkmate Ransomware Targets NAS Devices",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/07/d642f8c3.png"
        }
      ]
    },
    {
      "title": "IlSoftware.it",
      "feedUrl": "https://www.ilsoftware.it/rss.asp",
      "siteUrl": "https://www.ilsoftware.it",
      "articles": []
    },
    {
      "title": "Make Tech Easier",
      "feedUrl": "https://feeds.maketecheasier.com/MakeTechEasier",
      "siteUrl": "https://www.maketecheasier.com",
      "articles": [
        {
          "id": "https://www.maketecheasier.com/?p=245263",
          "author": "Crystal Crowder",
          "description": "Finding the downloaded files on your Android device is usually an easy task. The steps to find them vary slightly, depending on what kind of device you have, but for some reason, the downloaded files tend to “disappear” sometimes.\n    \nThe files haven’t disappeared, though. You just have to dig in to your Android device’s settings to find them. In some cases, you may need to install a file manager to help you keep those downloaded files under control. Let’s take a look at some options.\n   \n\nContent\n\nLook in the Downloads Folder\nCheck Your App Settings\nUse a Third-Party File Explorer\nDownload Another File\nHow to Find the Downloads Folder From Your Windows Computer\nFind Your Downloads in Chrome\nFind Your Downloads in Edge\nFind Your Firefox Downloads\nFind With Integrated Search\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:10 Best Sticker Packs for WhatsApp\n    \nLook in the... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/13978642/find-downloaded-files-android",
          "publishedOn": "2022-07-09T19:25:00.000Z",
          "wordCount": 2745,
          "title": "How to Find Downloaded Files on Any Android Device",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/how-to-find-downloaded-files-on-android-featured-devices.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=product-review&p=499058",
          "author": "Damien",
          "description": "Sennheiser is one of the big players in the true wireless earbuds market. Along with Sony, Apple, and Bose, they consistently come out with newer devices that are better than their previous iteration. For Sennheiser, their latest flagship earbuds – the third-generation MOMENTUM True Wireless – now come with better noise cancellation, longer battery life and a lower price point.\n    \nInside the Box\n    \nThe third generation of MOMENTUM True Wireless come in a textile-wrapped case. It is stylish enough to bring it out and small enough to put into your bag or pocket. It has a nice touch and feels solid in your hand. The USB-C charging port is at the front of the case, requiring a bit of force to pop the magnetic case open.\n   \n \n   \nTaking the earbuds out of the case, I also noticed they are smaller than their predecessors. In fact, they are 16 percent smaller. With a new oval touch panel, they do look and feels a bit bulky. \n   \n Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15421915/sennheiser-momentum-true-wireless-3",
          "publishedOn": "2022-07-09T00:25:00.000Z",
          "wordCount": 1802,
          "title": "Sennheiser MOMENTUM True Wireless 3 Review",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/07/momentum-true-wireless-featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?p=487482",
          "author": "Crystal Crowder",
          "description": "Google Pay makes paying for purchases as easy as holding your phone to a card scanner. However, when you’re used to not carrying around a physical wallet or you want to make online purchases quick and easy, the last thing you want to deal with is Google Pay not working. Whether it’s a problem with card upload or a weak signal, occasionally, Google Pay has issues. Luckily, you can fix most of them through a set of basic troubleshooting steps.\n   \n\nContent\n\n1. Check for App Updates\n2. Ensure Cards Are Updated\n3. Ensure Your Phone Number Is Correct\n4. Check Your Internet Connection\n5. Contact Your Bank/Card Issuer\n6. Clear the Cache\n7. Ensure Your Phone Is NFC Compatible\n8. Turn On NFC\n9. Verify Your Identity\n10. Troubleshoot a Grayed-Out Card\n11. Reinstall Google Pay\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15421802/fix-google-pay-not-working",
          "publishedOn": "2022-07-08T21:25:00.000Z",
          "wordCount": 3231,
          "title": "Google Pay Not Working? 11 Fixes You Can Try",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/google-pay-not-working-fixes-to-try-featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=deal&p=502867",
          "author": "Laura Tucker",
          "description": "Ultenic offers many great products, from multiple types of vacuums to a smart air fryer. They have great deals on all their products right now. We’re highlighting three of the best: two robot vacuums and the smart air fryer. Check out these deals that will save you up to $130.\n    \nUltenic T10 Robot Vacuum and Mop Combo\n   \n \n   \nThe T10 will continue to empty itself into the self-empty base for 60 days before you have to change out the dustbag. At the same time it is picking up 60 days worth of dirt, it will also be grabbing 99.7% of the fine dust particules with a max suction power of 3000Pa. The 2-in-1 dustbin has a water tank that allows you to simultaneously vacuum and mop. Advanced laser navigation performs 360º omnidirectional scanning to map your home for thorough coverage. There is also an option to control theT10 via Alexa or Google Assistant.\n    \nGet $130 off the Ultenic T10 with the code ULTPD111 to pay just $369.\n    \nRead more",
          "link": "https://feeds.maketecheasier.com/link/12555/15421671/ultenic-amazon-store",
          "publishedOn": "2022-07-08T19:25:00.000Z",
          "wordCount": 1132,
          "title": "Save Up to $130 on Deals at the Ultenic Amazon Store",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/07/ultenic-products-featured.jpg"
        },
        {
          "id": "https://www.maketecheasier.com/?p=312809",
          "author": "Ojash Yadav",
          "description": "It’s getting increasingly complicated to use Android devices, thanks to newer models that come with a bunch of advanced features. This is especially frustrating for senior citizens. However, you can help them out by making their phones easier to use. All it requires is a few Android accessibility tweaks like the ones we discuss below.\n   \n\nContent\n\n1. Increase Font and Icon Size\n2. Increase Screen Contrast\n3. Use a Simpler Launcher\n4. Change the Keyboard Size\n5. Enable Android Accessibility Features\n6. Set Up Google Assistant for Voice Control\n7. Remove Apps That Get in the Way\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}       \n1. Increase Font and Icon Size\n    \nOne of the most common complaints you’re likely to hear from elderly family members about using a smartphone is difficulty in reading. Thankfully, to make text more readable for them, you can increase both the text and display size on their Android device.\n    \nHead over to the Display settings menu within the Settings app.\n   \n Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/12780332/useful-android-accessibility-options",
          "publishedOn": "2022-07-08T15:25:00.000Z",
          "wordCount": 2917,
          "title": "7 Android Accessibility Tweaks to Set Up a Phone for Seniors",
          "enclosure": {
            "url": "https://www.maketecheasier.com/assets/uploads/2022/06/Move-the-magnifier-around.mp4",
            "length": "144258",
            "type": "video/mp4"
          },
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/setting-up-grandparents-phone-for-better-access.jpg"
        }
      ]
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/feed/",
      "siteUrl": "https://blog.mozilla.org",
      "articles": [
        {
          "id": "https://blog.mozilla.org/?p=69390",
          "author": "Sarah Vasquez",
          "description": "With the recent overturn of Roe v. Wade, many of us can’t help but wonder: How did we get here? It didn’t happen overnight — no, it was more of a slow burn. Just in time for the seventh season of Slate’s Slow Burn, host and executive editor Susan Matthews explores the path to Roe […]\nThe post The journey to Roe and after – a Pocket Collection unveils the stories behind Slate’s 7th season of Slow Burn appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/products/pocket/the-journey-to-roe-and-after-a-pocket-collection-unveils-the-stories-behind-slates-7th-season-of-slow-burn/",
          "publishedOn": "2022-07-08T20:19:04.000Z",
          "wordCount": 2405,
          "title": "The journey to Roe and after – a Pocket Collection unveils the stories behind Slate’s 7th season of Slow Burn",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/07/https-__s3.amazonaws.com_pocket-collectionapi-prod-images_6d7eaea7-8910-4d9e-bb57-c6a2c0d3c3ab-648x432.png"
        }
      ]
    },
    {
      "title": "Navigaweb.net",
      "feedUrl": "https://feeds.feedburner.com/navigaweb/",
      "siteUrl": "https://www.navigaweb.net/",
      "articles": [
        {
          "id": "https://www.navigaweb.net/2015/05/app-per-smartphone-tornare-in-forma.html",
          "author": null,
          "description": "In qualsiasi periodo dell'anno siamo sempre alla ricerca della forma migliore del proprio corpo, per cercare di sfigurare il meno possibile sia in estate sia in inverno.\r\n\r\n Per controllare l'efficacia, la quantità e la qualità dell'esercizio fisico, qualsiasi esso sia, (corsa, bicicletta, palestra, corpo libero o anche una semplice camminata), possiamo farci aiutare da alcune applicazioni per gli...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2015/05/app-per-smartphone-tornare-in-forma.html",
          "publishedOn": "2022-07-09T15:29:00.000Z",
          "wordCount": 5319,
          "title": "Tornare in forma con bracciali fitness e app per monitorare le attività fisiche",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjRWpD9rTQiMh75TfGDj6Eay5iLlGQbzLInEMFUe-O1-LEm_vjwS2PfYta0Xd0E41ssCd8y64W5yvOyte1xggHPhzy0pffD_CtLLJ2hmvKh1QmQdHLXfGqQdpXKxiBV18-BCBGnJaHl18M7Hal7Esg2zojMwwF1OLGVAZsyTw_xIQJ6f880wi4akOxs/w1200-h630-p-k-no-nu/App-fitness-telefono.jpg"
        },
        {
          "id": "https://www.navigaweb.net/2022/07/come-salvare-i-biglietti-dei-treni-o.html",
          "author": null,
          "description": "La maggior parte delle persone stampa i biglietti dell'aereo o del treno per poter effettuare velocemente il check-in e salire sul mezzo di traporto prima degli altri. Molti non lo sanno ma tutte le compagnie di trasporto più famose a livello nazionale internazionale offrono la possibilità di salvare i biglietti del viaggio direttamente sul telefono, così da poter mostrare al controllore o al...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2022/07/come-salvare-i-biglietti-dei-treni-o.html",
          "publishedOn": "2022-07-08T15:44:00.001Z",
          "wordCount": 4985,
          "title": "Come salvare i biglietti dei treni o degli aerei sul telefono",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPFN2XOvXK39W3PIDIngZM8kgNJ1G5q1hJJQmaazStlgqTRHpHwBMwA07HVyswqPi37ZvpHk06mrDu18Zhd-vThEG6NIbaQ7lsB3fWdwetOnMlu91KH6n2jcehern5caHgF0nH2mnN93Q57NM2aDyWftjkl8iwhMN8DgOuAPFYlHVsel1SkqDAtJ2I/w1200-h630-p-k-no-nu/Biglietto%20elettronico%20telefono.jpg"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11.4-Released",
          "author": null,
          "description": "Debian 11.4 is out as the fourth stable release update to \"Bullseye\" of this popular community-based Linux distribution...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11.4-Released",
          "publishedOn": "2022-07-09T19:20:04.000Z",
          "wordCount": 1295,
          "title": "Debian 11.4 Released With Dozens Of Bug & Security Fixes",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Atari-DRM-Driver-2022",
          "author": null,
          "description": "In addition to the OpenChrome DRM/KMS driver hoping to be finally mainlined in 2022 for supporting aging VIA graphics hardware from the long-ago days of their x86 chipsets, separately there is a DRM/KMS kernel driver in the works for something even older... A Linux DRM graphics driver for the Atari Falcon from the early 90's...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Atari-DRM-Driver-2022",
          "publishedOn": "2022-07-09T14:00:50.000Z",
          "wordCount": 1597,
          "title": "Atari Open-Source Linux DRM Graphics Driver Being Worked On In 2022",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Gentoo-Portage-Bin-Packages-Exp",
          "author": null,
          "description": "Gentoo developer Andreas Hüttel \"Dilfridge\" is experimenting with binary Gentoo package hosting and finding out what improvements to Portage are needed for making it more of a reality at a larger scale...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Gentoo-Portage-Bin-Packages-Exp",
          "publishedOn": "2022-07-09T10:58:00.000Z",
          "wordCount": 1388,
          "title": "Experiment Underway To Improve Gentoo's Binary Package Handling With Portage",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-More-i915-For-Linux-5.20",
          "author": null,
          "description": "Intel this week submitted to DRM-Next what it anticipates to be the last batch of \"drm-intel-next\" feature changes for the upcoming Linux 5.20 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-More-i915-For-Linux-5.20",
          "publishedOn": "2022-07-09T10:21:32.000Z",
          "wordCount": 1416,
          "title": "Intel Sends In More Graphics Driver Changes For Linux 5.20",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.26-CPP20",
          "author": null,
          "description": "KDE developers are looking at possibly making use of C++20 language features within the Plasma 5.26 desktop and the newer C++ usage could work its way to other KDE components with time too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.26-CPP20",
          "publishedOn": "2022-07-09T09:42:29.000Z",
          "wordCount": 1398,
          "title": "KDE Plasma 5.26 Eyes Using C++20 Features",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Cloud-Hypervisor-25.0",
          "author": null,
          "description": "Cloud Hypervisor as what started out as an Intel open-source project and now lives under the Linux Foundation umbrella as a virtual machine monitor (VMM) for use with Linux KVM and Windows MSHV is out with a new feature release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Cloud-Hypervisor-25.0",
          "publishedOn": "2022-07-09T09:25:35.000Z",
          "wordCount": 1252,
          "title": "Cloud Hypervisor 25.0 Released For Intel-Backed, Rust-Written Linux/Windows VMM",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ANV-Lands-Shader-Module-Ident",
          "author": null,
          "description": "Following last week's release of Vulkan 1.3.219 that introduced the VK_EXT_shader_module_identifier extension and Mesa's Radeon Vulkan driver (RADV) adding support for it earlier this week, Intel's open-source Vulkan driver \"ANV\" has landed support for this new extension to close out the week...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ANV-Lands-Shader-Module-Ident",
          "publishedOn": "2022-07-09T09:05:47.000Z",
          "wordCount": 1340,
          "title": "Intel's ANV Driver Lands VK_EXT_shader_module_identifier - Important For VKD3D-Proton",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MSI-Z690-A-Upstream-Coreboot",
          "author": null,
          "description": "The past few months we have been closely covering the Coreboot port to an MSI retail motherboard for Intel Alder Lake. This port carried out by the 3mdeb consulting firm has been with their downstream \"Dasharo\" firmware based on Coreboot while as of yesterday the motherboard port has begun landing in upstream Coreboot...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MSI-Z690-A-Upstream-Coreboot",
          "publishedOn": "2022-07-08T17:30:14.000Z",
          "wordCount": 1479,
          "title": "MSI PRO Z690-A DDR4 WiFi Support Begins Landing In Upstream Coreboot",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-Snap-50p-Reduction",
          "author": null,
          "description": "Canonical engineers have been continuing their quest to improve the start-up time for the Snap version of Mozilla Firefox that is used by default on Ubuntu 22.04 LTS. With the latest improvements now pushed to the Firefox Snap, they are seeing around a 50% reduction in start-time for the web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-Snap-50p-Reduction",
          "publishedOn": "2022-07-08T16:32:27.000Z",
          "wordCount": 1373,
          "title": "Ubuntu Achieves A ~50% Reduction In Start Time For Firefox Snap",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Feed principale [TurboLab.it]",
      "feedUrl": "https://turbolab.it/feed",
      "siteUrl": "http://turbolab.it",
      "articles": [
        {
          "id": "3618|20220709000001",
          "author": "info@turbolab.it (TurboLab.it)",
          "description": "Non hai tempo di leggerci tutti i giorni? nessun problema! ecco a te il riepilogo di quanto proposto da TurboLab.it nel corso della settimana in conclusione.\n›› Leggi tutto",
          "link": "https://turbolab.it/newsletter-turbolab.it-1349/questa-settimana-tli-09-luglio-2022-3618",
          "publishedOn": "2022-07-08T22:00:01.000Z",
          "wordCount": 1570,
          "title": "Questa settimana su TLI (09 luglio 2022)",
          "imageUrl": "https://turbolab.it/immagini/21966/max"
        }
      ]
    },
    {
      "title": "Latest topics for ZDNet in Windows",
      "feedUrl": "https://www.zdnet.com/topic-windows/rss.xml",
      "siteUrl": "https://www.zdnet.com/",
      "articles": [
        {
          "id": "882424ae-c78a-4826-bf4c-3f0bfcf66bcf",
          "author": null,
          "description": "The 15-inch panel is 5.3mm thin and enables touchscreen functionality on Mac and Windows.",
          "link": "https://www.zdnet.com/home-and-office/smart-office/meet-espresso-display-v2-the-worlds-thinnest-portable-monitor/#ftag=RSSbaffb68",
          "publishedOn": "2022-07-08T15:58:00.000Z",
          "wordCount": null,
          "title": "Meet espresso Display V2, the world's thinnest portable monitor",
          "itunes": {},
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}