{
  "sources": [
    {
      "title": "7-Zip",
      "feedUrl": "https://sourceforge.net/projects/sevenzip/rss?path=/7-Zip",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "Releases – APKMirror",
      "feedUrl": "https://www.apkmirror.com/apk/apkmirror/apkmirror-installer-official/feed/",
      "siteUrl": "https://www.apkmirror.com",
      "articles": []
    },
    {
      "title": "Equalizer APO",
      "feedUrl": "https://sourceforge.net/projects/equalizerapo/rss?path=/",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "mpv player (Windows)",
      "feedUrl": "https://sourceforge.net/projects/mpv-player-windows/rss?path=/release",
      "siteUrl": "https://sourceforge.net",
      "articles": []
    },
    {
      "title": "Arch Linux",
      "feedUrl": "https://www.reddit.com/r/archlinux/.rss",
      "siteUrl": "https://www.reddit.com/r/archlinux/",
      "articles": [
        {
          "id": "https://www.reddit.com/r/archlinux/comments/uthf9e/cannot_boot_into_install_medium/",
          "author": null,
          "description": "Hi everyone, i am still fairly new to linux but i want to get into Arch after using Ubuntu and Tails for a while. My problem is that whenever I am to try and select the option to boot into install medium, the screen will go black for ~10 seconds and then it will just reboot back to where it was. I tried using DD, i am using UEFI and GBR, and secure boot is disabled. I also know there is no issue with the USB because it will boot into the installer on my other pc just fine.\n    submitted by    /u/DoubleBruhMomentus  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/uthf9e/cannot_boot_into_install_medium/",
          "publishedOn": "2022-05-20T00:44:57.000Z",
          "wordCount": 235,
          "title": "Cannot boot into install medium",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/utg0o2/i_tried_merging_the_home_partition_with_the_root/",
          "author": null,
          "description": "First of all, let me explain how I got here: \n When installing arch, I used the archinstall utility and when asked about partitioning I selected \"Best effort partition layout\", which lead the utility to create two partitions (apart from boot and efi): \"Filesystem Root\" and \"Home\". Home contains just my home folder and Filesystem Root contains everything else. After using arch for about 3 months (where I am now) the Filesystem Root has filled up, so I tried merging the two partitions: \n First I made a live usb with EndeavourOS (I picked this distro at random, but I don't think it matters) and booted off of it, then I resized the Home partition to be 80GB instead of 150GB and resized the Root partition to be 100GB instead of 35GB. \n After a reboot to check if I didn't screw up already (everything was fine) I went to the live usb again and copied my user home folder to the root partition, after this I rebooted: \n Where I am now\n ​\n I can't login into my user (gnome 42.1 with gdm) when using Xorg, but when using Wayland I can login and find that almost no apps open (I think I broke flatpak apps) and when launching apps from terminal they say Authorization required, but no authorization protocol specified. \n I am stuck at this strange error message now, although I have a backup of the home folder since I copied it instead of moving it. \n Sorry for any english mistakes, it's not my primary language. If I have left any important information just ask in the comments and I will provide it.\n    submitted by    /u/longhirar  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/utg0o2/i_tried_merging_the_home_partition_with_the_root/",
          "publishedOn": "2022-05-19T23:28:52.000Z",
          "wordCount": 439,
          "title": "I tried merging the home partition with the root partition and now I can't log in as my user",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/utfazn/results_for_the_kernel_benchmarks_in_gaming/",
          "author": null,
          "description": "Someone recently asked whether the Zen-kernel is still viable for gaming and I was wondering the same thing. After doing a little research I found no recent comparison between the popular kernels for gaming on Arch Linux: linux-zen, linux-xanmod and linux-tkg.\n So I figured I should do my own benchmarks and compare those kernels and I asked you guys, which games you wanted to see benchmarked.\n I came up with the following games for various reasons:\n  \nCounter-Strike: Global Offensive\n Civilization VI\n Grand Theft Auto 5\n Cyberpunk 2077\n Shadow of the Tomb Raider\n  \nThese games offer CPU- and GPU-bound scenarios, are more or less popular or often used for benchmarks in the past and they also offer an in-game benchmark.\n Well, when it got to the actual benchmarks, I had to realize, that GTA …",
          "link": "https://www.reddit.com/r/archlinux/comments/utfazn/results_for_the_kernel_benchmarks_in_gaming/",
          "publishedOn": "2022-05-19T22:52:33.000Z",
          "wordCount": 1314,
          "title": "Results for the kernel benchmarks in gaming!",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/utc2i0/just_want_some_advice_about_kernels/",
          "author": null,
          "description": "Hello,\n I'll keep this short so currently i have the linux-zen and the linux packages installed on my system and they often appear to update together always which is kinda a inconvenience to me because I have slow internet and 400MB (together) takes a long time\n I am thinking of having the Zen kernel as my daily kernel and the LTS linux-lts kernel as my backup kernel is that a good idea? and do I even need a backup kernel? I haven't faced any issues with the Zen Kernel so far\n    submitted by    /u/ZaRealPancakes  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/utc2i0/just_want_some_advice_about_kernels/",
          "publishedOn": "2022-05-19T20:10:51.000Z",
          "wordCount": 530,
          "title": "Just want some advice about kernels",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut8y2h/grub_locks_the_separate_boot_menu_f11f10/",
          "author": null,
          "description": "On my laptop, pressing F11 opens a menu where you can choose what you want to make run. After installing grub I can't get into it anymore because grub comes up. I can write exit in the console and get there, but no matter what I choose grub will start and if I do the same thing again grub starts loading UEFI settings, windows and etc. At the same time, it doesn't allow bootable flash drives and can't install anything there.\n    submitted by    /u/Reged1tFox  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut8y2h/grub_locks_the_separate_boot_menu_f11f10/",
          "publishedOn": "2022-05-19T17:48:05.000Z",
          "wordCount": 211,
          "title": "Grub locks the separate boot menu (F11/F10)",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut7jxp/remove_all_packages_except_what_is_listed_in_text/",
          "author": null,
          "description": "Anyone know an easy way of doing to opposite of \"pacman -R $(yourfile)\"?\n    submitted by    /u/Grizzlybow  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut7jxp/remove_all_packages_except_what_is_listed_in_text/",
          "publishedOn": "2022-05-19T16:43:37.000Z",
          "wordCount": 145,
          "title": "remove all packages except what is listed in text file?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut78iq/custom_secure_boot_keys_on_a_dell_xps_15_9520/",
          "author": null,
          "description": "I've bought a brand new Dell XPS 15 9520 laptop (should be a 2022 model). My usual Linux setup involves enabling secure boot with custom keys, and using full-disk encryption with automatic unlock based on TPM. Since the laptop came with Windows preinstalled, it came with secure boot enabled and with Microsoft's keys installed.\n The first thing I tried was putting the UEFI in \"Expert Key Management\" mode to clear the current keys and allow me to enroll my own, but I was greeted with the below warning:\n  \nModifying Secure Boot Databases could renter your system unable to boot. System graphics may not function. Some devices might not function properly. The system could become unrecoverable.\n  \nThis is in the same lines to the warning in the Arch Wiki. I've also read similar reports in the past from people around Reddit. It's also not very clear on just what exactly it means by \"may not function\". Note that the laptop comes with an integrated intel video card and a dedicated nvidia one.\n Does anybody have experience in enrolling custom keys in their recent Dell laptops? I had no trouble at all enrolling custom keys into my 3-years old Dell Precision 5540, but that laptop had an obviously older UEFI app and a different general build.\n I don't dare to clear the current keys until I find confirmation online that it's safe to do so (I wish Dell included a clearer message).\n ​\n EDIT: here are some pictures on what the UEFI screen shows exactly. Note the warnings in the \"Enable Microsoft UEFI CA\" section as well.\n    submitted by    /u/zayatura  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut78iq/custom_secure_boot_keys_on_a_dell_xps_15_9520/",
          "publishedOn": "2022-05-19T16:29:15.000Z",
          "wordCount": 422,
          "title": "Custom secure boot keys on a Dell XPS 15 9520",
          "imageUrl": "https://external-preview.redd.it/vvQFgIzz1ZJB5y5KpJ-kSEcxmenrdv2UvOsUfagvhbM.jpg?auto=webp&s=5c05556da58f153d742f32849fd8f1657b810fe4"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut6rfd/archinstall_help_disk_layout/",
          "author": null,
          "description": "How to confirm disk layout? Pressing ESC to skip seems to nullify the setting if I try to enter into it again. Or does it set it when you skip and then it resets when you go into it again?\n    submitted by    /u/AlShaMignon  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut6rfd/archinstall_help_disk_layout/",
          "publishedOn": "2022-05-19T16:07:21.000Z",
          "wordCount": 182,
          "title": "Archinstall help Disk Layout",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut67c6/xampp_and_mysqlworkbench_using_mysql/",
          "author": null,
          "description": "How can I make MySQL-Workbench to work with XAMPP? From what I've search, XAMPP on Arch Linux is using MariaDB, but I need XAMPP to use MySQL to work with MySQL-Workbench. However I can't figure how to make that happen. I must use XAMPP and MySQL-Workbench since is a requirement for my class.\n    submitted by    /u/parawaa  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut67c6/xampp_and_mysqlworkbench_using_mysql/",
          "publishedOn": "2022-05-19T15:40:53.000Z",
          "wordCount": 226,
          "title": "XAMPP and MySQL-workbench using MySQL?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut527v/airplay_server/",
          "author": null,
          "description": "Hey guys, I'm running an M1 Macbook for work, and sadly it's the 13\" which is limited to 1 external display (cable connection), though I can connect more displays through airplay. I'm running my peripherals through software KVM and toggle my main screen input through a script.\n Was wondering if someone could recommend a server for running airplay screens on my desktop machine, Ideally something cross-platform as I boot Windows quite often too but platform specific would work too.\n Also, if this supported multiple instances so I could have 2 airplay displays on my desktop machine it would be great.\n Sorry if this is the wrong sub for this, I know this seems to have nothing to do with arch but I thought about going into r/opensource or r/linux but both seem way more dedicated to news than questions, also r/apple or mac or whatever doesn't seem to be a place where people even have this kind of use case.\n Thanks!\n    submitted by    /u/ezpzCSGO  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut527v/airplay_server/",
          "publishedOn": "2022-05-19T14:47:22.000Z",
          "wordCount": 247,
          "title": "Airplay server",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut3wob/aur_noisetorchbin_security_advice_on_potentially/",
          "author": null,
          "description": "Context:\n  \nNoiseTorch = github\n AUR = noisetorch-bin\n  \n  \nI HAVE REASON TO BELIEVE AT LEAST ONE OF MY SYSTEMS HOLDING KEY MATERIAL HAS BEEN COMPROMISED.\n DO. NOT. TRUST. THE. BINARIES.\n I'm deeply sorry about this, but it's better to be safe than sorry.\n To make clear to everyone that I'm absolutely not joking:\n $ base64 private.key RBjU5k0Dfdqtyzx4ox6PfQoqrdCft/aFJieD2DQvloY= \n I'm publically leaking the key myself now. Don't trust it.\n  \nsource\n + relevant maintainer's comment\n  \nBinaries from GitHub releases have been removed, latest are from a year ago (0.11.2, 20 May 2021).\n What should be done to the package?\n    submitted by    /u/murlakatamenka  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut3wob/aur_noisetorchbin_security_advice_on_potentially/",
          "publishedOn": "2022-05-19T13:52:06.000Z",
          "wordCount": 489,
          "title": "[AUR] noisetorch-bin: security advice on potentially compromised upstream binaries",
          "imageUrl": "https://external-preview.redd.it/PDjJk9Jv_oSNGLeVHO9zsc_bY_mbXHxdeLIqZiaRefo.jpg?auto=webp&s=d6b7403de87939adaea23d2e776ad283a43a68dc"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut383i/pacman_feature_idea/",
          "author": null,
          "description": "So while doing some testing a few days ago I had an idea, not sure if something like this exists but I reckon it could be super handy.\n Basically my idea is being able to tag installed packages with labels so you can do things like mass removals easier. For example something like:\n pacman -S [packages] -t (for tag) [tag/label] \n So, if you wanted to remove that group of packages you could just do something like:\n pacman -R [tag/label used from the install] \n I know you can use pacman to autoremove packages + their dependencies but it isn't uncommon for me to have to specify apps to remove that depend on something, being able to tag all of those packages and then remove them all at once if needed would be pretty useful IMO.\n I think a good example would be if you wanted to install a desktop environment plus a bunch of other extras on top, but tag them all so if you wanna remove the whole DE + those extras you could a bit easier.\n Just interested to see what people think of something like this.\n    submitted by    /u/Phrench64  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut383i/pacman_feature_idea/",
          "publishedOn": "2022-05-19T13:16:42.000Z",
          "wordCount": 980,
          "title": "Pacman Feature Idea",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut2uy0/what_it_takes_to_become_an_arch_repo_maintainer/",
          "author": null,
          "description": "Hi ,\n As the title says I want to know what it takes to become an Arch Repo Maintainer ?\n I have searched online but not much information so I will ask some questions , maybe someone will answer.\n I want to know for example :\n  \nHow do you look for updates/releases for each package? is this something automated or is a manual job?\n How many hours do you spend to update your repos?\n How hard is to find mirrors to host the packages ? How do you apply for a mirror ? How mirrors are synchronized ?\n How do you assign which one is responsible for each package in order to maintain it?\n How do you trust someone to become a Maintainer? Do you have some criteria ?\n What do you do when a main app is not package for Arch Linux?\n How do you keep up with the Kernel updates and how you maintain it.\n How boring or exciting is this job to do?\n What are the struggles?\n How you keep up with everyday getting alerts that this package is out of date?\n  \n​\n In short I would like a documentary of a daily life of an Arch Repo Maintainer.\n    submitted by    /u/wolfyrion  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut2uy0/what_it_takes_to_become_an_arch_repo_maintainer/",
          "publishedOn": "2022-05-19T12:58:06.000Z",
          "wordCount": 600,
          "title": "What it takes to become an Arch Repo Maintainer ?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut2m5b/strange_cpu_performance_issue_on_xps_17_12900hk/",
          "author": null,
          "description": "Hi all. I am a long time (since the very early days of Linux kernel) Linux user and developer, who has been mainly a RedHat / Fedora user. Now I decided to give the Arch distribution a go, using the ready made GUI installer variants, and installed it on my new Dell XPS 12900HK system. I didn't invest much time yet but I am seeing that the core frequencies are stuck around 1.5 GHz, even though I max them out via cpupower, set the governor to performance and thermal profile also to Performance. PLs are also looking OK and /sys/class/powercap/intel-rapl:0/constraint_0/1_power_limit_uw are set to 75W and 115W. I use the s-tui stress test and it is stuck at around 1.5 GHz. The temps are below 50°C and the fans are inaudible, so there is no thermal throttling.\n I have no such problems with Fedora, so I was wondering if Arch (or the GUI variant I am using) by default does some tweaking that limits the CPUs for laptops? Does the pure Arch have such (maybe kernel) tweaks? Thanks.\n    submitted by    /u/darginmahkum  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut2m5b/strange_cpu_performance_issue_on_xps_17_12900hk/",
          "publishedOn": "2022-05-19T12:44:43.000Z",
          "wordCount": 338,
          "title": "Strange CPU performance issue on XPS 17 / 12900HK",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ut06x6/6ch_audio_is_inaudible_in_pipewire_arch_linux/",
          "author": null,
          "description": "The audio played is audible in pulseaudion but not in the pipewire.\n    submitted by    /u/Pakosaan  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ut06x6/6ch_audio_is_inaudible_in_pipewire_arch_linux/",
          "publishedOn": "2022-05-19T10:15:07.000Z",
          "wordCount": 122,
          "title": "6CH audio is inaudible in pipewire arch linux.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usz3xg/got_a_fully_working_system_now_need_help_to_solve/",
          "author": null,
          "description": "Hi! I think this is not typical \"help me\" post, as I already looked on the wiki, google and just spent some hours fixing and I already solved all the problems I had. But...I am not sure at all of my solutions, so I come here to ask for help. Specially for the first problem I had, I hope I can find a better way.\n I am writing from a new Archlinux install, using archinstall (shame on me). Found some problems and \"solved\" all of them, just need some help trying to fix some error or changing configuration in a better way.\n I am using KDE with NVIDIA proprietary and Linux-LTS kernel (Intel 11400 with a 3070ti, modern machine)\n 1.- The first problem is the most important as I don't have a clue how to solve it in a better way. In the archinstall, on \"network configuration\" menu, I selected \"use n…",
          "link": "https://www.reddit.com/r/archlinux/comments/usz3xg/got_a_fully_working_system_now_need_help_to_solve/",
          "publishedOn": "2022-05-19T08:54:21.000Z",
          "wordCount": 1012,
          "title": "Got a fully working system now. Need help to solve some problems in a better way.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usyqhn/how_to_start_wayland_sessions_from_the_tty/",
          "author": null,
          "description": "Alternatively, what's your display manager that works with Wayland? I suspect I've done some stuff with my lightdm which made it not work with Wayland (eg. moved ~/.Xauthority to a more suitable location). \n LE:\n I've tried resetting the whole configuration of lightdm + greeter but it does the same thing. xauth creates a ~/.Xauthority file but trying to \"open\" a Wayland session results in a black screen and reverting back to the lightdm login. where are the log files I should check?\n LLE:\n I need to use a display manager, your answers were super helpful tho !!\n    submitted by    /u/ervinpop  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usyqhn/how_to_start_wayland_sessions_from_the_tty/",
          "publishedOn": "2022-05-19T08:24:58.000Z",
          "wordCount": 522,
          "title": "How to start Wayland sessions from the tty?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usxk9g/new_arch_installer/",
          "author": null,
          "description": "Hi, has anyone tried the new arch installer ? Is it really any good as they claim, the previous one from 3-6 months ago I tried was a mess. If so, is the granularity of installation the same as with a CLI install?\n    submitted by    /u/akasaka99  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usxk9g/new_arch_installer/",
          "publishedOn": "2022-05-19T06:59:53.000Z",
          "wordCount": 1005,
          "title": "New arch installer",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/ust3op/video_and_audio_only_play_when_bluetooth_device/",
          "author": null,
          "description": "So as the title says for some reason after restarting my computer after uninstalling auto-cpufreq I am only able to play both videos (such as youtube) and audios (such as spotify) when my airpods are connected.\n    submitted by    /u/mrjohndoe42069  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/ust3op/video_and_audio_only_play_when_bluetooth_device/",
          "publishedOn": "2022-05-19T02:25:15.000Z",
          "wordCount": 285,
          "title": "Video and audio only play when bluetooth device is connected.",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/uss48o/update_grub_config_for_arch_from_another_distro/",
          "author": null,
          "description": "I have a dual-booted system with Ubuntu and arch. Ubuntu is the default and controls grub, with os-prober used to add arch when changes are made. My arch os doesn't even have grub installed on it. How do I make changes to the grub config in Ubuntu so that they affect arch? So far any changes I make only affect Ubuntu.\n    submitted by    /u/lovecraftedidiot  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/uss48o/update_grub_config_for_arch_from_another_distro/",
          "publishedOn": "2022-05-19T01:31:58.000Z",
          "wordCount": 169,
          "title": "Update grub config for Arch from another distro",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usqekl/how_can_i_troubleshoot_a_wake_from_sleep_issue/",
          "author": null,
          "description": "After a recent update my wake from sleep isn't working properly.\n On wake up the screen activates for 30seconds or so but SDDM login screen never appears and I have to hard power reset/reboot my system to get to a login screen. How can I troubleshoot this?\n Are logs saved from the previous boot somewhere?\n My gear as requested previously:\n 5950x, 6700xt, asrock x570 m pro4, 5.17 kernel, kde desktop, SDDM. \n Before the update sleep worked perfectly for 5+ months. . . \n Thanks for any tips or ideas\n    submitted by    /u/Im-Mostly-Confused  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usqekl/how_can_i_troubleshoot_a_wake_from_sleep_issue/",
          "publishedOn": "2022-05-19T00:01:14.000Z",
          "wordCount": 198,
          "title": "How can I troubleshoot a wake from sleep issue?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/uspenc/secure_boot_and_archinstall_via_usb/",
          "author": null,
          "description": "Hey all,\n Want to make a switch to Arch, but wondering if there is a uefi x64 shim I can place on the USB so that secure boot is used straight from the install?\n Is there any easy way to do this, or a guide anywhere?\n I don't want to get Arch running, then go through adding secure boot post-install, as there are a few machines I'd love to just get running quickly\n    submitted by    /u/AussieAn0n  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/uspenc/secure_boot_and_archinstall_via_usb/",
          "publishedOn": "2022-05-18T23:10:09.000Z",
          "wordCount": 293,
          "title": "Secure Boot and archinstall via USB",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/uspcr0/stuck_on_running_early_hook_udev_when_i_boot_my_pc/",
          "author": null,
          "description": "I recently bought a pc but when I boot it opens up a page that says\n running early hook [udev]\n starting version 248.3-2-Arch\n my pc gets stuck on this page and when I restart it or power it off Then on again it brings me right back to this page. i have an option to open up bios except I have no idea what to do in bios to fix it or how to fix it in general\n Incase it matters my specs are EVGA RTX 2070 super, Ryzen 7 3800x, and 32gb of ram\n someone please help I have no idea how to fix this, Thanks!\n    submitted by    /u/LucasNelson_25  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/uspcr0/stuck_on_running_early_hook_udev_when_i_boot_my_pc/",
          "publishedOn": "2022-05-18T23:07:29.000Z",
          "wordCount": 356,
          "title": "Stuck on Running Early Hook [udev] when I boot my pc",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usoqcp/mesonbuild_returns_error_while_installing/",
          "author": null,
          "description": "I'm new to Arch Linux, so I'm sorry if it's a dumb question.\n Recently I tried installing python-validity package using yay and every time I try it the build fails because of an error returned by meson.build:\n fprintd-clients/meson.build:1:0: ERROR: Unknown linker(s): [['gcc-ar'], ['ar'], ['gar']] The following exception(s) were encountered: Running \"gar --version\" gave \"[Errno 2] No such file or directory: 'gar'\" \n Since it's the second package I encounter this error with (don't remember which one was the first one, though) I thought it hasn't something to do with the package itself but maybe with something on my PC, am I right? Is there something I can do to fix this?\n (I already tried uninstalling meson and reinstalling it first using pip and then using yay... it seems to be installed successfully, but I don't know)\n    submitted by    /u/Elodran  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usoqcp/mesonbuild_returns_error_while_installing/",
          "publishedOn": "2022-05-18T22:37:18.000Z",
          "wordCount": 248,
          "title": "meson.build returns error while installing packages with yay",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usoppg/strange_wifi_issues/",
          "author": null,
          "description": "Hi, I have been having some confusing problems with my wifi.\n Network manager is often, but not always, unable to see any WiFi networks and there appears to be a correlation with this problem and the wifi networks my university provides, specifically eduroam. Occasionally I will be able to see all the networks that I should be able to, but, after an attempted connection timing out, the networks are no longer found by network manager. What is very odd it that this problem seems to be local to the wifi networks in use at my university. I was perfectly able to find and connect to networks in a cafe yesterday. It has crossed my mind that my credentials could have been blacklisted from the wifi (my torrenting is distros and copyright free material, obviously) but this can't be the case because my phone and other laptop connect fine with the same credentials.\n I should make clear that in some buildings of my university, I am able to see and connect to eduroam, so I'm pretty sure the problem isn't related to how I have the eduroam connection configured. \n The hardware I am using is Qualcomm Atheros AR9285 Wireless Network Adapter (PCI-Express) and the ath9k kernel driver. I am running kernel version Linux 5.17.8-arch1-1.\n I can and would provide logs but because I am in the dark about what is going wrong I don't know which logs would be relevant as the ones I have looked through don't appear to show anything obviously wrong. I would greatly appreciate any pointers about what could be going on here. Thank you :)\n    submitted by    /u/resvald  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usoppg/strange_wifi_issues/",
          "publishedOn": "2022-05-18T22:36:20.000Z",
          "wordCount": 468,
          "title": "Strange WiFi issues",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usn04a/arch_firmware_problems/",
          "author": null,
          "description": "I'm trying to install Arch on a laptop that had its screen broken years ago, it worked fine with Ubuntu but I forgot the password. Now I wanted to try Arch but when entering the BIOS menu if I connect the laptop to a screen (that way I used and install Ubuntu) nothing appears on the screen, it is connected by HDMI. Could someone help me with any solution?\n    submitted by    /u/sinnstral  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usn04a/arch_firmware_problems/",
          "publishedOn": "2022-05-18T21:14:56.000Z",
          "wordCount": 236,
          "title": "Arch firmware problems (?)",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usmdyc/issues_installing_xmobargit/",
          "author": null,
          "description": "Hello,\n I've recently successfully installed xmobar-git on my main VM and had fun tweaking it. I've now attempted a similar installation on a different VM, and I'm literally going insane with it.\n I get weird errors telling me that some package is broken. I've attempted to solve this by googling, reinstalling and doing the rain-dance. Can't get it to work, although it worked a couple days ago.\n Here is the error I get, note the fact the I check for installed packages in the end and they are identical to the packages on the working VM, yet it complains a bunch and won't let me install it. I can't think of how to proceed with this.\n Arch% sudo aura -A xmobar-git aura >>= Determining dependencies... aura >>= AUR Packages: xmobar-git aura >>= Continue? [Y/n] aura >>= Building xmobar-git... aura >>= Building failed. Would you like to see the error? [Y/n] xmobar-git ... Skipped Switched to a new branch 'makepkg' Error: The following packages are broken because other packages they depend on are missing. These broken packages must be rebuilt before they can be used. installed package dbus-1.2.22 is broken due to missing package lens-5.1-Ip0S0ojmIlP8S4rE2GWrUQ ==> ERROR: A failure occurred in build(). Aborting... aura >>= There was a makepkg failure. aura >>= Would you like to continue anyway? [Y/n] n aura >>= Building failed. Arch% pacman -Q | grep dbus dbus 1.14.0-1 haskell-dbus 1.2.22-53 Arch% pacman -Q | grep lens haskell-lens 5.1-37 Arch% \n    submitted by    /u/pink-skyline  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usmdyc/issues_installing_xmobargit/",
          "publishedOn": "2022-05-18T20:46:45.000Z",
          "wordCount": 533,
          "title": "Issues installing xmobar-git",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usl40h/fcitx5_empty_system_tray_context_menu/",
          "author": null,
          "description": "Hey guys! For some reason, when I right click the fcitx5 system tray icon it pops up empty, I'm guessing it's a font problem. Does anyone know how to solve this?\n I have already installed the following fonts: ttf-dejavu ttf-liberation noto-fonts noto-fonts-cjk noto-fonts-emoji\n thanks in advance :D\n https://imgur.com/a/NbyxWeC \n edit: not really solved, just uninstalled fcitx5 installed fcitx and everything is working fine now, apparently fcitx5 is just broken\n    submitted by    /u/TR0V40_  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usl40h/fcitx5_empty_system_tray_context_menu/",
          "publishedOn": "2022-05-18T19:47:18.000Z",
          "wordCount": 170,
          "title": "fcitx5 empty system tray context menu",
          "imageUrl": "https://external-preview.redd.it/iu128d7VkacESXv8ojY_w-hfMBzfNgctqdO0yJ4nBZ8.jpg?auto=webp&s=43675b85877f63397c2b6ef8421c990a3cebcc80"
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/uskag1/greek_characters_are_not_displayed_right/",
          "author": null,
          "description": "Hello,\n Im using xprop to get the names of windows, and whenever there is greek text involed, it is displayed as follows:\n \\316\\221\\316\\273\\316\\273\\316\\267\\316\\273\\316\\277\\316\\263\\317\\201\\316\\261\\317\\206\\316\\257\\316\\261 \n I am thinking that it has to do with fonts but Im not sure. I have ttg-mgopen(TrueType fonts containing glyphs for the Latin and Greek alphabet) installed.\n The issue doesn't seem to be terminal emulator specific, as the same gibberish appear on my i3 status bar(I'm using a script that, using xprop, displays the window names in status bar).\n I don't know what other info to provide, that can be useful so write me in the comments and I will edit this post accordingly.\n    submitted by    /u/that_guu  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/uskag1/greek_characters_are_not_displayed_right/",
          "publishedOn": "2022-05-18T19:08:30.000Z",
          "wordCount": 297,
          "title": "Greek characters are not displayed right",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usjpm5/help_key_mapping_is_making_me_cry_trying_to_map/",
          "author": null,
          "description": "Hi everyone,\n I've been trying to make some custom mapping on my keyboard with `xmodmap` and `setxkbmap` but it's just too much of a black box for me ): I read the arch wiki regarding Xorg keyboard configuration and other sources but most of the times they just give some commands but doesn't explain how things work. So far I'm just unable to debug anything at all.\n Regarding the mapping, I tried to `xmodmap -e keycode 108 = Return` and it works, but the behavior is slightly different, mainly the real Return key keeps sending the press while being hold, and the mapped Right Alt key just send it once, until release.\n Does someone have resources where I can read about how these things are handled ? Or do you have experience with it ? I'm totally lost right now.\n    submitted by    /u/BabyAintBuffaloYoung  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usjpm5/help_key_mapping_is_making_me_cry_trying_to_map/",
          "publishedOn": "2022-05-18T18:41:59.000Z",
          "wordCount": 313,
          "title": "Help, key mapping is making me cry ): Trying to map Right Alt to Enter/Return",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usi2tf/how_to_get_the_libpng15_dependecny_to_work/",
          "author": null,
          "description": "when i cloned the repo for the libpng15 and trying to build it i get this \n one or more pgps cannot be verified. \n so i read on the packages site that the key was expired and get it to work use this command gpg --keyserver pool.sks-keyservers.net --recv-keys 8048643BA2C840F4F92A195FF54984BFA16C640F \n i tried this command but i get this gpg: keyserver receive failed: Server indicated a failure.well what should i do now? where to grab the libpng dependency to install autodesk maya?(i cloned maya from the aur and im missing libpng15 ncurses5-compat-libs adsklicensing=12.0.0.6537 libffi6 dependcies to build it)\n    submitted by    /u/angryteapod  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usi2tf/how_to_get_the_libpng15_dependecny_to_work/",
          "publishedOn": "2022-05-18T17:26:13.000Z",
          "wordCount": 240,
          "title": "how to get the libpng15 dependecny to work?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usff88/steam_suddenly_more_resource_intensive/",
          "author": null,
          "description": "I noticed one day that steam started to freeze up midgame when playing where 100% memory would be taken up. Even out of a game, just having the launcher open to login tacks on a fairly noticeable memory usage that I'm pretty sure it didn't do before.\n This only started happening-that I noticed-within the last few days.\n What could be going on here?\n    submitted by    /u/reenmini  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usff88/steam_suddenly_more_resource_intensive/",
          "publishedOn": "2022-05-18T15:24:27.000Z",
          "wordCount": 243,
          "title": "steam suddenly more resource intensive?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usf266/can_i_add_non_recursive_mappings_in_zathura/",
          "author": null,
          "description": "I remapped G to go the end of the last page instead of the beginning. However, this breaks [page number]G and I can no longer go to a particular page number I want. Is there a way to add non recursive mappings like noremap in vim?\n    submitted by    /u/haca42  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usf266/can_i_add_non_recursive_mappings_in_zathura/",
          "publishedOn": "2022-05-18T15:07:30.000Z",
          "wordCount": 154,
          "title": "Can I add non recursive mappings in zathura?",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/use5l9/bluetooth_headset_fails_to_connect/",
          "author": null,
          "description": "Trying to connect some wireless headphones to my laptop. They worked a couple days ago then stopped and I cant figure out why. Before that it would work for a few days then stop until I rebooted or just tried again after a few hours. Now it hasn't worked for almost 2 weeks.\n ``` $ neofetch Host: 20BU000AUS ThinkPad T450 Kernel: 5.17.7-zen1-2-zen \n Installed\n bluez 5.64-2 bluez-firmware 1.2-9 bluez-hid2hci 5.64-2 bluez-libs 5.64-2 bluez-utils 5.64-2 hidapi 0.11.2-1 libldac 2.0.2.3-1 pulseaudio-bluetooth 15.0-4 sbc 1.5-2\n $ bluetoothctl show Powered: yes Discoverable: no Pairable: yes\n $ bluetoothctl info 8D:40:4C:C6:73:A4 Device 8D:40:4C:C6:73:A4 (public) Paired: yes Trusted: yes Blocked: no Connected: no LegacyPairing: no\n $ bluetoothctl connect 8D:40:4C:C6:73:A4 Attempting to connect to 8D:40:4C:C6:73:A4 Failed to connect: org.bluez.Error.Failed br-connection-profile-unavailable\n $ journalctl -u bluetooth bluetoothd[13782]: src/service.c:btd_service_connect() a2dp-sink profile connect failed for 8D:40:4C:C6:73:A4: Protocol not available\n $ systemctl list-unit-files | grep blue UNIT FILE STATE VENDOR PRESET bluetooth-mesh.service enabled disabled bluetooth.service enabled disabled dbus-org.bluez.mesh.service alias - dbus-org.bluez.service alias - bluetooth.target static -\n $ lsmod | grep bluetooth bluetooth 925696 31 btrtl,btmtk,btintel,btbcm,bnep,btusb crc16 16384 1 bluetooth rfkill 36864 6 iwlmvm,bluetooth,thinkpad_acpi,cfg80211 ecdh_generic 16384 2 bluetooth\n ```\n    submitted by    /u/dominic_l  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/use5l9/bluetooth_headset_fails_to_connect/",
          "publishedOn": "2022-05-18T14:25:56.000Z",
          "wordCount": 344,
          "title": "Bluetooth headset fails to connect",
          "imageUrl": null
        },
        {
          "id": "https://www.reddit.com/r/archlinux/comments/usduu3/arch_linux_stop_working_and_sometimes_restart/",
          "author": null,
          "description": "I've been using Arch Linux for like 6 months. I installed it with kde-plasma and recently moved into i3 window manager. Ever since I started using i3 my system halts unexpectedly. I mean I work like 2-3 hours and suddenly the computer halts and I have to restart it. And sometimes even weirder, it restart automatically. I have three questions?\n  \nWhy does this happens?\n How to fix it?\n Am I hacked?\n  \n   submitted by    /u/NoMango101  \n [link]   [comments]",
          "link": "https://www.reddit.com/r/archlinux/comments/usduu3/arch_linux_stop_working_and_sometimes_restart/",
          "publishedOn": "2022-05-18T14:11:54.000Z",
          "wordCount": 329,
          "title": "Arch Linux stop working and sometimes restart automatically.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arch Linux: Releases",
      "feedUrl": "https://archlinux.org/feeds/releases/",
      "siteUrl": "https://archlinux.org/download/",
      "articles": []
    },
    {
      "title": "Arch Linux: Recent news updates",
      "feedUrl": "https://archlinux.org/feeds/news/",
      "siteUrl": "https://archlinux.org/news/",
      "articles": []
    },
    {
      "title": "BleepingComputer",
      "feedUrl": "https://www.bleepingcomputer.com/feed/",
      "siteUrl": "https://www.bleepingcomputer.com/",
      "articles": [
        {
          "id": "https://www.bleepingcomputer.com/news/security/conti-ransomware-shuts-down-operation-rebrands-into-smaller-units/",
          "author": "Lawrence Abrams",
          "description": "The notorious Conti ransomware gang has officially shut down their operation, with infrastructure taken offline and team leaders told that the brand is no more. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/conti-ransomware-shuts-down-operation-rebrands-into-smaller-units/",
          "publishedOn": "2022-05-19T23:32:59.000Z",
          "wordCount": 1476,
          "title": "Conti ransomware shuts down operation, rebrands into smaller units",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/03/01/Conti_headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/technology/netgear-fixes-bad-orbi-firmware-update-that-locked-admin-console/",
          "author": "Lawrence Abrams",
          "description": "Netgear is pushing out fixes for a bad Orbi firmware update released earlier this month that prevents users from accessing the device's admin console. [...]",
          "link": "https://www.bleepingcomputer.com/news/technology/netgear-fixes-bad-orbi-firmware-update-that-locked-admin-console/",
          "publishedOn": "2022-05-19T23:08:58.000Z",
          "wordCount": 1161,
          "title": "Netgear fixes bad Orbi firmware update that locked admin console",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/19/orbi-header.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/microsoft/microsoft-emergency-updates-fix-windows-ad-authentication-issues/",
          "author": "Sergiu Gatlan",
          "description": "Microsoft has released emergency out-of-band (OOB) updates to address Active Directory (AD) authentication issues after installing Windows Updates issued during the May 2022 Patch Tuesday on domain controllers. [...]",
          "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-emergency-updates-fix-windows-ad-authentication-issues/",
          "publishedOn": "2022-05-19T21:41:47.000Z",
          "wordCount": 984,
          "title": "Microsoft emergency updates fix Windows AD authentication issues",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/09/15/Microsoft_passwordless.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/media-giant-nikkei-s-asian-unit-hit-by-ransomware-attack/",
          "author": "Sergiu Gatlan",
          "description": "Publishing giant Nikkei disclosed that the group's headquarters in Singapore was hit by a ransomware attack almost one week ago, on May 13th. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/media-giant-nikkei-s-asian-unit-hit-by-ransomware-attack/",
          "publishedOn": "2022-05-19T18:26:06.000Z",
          "wordCount": 912,
          "title": "Media giant Nikkei’s Asian unit hit by ransomware attack",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/19/Nikkei.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/",
          "author": "Sergiu Gatlan",
          "description": "A stealthy and modular malware used to hack into Linux devices and build a DDoS botnet has seen a massive 254% increase in activity during the last six months, as Microsoft revealed today. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/",
          "publishedOn": "2022-05-19T17:45:00.000Z",
          "wordCount": 1017,
          "title": "Microsoft detects massive surge in Linux XorDDoS malware activity",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/11/19/Linux_backdoor.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/us-doj-will-no-longer-prosecute-ethical-hackers-under-cfaa/",
          "author": "Bill Toulas",
          "description": "The U.S. Department of Justice (DOJ) has announced a revision of its policy on how federal prosecutors should charge violations of the Computer Fraud and Abuse Act (CFAA), carving out \"good-fath\" security research from being prosecuted. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/us-doj-will-no-longer-prosecute-ethical-hackers-under-cfaa/",
          "publishedOn": "2022-05-19T17:24:57.000Z",
          "wordCount": 1394,
          "title": "U.S. DOJ will no longer prosecute ethical hackers under CFAA",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/19/usa-lady-justice.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/lazarus-hackers-target-vmware-servers-with-log4shell-exploits/",
          "author": "Bill Toulas",
          "description": "The North Korean hacking group known as Lazarus is exploiting the Log4J remote code execution vulnerability to inject backdoors that fetch information-stealing payloads on VMware Horizon servers. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/lazarus-hackers-target-vmware-servers-with-log4shell-exploits/",
          "publishedOn": "2022-05-19T15:24:04.000Z",
          "wordCount": 1120,
          "title": "Lazarus hackers target VMware servers with Log4Shell exploits",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/12/13/Log4j___logo.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/phishing-websites-now-use-chatbots-to-steal-your-credentials/",
          "author": "Bill Toulas",
          "description": "Phishing attacks are now using automated chatbots to guide visitors through the process of handing over their login credentials to threat actors. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/phishing-websites-now-use-chatbots-to-steal-your-credentials/",
          "publishedOn": "2022-05-19T13:00:00.000Z",
          "wordCount": 1482,
          "title": "Phishing websites now use chatbots to steal your credentials",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/19/robot-laptop.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/microsoft-teams-windows-11-hacked-on-first-day-of-pwn2own/",
          "author": "Sergiu Gatlan",
          "description": "During the first day of Pwn2Own Vancouver 2022, contestants won $800,000 after successfully exploiting 16 zero-day bugs to hack multiple products, including Microsoft's Windows 11 operating system and the Teams communication platform. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/microsoft-teams-windows-11-hacked-on-first-day-of-pwn2own/",
          "publishedOn": "2022-05-19T11:39:11.000Z",
          "wordCount": 1102,
          "title": "Microsoft Teams, Windows 11 hacked on first day of Pwn2Own",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/04/08/Pwn2Own-2021.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/qnap-alerts-nas-customers-of-new-deadbolt-ransomware-attacks/",
          "author": "Sergiu Gatlan",
          "description": "Taiwan-based network-attached storage (NAS) maker QNAP warned customers on Thursday to secure their devices against attacks pushing DeadBolt ransomware payloads. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/qnap-alerts-nas-customers-of-new-deadbolt-ransomware-attacks/",
          "publishedOn": "2022-05-19T10:38:26.000Z",
          "wordCount": 1199,
          "title": "QNAP alerts NAS customers of new DeadBolt ransomware attacks",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/04/29/QNAP-headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-rely-more-on-weaponizing-vulnerabilities/",
          "author": "Ionut Ilascu",
          "description": "Security researchers are warning that external remote access services continue to be the main vector for ransomware gangs to breach company networks. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-rely-more-on-weaponizing-vulnerabilities/",
          "publishedOn": "2022-05-19T09:36:56.000Z",
          "wordCount": 1354,
          "title": "Ransomware gangs rely more on weaponizing vulnerabilities",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/08/31/Ransomware-megaphone.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-first-iso-image-for-new-windows-11-dev-builds/",
          "author": "Lawrence Abrams",
          "description": "Microsoft has released the first ISO image for the new Windows 11 Preview builds in the Dev channel, allowing Windows Insiders to perform clean installs of the operating system. [...]",
          "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-first-iso-image-for-new-windows-11-dev-builds/",
          "publishedOn": "2022-05-18T22:27:02.000Z",
          "wordCount": 915,
          "title": "Microsoft releases first ISO image for new Windows 11 Dev builds",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/10/21/windows-11-gradient-header.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/spanish-police-dismantle-phishing-gang-that-emptied-bank-accounts/",
          "author": "Bill Toulas",
          "description": "The Spanish police have announced the arrest of 13 people and the launch of investigations on another 7 for their participation in a phishing ring that defrauded at least 146 people. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/spanish-police-dismantle-phishing-gang-that-emptied-bank-accounts/",
          "publishedOn": "2022-05-18T21:36:18.000Z",
          "wordCount": 1033,
          "title": "Spanish police dismantle phishing gang that emptied bank accounts",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/10/29/arrest-cuffs.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/critical-jupiter-wordpress-plugin-flaws-let-hackers-take-over-sites/",
          "author": "Bill Toulas",
          "description": "WordPress security analysts have discovered a set of vulnerabilities impacting the Jupiter Theme and JupiterX Core plugins for WordPress, one of which is a critical privilege escalation flaw. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/critical-jupiter-wordpress-plugin-flaws-let-hackers-take-over-sites/",
          "publishedOn": "2022-05-18T21:12:57.000Z",
          "wordCount": 1047,
          "title": "Critical Jupiter WordPress plugin flaws let hackers take over sites",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/02/11/WordPress_headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/national-bank-hit-by-ransomware-trolls-hackers-with-dick-pics/",
          "author": "Lawrence Abrams",
          "description": "After suffering a ransomware attack by the Hive operation, the Bank of Zambia made it clear that they were not going to pay by posting a picture of male genitalia and telling the hackers to s… (well, you can use your imagination). [...]",
          "link": "https://www.bleepingcomputer.com/news/security/national-bank-hit-by-ransomware-trolls-hackers-with-dick-pics/",
          "publishedOn": "2022-05-18T20:13:12.000Z",
          "wordCount": 1191,
          "title": "National bank hit by ransomware trolls hackers with dick pics",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/18/eggplant.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/us-recovers-15-million-from-global-kovter-ad-fraud-operation/",
          "author": "Lawrence Abrams",
          "description": "The US government has recovered over $15 million from Swiss bank accounts belonging to operators behind the '3ve' online advertising fraud scheme. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/us-recovers-15-million-from-global-kovter-ad-fraud-operation/",
          "publishedOn": "2022-05-18T18:37:51.000Z",
          "wordCount": 915,
          "title": "US recovers $15 million from global Kovter ad fraud operation",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/18/doj-money-blur.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/dhs-orders-federal-agencies-to-patch-vmware-bugs-within-5-days/",
          "author": "Sergiu Gatlan",
          "description": "The Department of Homeland Security's cybersecurity unit ordered Federal Civilian Executive Branch (FCEB) agencies today to urgently update or remove VMware products from their networks by Monday due to an increased risk of attacks. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/dhs-orders-federal-agencies-to-patch-vmware-bugs-within-5-days/",
          "publishedOn": "2022-05-18T17:38:57.000Z",
          "wordCount": 1045,
          "title": "DHS orders federal agencies to patch VMware bugs within 5 days",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/03/31/CISA_headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/chinese-space-pirates-are-hacking-russian-aerospace-firms/",
          "author": "Bill Toulas",
          "description": "A previously unknown Chinese hacking group known as 'Space Pirates' targets enterprises in the Russian aerospace industry with phishing emails to install novel malware on their systems. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/chinese-space-pirates-are-hacking-russian-aerospace-firms/",
          "publishedOn": "2022-05-18T16:51:46.000Z",
          "wordCount": 1281,
          "title": "Chinese ‘Space Pirates’ are hacking Russian aerospace firms",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/18/space-pirate.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/vmware-patches-critical-auth-bypass-flaw-in-multiple-products/",
          "author": "Sergiu Gatlan",
          "description": "VMware warned customers today to immediately patch a critical authentication bypass vulnerability \"affecting local domain users\" in multiple products that can be exploited to obtain admin privileges. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/vmware-patches-critical-auth-bypass-flaw-in-multiple-products/",
          "publishedOn": "2022-05-18T16:01:42.000Z",
          "wordCount": 1028,
          "title": "VMware patches critical auth bypass flaw in multiple products",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2021/09/22/VMware-headpic.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/cisa-shares-guidance-to-block-ongoing-f5-big-ip-attacks/",
          "author": "Sergiu Gatlan",
          "description": "In a joint advisory issued today, CISA and the Multi-State Information Sharing and Analysis Center (MS-ISAC) warned admins of active attacks targeting a critical F5 BIG-IP network security vulnerability (CVE-2022-1388). [...]",
          "link": "https://www.bleepingcomputer.com/news/security/cisa-shares-guidance-to-block-ongoing-f5-big-ip-attacks/",
          "publishedOn": "2022-05-18T15:20:56.000Z",
          "wordCount": 1082,
          "title": "CISA shares guidance to block ongoing F5 BIG-IP attacks",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/05/09/F5_loogo.jpg"
        },
        {
          "id": "https://www.bleepingcomputer.com/news/security/fake-crypto-sites-lure-wannabe-thieves-by-spamming-login-credentials/",
          "author": "Bill Toulas",
          "description": "Threat actors are luring potential thieves by spamming login credentials for other people account's on fake crypto trading sites, illustrating once again, that there is no honor among thieves. [...]",
          "link": "https://www.bleepingcomputer.com/news/security/fake-crypto-sites-lure-wannabe-thieves-by-spamming-login-credentials/",
          "publishedOn": "2022-05-18T14:54:14.000Z",
          "wordCount": 1333,
          "title": "Fake crypto sites lure wannabe thieves by spamming login credentials",
          "imageUrl": "https://www.bleepstatic.com/content/hl-images/2022/04/15/bitcoin-hacker.jpg"
        }
      ]
    },
    {
      "title": "gHacks Technology News",
      "feedUrl": "https://www.ghacks.net/feed/",
      "siteUrl": "https://www.ghacks.net",
      "articles": [
        {
          "id": "https://www.ghacks.net/?p=178672",
          "author": "Martin Brinkmann",
          "description": "The release version of Microsoft's Windows 11 operating system is now available for all compatible devices according to Microsoft. The designation for broad deployment is an important milestone, as it is used […]\nThank you for being a Ghacks reader. The post Windows 11 now available for all compatible devices according to Microsoft appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/19/windows-11-now-available-for-all-compatible-devices-according-to-microsoft/",
          "publishedOn": "2022-05-19T11:13:41.000Z",
          "wordCount": 1917,
          "title": "Windows 11 now available for all compatible devices according to Microsoft",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2021/10/pc-health-check-app-windows-10.png"
        },
        {
          "id": "https://www.ghacks.net/?p=178673",
          "author": "Martin Brinkmann",
          "description": "The Advanced Cyber Security Career Advancement Bundle is a comprehensive course bundle that includes 6 certification prep courses for industry standard certifications. Here is what is included: CISA Certification Gain expertise in […]\nThank you for being a Ghacks reader. The post Ghacks Deals: The Advanced Cyber Security Career Advancement Bundle appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/19/ghacks-deals-the-advanced-cyber-security-career-advancement-bundle-2/",
          "publishedOn": "2022-05-19T11:09:37.000Z",
          "wordCount": 1005,
          "title": "Ghacks Deals: The Advanced Cyber Security Career Advancement Bundle",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/sale_41732_primary_image.jpg"
        },
        {
          "id": "https://www.ghacks.net/?p=178667",
          "author": "Ashwin",
          "description": "Microsoft has released Windows 11 Insider Preview Build 25120 to users in the Dev Channel. It introduces a search bar on the desktop What's new in Windows 11 Insider Preview Build 25120 […]\nThank you for being a Ghacks reader. The post Windows 11 Insider Preview Build 25120 introduces a search bar on the desktop appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/19/windows-11-insider-preview-build-25120-brings-a-search-bar-widget-on-the-desktop/",
          "publishedOn": "2022-05-19T08:10:09.000Z",
          "wordCount": 1937,
          "title": "Windows 11 Insider Preview Build 25120 introduces a search bar on the desktop",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/Windows-11-Insider-Preview-Build-25120-introduces-a-search-bar-on-the-desktop.jpg"
        },
        {
          "id": "https://www.ghacks.net/?p=178664",
          "author": "Martin Brinkmann",
          "description": "Mozilla plans to introduce support for the extensions Manifest V3 in the organization's Firefox web browser in late 2022. Preview versions are already available in development editions of the web browser. While […]\nThank you for being a Ghacks reader. The post Mozilla expects to launch extensions Manifest V3 support in Firefox in late 2022 appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/19/mozilla-expects-to-launch-extensions-manifest-v3-support-in-firefox-in-late-2022/",
          "publishedOn": "2022-05-19T06:06:55.000Z",
          "wordCount": 2182,
          "title": "Mozilla expects to launch extensions Manifest V3 support in Firefox in late 2022",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/firefox-enable-manifest-v3.png"
        },
        {
          "id": "https://www.ghacks.net/?p=178657",
          "author": "Ashwin",
          "description": "Total Commander for Android no longer allows you to install APKs that you downloaded. The popular file manager boasts a cult following among the PC and Android users. Total Commander for Android […]\nThank you for being a Ghacks reader. The post Google forces Total Commander developer to remove the ability to install APKs on Android devices appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/19/google-forces-total-commander-removes-the-ability-to-install-apks/",
          "publishedOn": "2022-05-19T05:13:25.000Z",
          "wordCount": 1913,
          "title": "Google forces Total Commander developer to remove the ability to install APKs on Android devices",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/Google-forces-Total-Commander-developer-to-remove-the-ability-to-install-APKs-on-Android-devices.jpg"
        },
        {
          "id": "https://www.ghacks.net/?p=178656",
          "author": "Martin Brinkmann",
          "description": "The developer of the open source email client FairEmail pulled all of his applications from Google Play and announced that he would stop development. FairEmail was a popular email client for Google's […]\nThank you for being a Ghacks reader. The post FairEmail developer calls it quits and pulls apps from Google Play appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/19/fairemail-developer-calls-it-quits-and-pulls-apps-from-google-play/",
          "publishedOn": "2022-05-19T04:54:54.000Z",
          "wordCount": 1989,
          "title": "FairEmail developer calls it quits and pulls apps from Google Play",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/fairemail-google-android.png"
        },
        {
          "id": "https://www.ghacks.net/?p=178653",
          "author": "Martin Brinkmann",
          "description": "The open source email client Thunderbird will soon support multiple active spell checking dictionaries. Planned for Thunderbird 102, the feature enables users to have Thunderbird check for spelling mistakes using multiple dictionaries […]\nThank you for being a Ghacks reader. The post Thunderbird 102: support for multiple active spell checking dictionaries appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/18/thunderbird-102-support-for-multiple-active-spell-checking-dictionaries/",
          "publishedOn": "2022-05-18T17:15:05.000Z",
          "wordCount": 1343,
          "title": "Thunderbird 102: support for multiple active spell checking dictionaries",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/thunderbird-email-spell-checking.png"
        },
        {
          "id": "https://www.ghacks.net/?p=178639",
          "author": "Ashwin",
          "description": "Skiff Mail has been launched to the public, it is a new end-to-end encrypted email service provider. The company says that it focuses on protecting the privacy of its users. The service […]\nThank you for being a Ghacks reader. The post Skiff Mail is a new end-to-end encrypted email service, but should you use it? appeared first on gHacks Technology News.",
          "link": "https://www.ghacks.net/2022/05/18/skiff-mail-end-to-end-encrypted-email-privacy-policy/",
          "publishedOn": "2022-05-18T15:55:17.000Z",
          "wordCount": 2099,
          "title": "Skiff Mail is a new end-to-end encrypted email service, but should you use it?",
          "imageUrl": "https://www.ghacks.net/wp-content/uploads/2022/05/Skiff-Mail-is-a-new-end-to-end-encrypted-email-service-but-should-you-use-it.jpg"
        }
      ]
    },
    {
      "title": "Hongkiat",
      "feedUrl": "http://feeds2.feedburner.com/24thfloor",
      "siteUrl": "https://www.hongkiat.com/blog",
      "articles": [
        {
          "id": "https://www.hongkiat.com/blog/?p=59716",
          "author": "Kei Watanabe",
          "description": "Have you used any web highlighters? It helps us improve our productivity by copying and pasting important texts you've found online automatically, saving",
          "link": "https://www.hongkiat.com/blog/best-desktop-web-highlighters/",
          "publishedOn": "2022-05-18T15:01:24.000Z",
          "wordCount": 1959,
          "title": "10 Best Web Highlighters for Desktop in 2022",
          "imageUrl": "https://assets.hongkiat.com/uploads/best-desktop-web-highlighters/1-best-web-highlighters.jpg"
        }
      ]
    },
    {
      "title": "How-To Geek",
      "feedUrl": "https://www.howtogeek.com/feed/",
      "siteUrl": "https://www.howtogeek.com",
      "articles": [
        {
          "id": "https://www.howtogeek.com/?p=759449",
          "author": "Benj Edwards",
          "description": "Windows 11 ships with a simplified right-click context menu for File Explorer (and the desktop) that is different from the Windows 10 context menu. If you’d like to use the classic Windows 10 right-click menu instead, you can do so by modifying your registry with a few clicks. Here’s how.",
          "link": "https://www.howtogeek.com/759449/how-to-get-full-context-menus-in-windows-11s-file-explorer/",
          "publishedOn": "2022-05-19T21:00:00.000Z",
          "wordCount": 2447,
          "title": "How to Get the Old Context Menus Back in Windows 11",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/10/win11_classic_context_hero.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118510/should-you-buy-a-portable-power-station/",
          "author": "Cory Gunther",
          "description": "If you enjoy the great outdoors, camping, work on construction sites, or want to be prepared during a power outage, you should consider buying a portable power station. These lunch-box-sized power banks are highly useful, and here we’ll go over a few pros, cons, and why you’ll want one.",
          "link": "https://www.reviewgeek.com/118510/should-you-buy-a-portable-power-station/",
          "publishedOn": "2022-05-19T20:46:51.000Z",
          "wordCount": 3448,
          "title": "Should You Buy a Portable Power Station?",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/47746c4f.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=747327",
          "author": "Tim Brookes",
          "description": "If you have an old router lying around that you no longer need, you might be tempted to sell it or give it away. Fortunately, your old router is unlikely to give away any revealing information about you, but it’s a good idea to reset it before you ship it off.",
          "link": "https://www.howtogeek.com/747327/is-it-safe-to-sell-my-old-modem-or-router/",
          "publishedOn": "2022-05-19T20:00:00.000Z",
          "wordCount": 2362,
          "title": "Is It Safe to Sell My Old Modem or Router?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/08/wall-of-old-network-routers.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=806331",
          "author": "Corbin Davenport",
          "description": "WhatsApp is one of the most popular messaging services in the world, but its owner Meta (formerly Facebook) hasn’t quite figured out how to make buckets of money from it. Now the company has a new feature that might change that.",
          "link": "https://www.howtogeek.com/806331/heres-how-meta-will-make-money-from-your-whatsapp-account/",
          "publishedOn": "2022-05-19T19:00:18.000Z",
          "wordCount": 1951,
          "title": "Here’s How Meta Will Make Money From Your WhatsApp Account",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/10/whatsapp-hero.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=804003",
          "author": "Benj Edwards",
          "description": "If you’ve typed the wrong thing, deleted by mistake, or performed another accidental action in Windows, you’ll likely want to use Ctrl+Z at some point. Here’s what it does.",
          "link": "https://www.howtogeek.com/804003/what-does-the-ctrlz-keyboard-shortcut-do/",
          "publishedOn": "2022-05-19T19:00:13.000Z",
          "wordCount": 1945,
          "title": "What Does the Ctrl+Z Keyboard Shortcut Do?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/11/undo_windows_hero_2.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=804462",
          "author": "Benj Edwards",
          "description": "Bluetooth is great for connecting short-range wireless accessories to your iPhone or iPad. If you need to turn on (or turn off) Bluetooth on your iPhone or iPad, you can make a quick trip to Control Center or Settings. Here’s how.",
          "link": "https://www.howtogeek.com/804462/how-to-enable-or-disable-bluetooth-on-iphone-and-ipad/",
          "publishedOn": "2022-05-19T18:00:36.000Z",
          "wordCount": 2074,
          "title": "How to Enable or Disable Bluetooth on iPhone and iPad",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/bluetooth_apple_hero_2.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.lifesavvy.com/129790/are-cookware-sets-worth-your-hard-earned-cash/",
          "author": "Shea Simmons",
          "description": "If you’ve been browsing cookware, you’ve seen all kinds of sets, from minimalist stainless-steel pots and pans to colorfully enameled cast iron. But do you really need to spring for the whole set at once?",
          "link": "https://www.lifesavvy.com/129790/are-cookware-sets-worth-your-hard-earned-cash/",
          "publishedOn": "2022-05-19T18:00:29.000Z",
          "wordCount": 719,
          "title": "Are Cookware Sets Worth Your Hard-Earned Cash?",
          "imageUrl": "https://www.lifesavvy.com/p/uploads/2022/03/4df96fbd.jpg"
        },
        {
          "id": "https://www.reviewgeek.com/118501/the-latest-lego-set-turns-starry-night-into-3d-brick-art/",
          "author": "Andrew Heinzman",
          "description": "One of the most impressive LEGO Ideas candidates is now coming to life. Designed by Truman Cheng, the LEGO Starry Night set turns Van Gogh’s classic painting into a piece of 3D brick art. If you thought Starry Night was trippy, wait until you see it with depth!",
          "link": "https://www.reviewgeek.com/118501/the-latest-lego-set-turns-starry-night-into-3d-brick-art/",
          "publishedOn": "2022-05-19T17:21:03.000Z",
          "wordCount": 2381,
          "title": "The Latest LEGO Set Turns 'Starry Night' Into 3D Brick Art",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/d66fa050.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=804712",
          "author": "Joe Fedewa",
          "description": "Kindles can hold a lot of eBooks, but you may want to remove some. eBooks are stored in two places—on the eReader itself and your Kindle Library. We’ll show you how to remove books from both places.",
          "link": "https://www.howtogeek.com/804712/how-to-remove-books-from-a-kindle/",
          "publishedOn": "2022-05-19T17:00:00.000Z",
          "wordCount": 2108,
          "title": "How to Remove Books From a Kindle",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2018/07/amazon-kindle-on-a-pile-of-books.jpeg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118502/sonys-new-linkbuds-s-want-to-link-your-digital-life-and-reality/",
          "author": "Suzanne Humphries",
          "description": "Sony has officially announced its latest pair of earbuds—the LinkBuds S. These new buds look to be an interesting halfway point between the company’s initial version of the LinkBuds and its well-loved WF-1000XM4s for a variety of reasons. And they’re available for pre-order today.",
          "link": "https://www.reviewgeek.com/118502/sonys-new-linkbuds-s-want-to-link-your-digital-life-and-reality/",
          "publishedOn": "2022-05-19T16:42:14.000Z",
          "wordCount": 2695,
          "title": "Sony's New LinkBuds S Want to \"Link\" Your Digital Life and Reality",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/42fd32d0.png"
        },
        {
          "id": "https://www.reviewgeek.com/118478/tesla-explains-why-your-dash-cam-and-sentry-mode-are-broken/",
          "author": "Cory Gunther",
          "description": "If your Tesla dash cam or sentry mode recently stopped working, you’re not alone. Lately, several reports have emerged that users are experiencing problems with their cameras, and Tesla is aware of the problem and working on a fix.",
          "link": "https://www.reviewgeek.com/118478/tesla-explains-why-your-dash-cam-and-sentry-mode-are-broken/",
          "publishedOn": "2022-05-19T16:35:21.000Z",
          "wordCount": 2455,
          "title": "Tesla Explains Why Your Dash Cam and Sentry Mode Are Broken",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/02/f443ade2.jpg"
        },
        {
          "id": "https://www.reviewgeek.com/118475/worldle-is-the-wordle-that-proves-you-suck-at-geography/",
          "author": "Andrew Heinzman",
          "description": "You’ve played Wordle, but have you ever heard of Worldle? Confusing names, I know, but Worldle is a daily guessing game that focuses on countries, not words. And unless you’re a geography genius, it will make you question all those years you spent in school.",
          "link": "https://www.reviewgeek.com/118475/worldle-is-the-wordle-that-proves-you-suck-at-geography/",
          "publishedOn": "2022-05-19T16:16:46.000Z",
          "wordCount": 2332,
          "title": "'Worldle' Is The 'Wordle' That Proves You Suck at Geography",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/776273f8.png"
        },
        {
          "id": "https://www.lifesavvy.com/129781/are-red-and-white-wine-vinegar-interchangeable-in-recipes/",
          "author": "Shea Simmons",
          "description": "Cooking isn’t an exact science. Even home chefs often make substitutions in a pinch or amp up flavors with additional spices. But when it comes to salad dressings and marinades, can you substitute red wine vinegar for white, or vice versa?",
          "link": "https://www.lifesavvy.com/129781/are-red-and-white-wine-vinegar-interchangeable-in-recipes/",
          "publishedOn": "2022-05-19T16:00:48.000Z",
          "wordCount": 818,
          "title": "Are Red and White Wine Vinegar Interchangeable in Recipes?",
          "imageUrl": "https://www.lifesavvy.com/p/uploads/2022/05/c1349bff.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=804159",
          "author": "Tim Brookes",
          "description": "Apple AirPods are perfect when paired with an iPhone, but what if you have an Android smartphone or tablet? The good news is that all models of AirPods deliver basic functionality, but you will miss out on a few nice-to-have features.",
          "link": "https://www.howtogeek.com/804159/do-airpods-work-with-android/",
          "publishedOn": "2022-05-19T16:00:30.000Z",
          "wordCount": 2957,
          "title": "Do AirPods Work With Android?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/08/apple-airpod-woman-ear.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118467/frameworks-second-laptop-continues-the-promise-of-modularity/",
          "author": "Andrew Heinzman",
          "description": "Framework’s modular laptop was an instant success when it launched in 2021, garnering praise from iFixit and the Right to Repair community as a whole. Now, Framework is continuing its promise of modularity with a second-gen laptop, and more importantly, an upgrade path for first-gen customers.",
          "link": "https://www.reviewgeek.com/118467/frameworks-second-laptop-continues-the-promise-of-modularity/",
          "publishedOn": "2022-05-19T15:21:53.000Z",
          "wordCount": 2402,
          "title": "Framework's Second Laptop Continues the Promise of Modularity",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/9dfdf491.png"
        },
        {
          "id": "https://www.reviewgeek.com/118469/ford-delays-an-f-150-lightning-launch-feature/",
          "author": "Cory Gunther",
          "description": "The exciting new Ford F-150 Lightning EV is finally shipping to buyers, but it looks like one of the many promised features won’t be available, at least not yet. We’re talking about “Phone as a key,” which lets owners open and use the vehicle without the keyfob.",
          "link": "https://www.reviewgeek.com/118469/ford-delays-an-f-150-lightning-launch-feature/",
          "publishedOn": "2022-05-19T15:21:03.000Z",
          "wordCount": 2418,
          "title": "Ford Delays an F-150 Lightning Launch Feature",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/02/6b06cf0b.jpg"
        },
        {
          "id": "http://www.howtogeek.com/?p=198052",
          "author": "Martin Hendrikx",
          "description": "When you are working with spreadsheets in Microsoft Excel and accidentally copy rows, or if you are making a composite spreadsheet of several others, you will encounter duplicate rows which you need to delete. This can be a very mindless, repetitive, time-consuming task, but there are several tricks that make it simpler.",
          "link": "https://www.howtogeek.com/198052/how-to-remove-duplicate-rows-in-excel/",
          "publishedOn": "2022-05-19T15:00:00.000Z",
          "wordCount": 2737,
          "title": "How to Remove Duplicate Rows in Excel",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/microsoft_excel_hero_1200x675.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=806242",
          "author": "Corbin Davenport",
          "description": "Windows XP and Windows Vista both supported adding “gadgets” to the desktop, like a clock or calendar. It looks like that functionality might make a return for Windows 11.",
          "link": "https://www.howtogeek.com/806242/gadgets-are-back-windows-11-is-testing-desktop-widgets/",
          "publishedOn": "2022-05-19T14:42:27.000Z",
          "wordCount": 1949,
          "title": "Gadgets Are Back: Windows 11 Is Testing Desktop Widgets",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/Windows-11-logo.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/117481/keychron-q3-qmk-mechanical-keyboard-review/",
          "author": "Marcus Mears III",
          "description": "Keychron’s tenkeyless Q3 QMK keyboard features a sturdy CNC aluminum frame, hot-swappable switches, velvety keystrokes, and a full range of customization options. Beginners and enthusiasts, Mac and Windows users alike, this keyboard is for you.",
          "link": "https://www.reviewgeek.com/117481/keychron-q3-qmk-mechanical-keyboard-review/",
          "publishedOn": "2022-05-19T14:24:41.000Z",
          "wordCount": 4145,
          "title": "Keychron Q3 QMK Mechanical Keyboard Review: Just Your Type",
          "imageUrl": "https://www.reviewgeek.com/p-badge/118334/d2963fd0f2a591ba43dc904061116b3e.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=739984",
          "author": "Elizabeth Henges",
          "description": "You could replace your keyboard with almost any keyboard, and it’ll work. But it’d be better to splurge a little on a nice keyboard that’ll make your everyday typing experience that much better. Here are our best keyboard picks!",
          "link": "https://www.howtogeek.com/739984/best-keyboard/",
          "publishedOn": "2022-05-19T14:00:00.000Z",
          "wordCount": 5615,
          "title": "The Best Keyboards of 2022",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/07/best-keyboards-header.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.lifesavvy.com/128401/nocturne-firefly-outdoor-solar-lamp-review/",
          "author": "Justin Duino",
          "description": "The Nocturne Firefly is one of the most modern-looking and stylish outdoor solar floor lamps I’ve ever used. Unfortunately, despite the Firefly working flawlessly, it’s hard to recommend to everyone because of the missing features and niceties found in much cheaper outdoor floor lamps.",
          "link": "https://www.lifesavvy.com/128401/nocturne-firefly-outdoor-solar-lamp-review/",
          "publishedOn": "2022-05-19T13:30:35.000Z",
          "wordCount": 1826,
          "title": "Nocturne Firefly Outdoor Solar Lamp Review: Pricey, But Sufficiently Bright",
          "imageUrl": "https://www.lifesavvy.com/p/uploads/2022/05/7e5660c1.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=805461",
          "author": "Josh Bell",
          "description": "Tom Cruise has had one of Hollywood’s most varied and exciting careers, from his days as a teen idol to his award-winning dramatic turns to his larger-than-life action-hero roles. Here are 10 of the best Tom Cruise movies to stream.",
          "link": "https://www.howtogeek.com/805461/best-tom-cruise-movies-to-stream/",
          "publishedOn": "2022-05-19T13:00:29.000Z",
          "wordCount": 3232,
          "title": "The 10 Best Tom Cruise Movies to Stream in 2022",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/tom-cruise.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118027/the-best-vhs-to-digital-conversion-kits/",
          "author": "Danny Chadwick",
          "description": "Your aging videotapes are beyond obsolete at this point. Manufacturers haven’t even made VCRs since 2016. You can still buy tape players online, but they’re getting harder to find and more expensive as supplies dwindle. So, now is the time to convert the content on your tapes to a digital format.",
          "link": "https://www.reviewgeek.com/118027/the-best-vhs-to-digital-conversion-kits/",
          "publishedOn": "2022-05-19T13:00:16.000Z",
          "wordCount": 3761,
          "title": "The Best VHS to Digital Conversion Kits",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/4a9d58ce.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=801956",
          "author": "Sydney Butler",
          "description": "Console wars have been around for as long as people could choose between more than one system, but why do they exist in the first place? It turns out that console wars are just an expression of broader human nature.",
          "link": "https://www.howtogeek.com/801956/the-psychology-of-console-wars-and-why-they-wont-go-away/",
          "publishedOn": "2022-05-19T12:00:46.000Z",
          "wordCount": 2875,
          "title": "The Psychology of Console Wars (And Why They Won’t Go Away)",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/04/gamer-shouting-controller.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=802892",
          "author": "Jason Fitzpatrick",
          "description": "There are a surprising number of things in your home—from the type of material your walls are made of to the kind of things you decorate your home with—that can degrade your Wi-Fi signal.",
          "link": "https://www.howtogeek.com/802892/things-blocking-your-wi-fi-signal-at-home/",
          "publishedOn": "2022-05-19T11:00:26.000Z",
          "wordCount": 3267,
          "title": "10 Things Blocking Your Wi-Fi Signal at Home",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/WiFiBlocking1.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=759882",
          "author": "Benj Edwards",
          "description": "As of October 2021, Windows 11 doesn’t let you move your taskbar to the top of the screen with an official setting (unlike Windows 10). But we’ve figured out a way to make it happen by editing the Registry—and you can do it with just a few clicks. Here’s how.",
          "link": "https://www.howtogeek.com/759882/how-to-move-windows-11s-taskbar-to-the-top-of-the-screen/",
          "publishedOn": "2022-05-18T21:00:00.000Z",
          "wordCount": 2668,
          "title": "How to Move Windows 11’s Taskbar to the Top of the Screen",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/10/win11_taskbar_on_top_hero.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=806088",
          "author": "Corbin Davenport",
          "description": "Chrome has offered the ability to “install” web apps to your computer for a while now, and the feature is also available on the new Chromium-based Microsoft Edge. Now the Edge browser has an easier way to manage web apps, with more improvements on the way.",
          "link": "https://www.howtogeek.com/806088/microsoft-edge-is-improving-your-installed-web-apps/",
          "publishedOn": "2022-05-18T20:02:08.000Z",
          "wordCount": 2016,
          "title": "Microsoft Edge Is Improving Your Installed Web Apps",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/08/Microsoft-Edge-Hide-or-Show-Extensions-on-Toolbar.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=753127",
          "author": "Tim Brookes",
          "description": "While most of us rely on wireless at home, wired internet is often a better choice. The only catch is that most home routers only have a handful of ports. Adding more ports is easy, but there are a few things to consider when setting things up.",
          "link": "https://www.howtogeek.com/753127/how-to-add-more-ethernet-ports-to-your-router/",
          "publishedOn": "2022-05-18T20:00:00.000Z",
          "wordCount": 3201,
          "title": "How to Add More Ethernet Ports to Your Router",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/11/connected-ethernet-cables.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=805060",
          "author": "Joe Fedewa",
          "description": "iOS 15 and iPadOS 15 introduced a feature called “Microphone Mode” that can be used during FaceTime calls. You can choose from different modes to make yourself sound better to whoever you’re talking to. We’ll show you how easy it is to use.",
          "link": "https://www.howtogeek.com/805060/how-to-improve-facetime-audio-with-mic-modes/",
          "publishedOn": "2022-05-18T19:00:45.000Z",
          "wordCount": 1897,
          "title": "How to Improve FaceTime Audio With Mic Modes",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/09/FaceTime-logo.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=806063",
          "author": "Corbin Davenport",
          "description": "Google Chrome 88 introduced the Manifest V3 API for extensions, which changes how extensions work in the browser. Mozilla has now outlined its plans for integrating those changes into Firefox.",
          "link": "https://www.howtogeek.com/806063/mozilla-says-how-firefox-extensions-will-keep-up-with-chrome/",
          "publishedOn": "2022-05-18T18:40:05.000Z",
          "wordCount": 1960,
          "title": "Mozilla Says How Firefox Extensions Will Keep Up With Chrome",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/02/chromeandfirefox.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=805971",
          "author": "Corbin Davenport",
          "description": "ProtonVPN and ProtonMail are two of the most popular privacy tools online, and the company behind them has been working to unify the two products. The pricing is also changing slightly.",
          "link": "https://www.howtogeek.com/805971/protonvpn-protonmail-get-new-features-and-higher-prices/",
          "publishedOn": "2022-05-18T18:35:39.000Z",
          "wordCount": 1895,
          "title": "ProtonVPN & ProtonMail Get New Features (and Higher Prices)",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/ProtonVPN-featured-image.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118367/acer-bets-that-gamers-will-sacrifice-fps-for-glasses-free-3d/",
          "author": "Andrew Heinzman",
          "description": "The trend that nobody asked for is back. At least, that’s what Acer is betting on with its newest gaming laptops and monitors. Using advanced “SpatialLabs” technology, these new devices automatically convert 2D content into glasses-free 3D. But the immersion offered by this feature comes at a price.",
          "link": "https://www.reviewgeek.com/118367/acer-bets-that-gamers-will-sacrifice-fps-for-glasses-free-3d/",
          "publishedOn": "2022-05-18T18:16:03.000Z",
          "wordCount": 2497,
          "title": "Acer Bets That Gamers Will Sacrifice FPS for Glasses-Free 3D",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/60587b40.png"
        },
        {
          "id": "https://www.lifesavvy.com/129615/this-condiment-could-be-the-secret-to-perfectly-grilled-meat/",
          "author": "Shea Simmons",
          "description": "We can’t all be grill masters, but we can hack our way to delicious meals. One of the easiest ways for grilling novices to make juicy, flavorful meat might already be in your fridge.",
          "link": "https://www.lifesavvy.com/129615/this-condiment-could-be-the-secret-to-perfectly-grilled-meat/",
          "publishedOn": "2022-05-18T18:00:33.000Z",
          "wordCount": 673,
          "title": "This Condiment Could Be the Secret to Perfectly Grilled Meat",
          "imageUrl": "https://www.lifesavvy.com/p/uploads/2021/05/0e9243c6.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=805424",
          "author": "RJ Fulton",
          "description": "One of the simplest ways to buy Bitcoin is by using the Strike mobile app. Thanks to its use of the Lightning Network, Bitcoin purchases on Strike have a much lower transaction cost. Here’s how to use it.",
          "link": "https://www.howtogeek.com/805424/how-to-buy-bitcoin-with-the-strike-mobile-app/",
          "publishedOn": "2022-05-18T18:00:17.000Z",
          "wordCount": 2141,
          "title": "How to Buy Bitcoin With the Strike Mobile App",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/shutterstock_792061711.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=805942",
          "author": "Tim Brookes",
          "description": "Wondering where all your iPhone (or iPad) free space has gone? If you use Apple’s Podcasts app and have active subscriptions, it’s possible that your device has been downloading and holding onto episodes. Here’s how to check, and how to make sure it doesn’t happen in the future.",
          "link": "https://www.howtogeek.com/805942/iphone-podcasts-free-space/",
          "publishedOn": "2022-05-18T17:00:12.000Z",
          "wordCount": 2137,
          "title": "Are Podcasts Hogging All Your iPhone Free Space?",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/iphone-in-hand.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=806008",
          "author": "Zach Laidlaw",
          "description": "Welcome back to another edition of How-To Geek Deals, the weekly series where we serve up the best discounts on the coolest gadgets known to humankind. This week, we’re shining a spotlight on Roborock’s newest pair of robot vacuums, plus the Chromecast with Google TV, one of our favorite Samsung SD cards of the year, and so much more. Let’s dive in!",
          "link": "https://www.howtogeek.com/806008/htg-deals-save-on-roborock-vacuums-chromecasts-sd-cards-and-more/",
          "publishedOn": "2022-05-18T17:00:07.000Z",
          "wordCount": 2483,
          "title": "HTG Deals: Save on Roborock Vacuums, Chromecasts, SD Cards, and More",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/How-To-Geek-Deals-051822.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118317/next-gen-mercedes-benz-battery-tech-could-take-evs-further/",
          "author": "Cory Gunther",
          "description": "This week Mercedes-Benz announced that its partnership with Sila Nanotechnologies, a battery materials company, is about to pay off. That’s because Sila’s next-generation lithium-silicon battery technology is ready for primetime.",
          "link": "https://www.reviewgeek.com/118317/next-gen-mercedes-benz-battery-tech-could-take-evs-further/",
          "publishedOn": "2022-05-18T16:51:07.000Z",
          "wordCount": 2379,
          "title": "Next-Gen Mercedes-Benz Battery Tech Could Take EVs Further",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/5c4c0891.jpg"
        },
        {
          "id": "https://www.reviewgeek.com/118309/a-weird-rum-microsite-appeared-on-roku-and-no-one-knows-why/",
          "author": "Andrew Heinzman",
          "description": "Several Roku customers have opened support posts and Reddit threads asking why an app called “RUM” appeared on their home screen. This app is unremovable and doesn’t seem to do anything. Even weirder, Roku won’t explain what it is.",
          "link": "https://www.reviewgeek.com/118309/a-weird-rum-microsite-appeared-on-roku-and-no-one-knows-why/",
          "publishedOn": "2022-05-18T16:33:33.000Z",
          "wordCount": 2518,
          "title": "A Weird \"RUM\" Microsite Appeared on Roku and No One Knows Why",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/82e77dad.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=805687",
          "author": "Tim Brookes",
          "description": "It feels like an age since the original Wii Sports launched alongside Nintendo’s 2006 console release, but the franchise finally has a spiritual successor on the Switch. The good news is that Switch Sports ticks all the boxes for those who still hold a candle for the original.",
          "link": "https://www.howtogeek.com/805687/switch-sports-is-an-upgraded-wii-sports-for-nintendo-switch/",
          "publishedOn": "2022-05-18T16:00:29.000Z",
          "wordCount": 2337,
          "title": "Switch Sports Is an Upgraded Wii Sports for Nintendo Switch",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/switch_sports_featured.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=798968",
          "author": "Sponsored",
          "description": "Working from home has become wildly popular over the past few years, but it has also introduced us to challenges we hadn’t considered. Pets, projects around the house, random distractions on the internet — all serve to deter focus and hamper productivity. Can a suite of work-focused apps help you get back on track? We’ll discuss how to stay productive while working from home with Setapp, a popular subscription service with more than 200 incredible apps for Mac.",
          "link": "https://www.howtogeek.com/798968/working-from-home-boost-your-productivity-with-setapp-for-mac/",
          "publishedOn": "2022-05-18T15:55:00.000Z",
          "wordCount": 2359,
          "title": "This Mac App Is Great for People With Short Attention Spans",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/person-using-macbook-coffee.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118311/amazon-finally-updates-its-fire-7-tablet/",
          "author": "Suzanne Humphries",
          "description": "Amazon has finally updated its popular Fire 7 and Fire 7 Kids tablets, and wow, what a fantastic upgrade it is! Both tablets got a full suite of new hardware upgrades, improved battery life, smoother performance, and, best of all—they both have USB-C ports now.",
          "link": "https://www.reviewgeek.com/118311/amazon-finally-updates-its-fire-7-tablet/",
          "publishedOn": "2022-05-18T15:43:01.000Z",
          "wordCount": 2540,
          "title": "Amazon Finally Updates Its Fire 7 Tablet Adding a Much-Needed Feature",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/93fb3430.png"
        },
        {
          "id": "https://www.reviewgeek.com/118301/garmins-latest-cycling-accessory-combines-three-products-into-one/",
          "author": "Cory Gunther",
          "description": "Today, Garmin announced a new 3-in-1 Varia radar system to help keep cyclists and bikers safe on the road. The Garmin Varia RCT715 is a radar-activated tail light with a built-in camera that’ll watch your back.",
          "link": "https://www.reviewgeek.com/118301/garmins-latest-cycling-accessory-combines-three-products-into-one/",
          "publishedOn": "2022-05-18T15:24:56.000Z",
          "wordCount": 2473,
          "title": "Garmin's Latest Cycling Accessory Combines Three Products Into One",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/03f4dec3.png"
        },
        {
          "id": "https://www.reviewgeek.com/118294/samsung-smartthings-is-the-first-testing-ground-for-matter/",
          "author": "Andrew Heinzman",
          "description": "After an endless barrage of delays, Matter is finally coming together. The new standard promises to unify smart home products, allowing devices to work together regardless of their branding or smart assistant compatibility. And now, smart home companies can test Matter using Samsung’s SmartThings platform.",
          "link": "https://www.reviewgeek.com/118294/samsung-smartthings-is-the-first-testing-ground-for-matter/",
          "publishedOn": "2022-05-18T15:15:13.000Z",
          "wordCount": 2432,
          "title": "Samsung SmartThings Is the First Testing Ground for Matter",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/1631dd5e.png"
        },
        {
          "id": "https://www.howtogeek.com/?p=803167",
          "author": "Mahesh Makvana",
          "description": "Using Microsoft Excel’s sorting feature, you can sort your cells that are either manually colored or conditionally colored by their color. This works for multiple colors and we’ll show you how to implement it in your spreadsheets.",
          "link": "https://www.howtogeek.com/803167/excel-sort-by-color/",
          "publishedOn": "2022-05-18T15:00:36.000Z",
          "wordCount": 2088,
          "title": "How to Sort by Color in Microsoft Excel",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2021/05/MS-excel-logo-675.png?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.reviewgeek.com/118240/google-took-my-money-and-canceled-my-nest-service/",
          "author": "Josh Hendrickson",
          "description": "I’ve recommended the Nest Video Doorbell for years as the best premium option for smart doorbells. But that recommendation does require subscribing to Nest Aware to get the best features, and now I’m left considering abandoning Nest altogether after Google took my money and canceled my service.",
          "link": "https://www.reviewgeek.com/118240/google-took-my-money-and-canceled-my-nest-service/",
          "publishedOn": "2022-05-18T14:24:15.000Z",
          "wordCount": 3928,
          "title": "Google Took My Money and Canceled My Nest Service",
          "imageUrl": "https://www.reviewgeek.com/p/uploads/2022/05/9e4feba5.jpg"
        },
        {
          "id": "https://www.howtogeek.com/?p=805914",
          "author": "Corbin Davenport",
          "description": "Microsoft has been working on a new desktop Outlook application for a while now, and the company started testing it with work and education accounts earlier this month. Now it’s rolling out more widely for Office Insiders.",
          "link": "https://www.howtogeek.com/805914/microsofts-new-outlook-for-windows-is-missing-many-features/",
          "publishedOn": "2022-05-18T14:04:35.000Z",
          "wordCount": 2129,
          "title": "Microsoft’s New Outlook for Windows Is Missing Many Features",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/05/Outlook-new-featured-image.jpg?height=200p&trim=2,2,2,2"
        },
        {
          "id": "https://www.howtogeek.com/?p=796113",
          "author": "Jon Bitner",
          "description": "Ergonomics mice come in a variety of shapes, sizes, and price tags. Whether you’re looking for a vertical layout, trackball design, or lightweight product, here are six of the best ergonomic mice currently on the market.",
          "link": "https://www.howtogeek.com/796113/best-ergonomic-mouse/",
          "publishedOn": "2022-05-18T14:00:05.000Z",
          "wordCount": 4273,
          "title": "The Best Ergonomic Mice of 2022",
          "imageUrl": "https://www.howtogeek.com/wp-content/uploads/2022/04/Ergonomic-Mouse-Header.jpg?height=200p&trim=2,2,2,2"
        }
      ]
    },
    {
      "title": "IlSoftware.it",
      "feedUrl": "https://www.ilsoftware.it/rss.asp",
      "siteUrl": "https://www.ilsoftware.it",
      "articles": [
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=VMware-CISA-invita-a-installare-subito-gli-aggiornamenti-di-sicurezza_24538",
          "author": null,
          "description": "CISA (Cybersecurity and Infrastructure Security Agency), l'agenzia federale degli Stati Uniti che si occupa di sicurezza informatica e protezione delle infrastrutture critiche ha pubblicato un avviso ufficiale esortando i soggetti che utilizzano le soluzioni per la virtualizzazione VMware a installare immediatamente le patch di sicurezza rilasciate dal produttore.Viene rivelato che un gruppo di aggressori, alcuni palesamente sovvenzionati da enti governativi, stanno attivamente sfruttando due vulnerabilità non correlate presenti nei prodotti VMware. In termini di gravità, entrambe sono valutate con un punteggio di 9,8 su un massimo di 10 e possono essere sfruttate per aggredire reti aziendali, attivare backdoor, botnet e altre forme di malware.Il 6 aprile scorso VMware ha rivelato e corretto una vulnerabilità legata all'esecuzione di codice in modalità remota (CVE-2022-22954) e un bug che può facilitare l'acquisizione di privilegi più elevati (CVE-2022-22960).Stando a quanto conferma CISA, gli aggressori sono stati in grado di effettuare il reverse engineering delle patch ufficiali VMware in sole 48 ore iniziando rapidamente a sfruttare le vulnerabilità.Secondo i report condivisi da alcune tra le principali aziende che offrono strumenti per la sicurezza informatica, gli attaccanti sono in grado di concatenare le vulnerabilità di VMware per causare danni e sottrarre dati riservati.Nel caso di un'azienda attaccata intorno a metà aprile con un'iniziativa mirata, gli utenti malintenzionati hanno prima sfruttato CVE-2022-22954 per eseguire un comando shell arbitrario come utente VMware.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=VMware-CISA-invita-a-installare-subito-gli-aggiornamenti-di-sicurezza_24538",
          "publishedOn": "2022-05-19T17:01:00.000Z",
          "wordCount": null,
          "title": "VMware: CISA invita a installare subito gli aggiornamenti di sicurezza",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Scrivere-sulle-foto-quali-applicazioni-usare_24537",
          "author": null,
          "description": "Le principali app di messaggistica integrano uno strumento di base per modificare le foto con la possibilità di aggiungere testi, disegni ed etichette: WhatsApp, Facebook Messenger e Instagram, ad esempio, offrono questa possibilità.Le foto così elaborate possono anche essere scaricate e salvate sotto forma di file d'immagine.Se si stesse cercando un'applicazione di taglio un po’ più professionale per scrivere sulle foto ma allo stesso tempo gratuita, in questo articolo vi presentiamo alcune soluzioni pronte per l'uso. Alcune di esse sono utilizzabili su Android e iOS, altre - come ad esempio Canva anche da browser Web.Di applicazioni per scrivere sulle foto ne esistono tante ma è bene tenere presente che quelle di taglio professionale, sono a pagamento. In molti casi ci si trova dinanzi a prodotti freemium che permettono di accedere a funzioni evolute soltanto versando un canone di abbonamento.Certe applicazioni non consentono di esportare o scaricare i progetti realizzati o se lo fanno riducono il valore dei punti per pollice o DPI sotto 100.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Scrivere-sulle-foto-quali-applicazioni-usare_24537",
          "publishedOn": "2022-05-19T15:49:00.000Z",
          "wordCount": null,
          "title": "Scrivere sulle foto: quali applicazioni usare",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Proteggere-Active-Directory-una-necessita-sempre-piu-pressante_24536",
          "author": null,
          "description": "La maggior parte delle aziende si serve di Microsoft Active Directory (AD) per le proprie attività. Si tratta di uno strumento che mette in collegamento il personale dell'impresa con le risorse presenti sulla rete aziendale, come le email o le condivisioni di file. Viene inoltre utilizzato dagli amministratori per gestire i privilegi degli account, autenticare gli utenti all'accesso e determinare le risorse accessibili per ciascuno di essi.Abbiamo già visto, ad esempio, come configurare un controller di dominio Active Directory: i vantaggi sono molteplici perché si tratta di uno strumento software affidabile, versatile e sul mercato ormai da tanti anni.Eccezion fatta per le versioni di anteprima, Active Directory è sulla piazza ormai dal 2000: in precedenza i servizi di directory IT che Microsoft forniva non erano abbastanza scalabili per soddisfare le esigenze delle medie e delle grandi imprese.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Proteggere-Active-Directory-una-necessita-sempre-piu-pressante_24536",
          "publishedOn": "2022-05-19T12:53:00.000Z",
          "wordCount": null,
          "title": "Proteggere Active Directory: una necessità sempre più pressante",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Android-Google-vuole-combattere-il-sideloading-o-incomprensione-con-Total-Commander_24535",
          "author": null,
          "description": "Uno dei file manager più apprezzati in ambiente Windows e, da anni, anche su Android, è Total Commander. L'app vanta più di 10 milioni di download sul Play Store ed è uno strumento universalmente noto e apprezzato.Eppure lo sviluppatore di Total Commander, Christian Ghisler, ha recentemente ricevuto un avviso da parte di Google che lo intimava a modificare il comportamento della sua app, pena la rimozione dal Play Store e la sospensione dell'account: 'un'applicazione distribuita tramite Google Play Store non può essere modificata, sostituita o aggiornata con alcun metodo diverso dal meccanismo di aggiornamento del Play Store stesso. Inoltre un'app non è autorizzata a scaricare codice eseguibile da un'origine diversa dal Play Store', si legge nella notifica trasmessa a Ghisler dall'azienda di Mountain View.Che un'app Android non possa scaricare codice eseguibile da sorgenti che non siano il Play Store è risaputo da tempo.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Android-Google-vuole-combattere-il-sideloading-o-incomprensione-con-Total-Commander_24535",
          "publishedOn": "2022-05-19T10:46:00.000Z",
          "wordCount": null,
          "title": "Android: Google vuole combattere il sideloading o incomprensione con Total Commander?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Windows-11-come-disattivare-la-schermata-Completiamo-la-configurazione-del-tuo-dispositivo_24534",
          "author": null,
          "description": "Fanno parte della procedura chiamata OOBE (Out of Box Experience) le schermate che Windows propone nell'ultima fase dell'installazione del sistema operativo: i vari avvisi chiedono all'utente di impostare lingua e layout di tastiera, indicare l'uso che si farà del PC (personale o all'interno di un'organizzazione), collegarsi a una rete, configurare un account accedendo preferibilmente con un utente Microsoft (Windows 11 si può installare con un account locale), specificare quali dati vengono condivisi con Microsoft, condividere o meno la propria posizione, migliorare l'input della penna digitale e della digitazione, ottenere esperienze personalizzate e molto altro ancora.Sia in Windows 10 che in Windows 11 capita spesso che dopo il riavvio del sistema o una disconnessione e un successivo l…",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Windows-11-come-disattivare-la-schermata-Completiamo-la-configurazione-del-tuo-dispositivo_24534",
          "publishedOn": "2022-05-19T10:05:00.000Z",
          "wordCount": null,
          "title": "Windows 11, come disattivare la schermata Completiamo la configurazione del tuo dispositivo",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Velocizzare-Windows-11-e-ottimizzare-il-sistema_24016",
          "author": null,
          "description": "Come avevamo già visto nel caso di Windows 10, anche Windows 11 viene installato per impostazione predefinita utilizzando una serie di impostazioni che potrebbero non soddisfare l'utente, essere considerate inutili o addirittura fastidiose.In un altro articolo abbiamo spiegato come eseguire un'installazione personalizzata di Windows 11 in modalità unattended ovvero non presidiata: l'installazione di Windows 11 diventa così più veloce ed è possibile richiedere l'applicazione di una serie di modifiche che permettono di ottimizzare e velocizzare il sistema operativo.Abbiamo anche visto come far installare da solo Windows 11 con i programmi più utili personalizzando il contenuto del file ISO ufficiale.Se nel caso di un'installazione unattended di Windows la procedura di setup non pone alcuna d…",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Velocizzare-Windows-11-e-ottimizzare-il-sistema_24016",
          "publishedOn": "2022-05-19T09:12:00.000Z",
          "wordCount": null,
          "title": "Velocizzare Windows 11 e ottimizzare il sistema",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Microsoft-consiglia-Windows-11-per-il-tuo-dispositivo-come-rimuovere-la-schermata_24533",
          "author": null,
          "description": "Sui sistemi Windows 10 che soddisfano i requisiti per l'installazione di Windows 11 prima o poi capita di vedere il messaggio 'Microsoft consiglia Windows 11 per il tuo dispositivo' dopo un riavvio o comunque al momento del login con un account utente configurato sulla macchina.La schermata compare anche se nella sezione Sistema, Notifiche e azioni delle impostazioni di Windows 10 (Windows+I) entrambe le caselle Suggerisci i modi per completare la configurazione del dispositivo per ottenere il massimo da Windows e Ottieni suggerimenti durante l'uso di Windows fossero state entrambe disabilitate.\n\nPer evitare che venga avviato l'aggiornamento di Windows 10 a Windows 11 basta premere Rifiuta l'aggiornamento e Ignora per il momento.Windows 10 riproporrà però la stessa schermata periodicamente…",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Microsoft-consiglia-Windows-11-per-il-tuo-dispositivo-come-rimuovere-la-schermata_24533",
          "publishedOn": "2022-05-19T08:11:00.000Z",
          "wordCount": null,
          "title": "Microsoft consiglia Windows 11 per il tuo dispositivo: come rimuovere la schermata",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Novita-Acer-Chromebook-notebook-OLED-convertibili-PC-monitor-e-tanti-device-che-guardano-alla-sostenibilita_24532",
          "author": null,
          "description": "In occasione dell'evento globale Next@Acer 2022 svoltosi oggi, Acer ha presentato un importante rinnovamento del suo catalogo di prodotti. Il 'piatto forte' sono i nuovi Chromebook Spin e il laptop Swift 3 OLED basato sui processori Intel Core serie H di dodicesima generazione (Alder Lake). L'azienda ha però svelato molti altri dispositivi: vediamoli in breve.Acer Chromebook Spin 714 è dotato di processori Intel Core di dodicesima generazione orientati alle prestazioni, presenta un design durevole e una penna USI integrata a ricarica rapida per trarre il massimo beneficio dai display da 14 pollici WQXGA (2560x1600) o WUXGA (1920x1200) con rapporto d’aspetto 16:10.Ottimizzato per il videoconferencing, Acer Chromebook Spin 714 è dotato di una webcam MIPI Full HD con tecnologia di riduzione del rumore e di doppio microfono, mentre i due altoparlanti rivolti verso l'alto con DTS Audio e amplificatore intelligente assicurano un'esperienza d'ascolto di alta qualità senza distorsioni.\n\nChromebook Acer Spin 714 offre connettività avanzata (compreso il supporto WiFi 6E e Bluetooth 5.2), una tastiera retroilluminata e numerose porte tra cui una HDMI e due Thunderbolt 4.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Novita-Acer-Chromebook-notebook-OLED-convertibili-PC-monitor-e-tanti-device-che-guardano-alla-sostenibilita_24532",
          "publishedOn": "2022-05-18T15:45:00.000Z",
          "wordCount": null,
          "title": "Novità Acer: Chromebook, notebook OLED, convertibili, PC, monitor e tanti device che guardano alla sostenibilità",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.ilsoftware.it/articoli.asp?tag=Epson-compie-80-anni-la-storia-dell-azienda-in-breve_24531",
          "author": null,
          "description": "Epson è una multinazionale giapponese tra i maggiori e più importanti produttori mondiali di stampanti e apparecchiature relative alla gestione dei dati e all'imaging.Ben 80 anni fa, nel mese di maggio 1942, fu fondata Daiwa Kogyo, l'azienda da cui è nata Epson. Anzi Seiko Epson, come si chiama oggi: nei primi anni di vita, infatti, gli elementi che hanno alimentato la crescita dell'azienda erano incentrati sul perfezionamento delle tecnologie di microlavorazione e di elaborazione ad alta precisione sviluppate per gli orologi e il loro impiego in altri campi applicativi.Daiwa Kogyo fu creata proprio da un negoziante di orologi locale, Hisao Yamazaki, e ricevette il supporto della famiglia di imprenditori che fondò il Gruppo Seiko.\n\nL'Epson Museum Suwa, situato nella sede di Suwa (prefettura di Nagano, Giappone), è stato inaugurato oggi proprio con l'intento di descrivere l'intera storia della società, dalla fondazione ai giorni nostri.",
          "link": "https://www.ilsoftware.it/articoli.asp?tag=Epson-compie-80-anni-la-storia-dell-azienda-in-breve_24531",
          "publishedOn": "2022-05-18T14:22:00.000Z",
          "wordCount": null,
          "title": "Epson compie 80 anni: la storia dell'azienda in breve",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Make Tech Easier",
      "feedUrl": "https://feeds.maketecheasier.com/MakeTechEasier",
      "siteUrl": "https://www.maketecheasier.com",
      "articles": [
        {
          "id": "https://admin.maketecheasier.com/?post_type=post-ideas&p=422932",
          "author": "Alexandra Arici",
          "description": "Stumbled upon an interesting video but you don’t have time to watch it now? You should know that it’s possible to download it for later/offline viewing, even if you found it on streaming platforms, which don’t natively allow you to do that unless you pay for a subscription. This article shows you how you can grab videos from any online platform using your device.\n   \n\nContent\n\n1. Get a Video Downloading Extension\n2. Use an Online Video Download Service\n3. Install a Third-Party Application (Windows)\n4. Download Streaming Video with VLC\n5. Use the Advanced Option\n6. Try Windows' Game Bar to Screen Record\n7. Take Advantage of Android's Native Screen Record Option\n8. Use Video Downloader for Android\n9. Use an Online Video Streaming Downloader on Android\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:9 of the Best YouTube Downloaders to Watch Videos Offline\n  ... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/14862969/stream-video-downloader",
          "publishedOn": "2022-05-20T00:25:00.000Z",
          "wordCount": 2809,
          "title": "How to Easily Download Streaming Video on Any Platform",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/04/download-video-featured.jpg"
        },
        {
          "id": "https://www.maketecheasier.com/?p=354728",
          "author": "Crystal Crowder",
          "description": "In a perfect world, everyone would have unlimited Wi-Fi. But that’s not the case. Mobile devices often prefer you to use Wi-Fi, but you can set a metered Wi-Fi connection on Android for better control over your data usage. You can set this on a single Wi-Fi network on multiple networks.\n   \n\nContent\n\nHow Android Handles Metered Wi-Fi\nSet a Metered Wi-Fi Connection\nRestrict Background Data Usage on Apps\nSave Your Wi-Fi Data\nMonitor Android Wi-Fi Data Usage\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:How to Stop Android Apps Running in the Background\n    \nHow Android Handles Metered Wi-Fi\n    \nUsually, large updates default to Wi-Fi on Android. The moment you connect, apps and even the system itself may try to update. This can quickly eat up your data, especially with larger system updates and apps. To help you avoid exorbitant charges, you... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/13720360/set-metered-wi-fi-connection-android",
          "publishedOn": "2022-05-19T21:25:00.000Z",
          "wordCount": 1613,
          "title": "How to Set a Metered Wi-Fi Connection on Android",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/03/how-to-set-a-metered-wi-fi-connection-on-android-featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=deal&p=490701",
          "author": "Laura Tucker",
          "description": "Earbuds can be great, but there is a time and place for them. Sometimes you just want a nice, comfortable pair of over-the-ear headphones. You’ll get that comfortable feeling with the Tapela E7 Wireless Headphones. They feature active noise cancelling, more than a full day of playtime, deep bass, and cost under $40.\n    \nDigital active noise cancelling technology will reduce the ambient noise in both the low- and mid-range frequencies. You can block out traffic noise, voices on an airplane, etc. It will allow you to focus more on your music, movies, and phone calls. The ANC, dual 45mm HD high-res audio driver, and high-response diaphragm will leave your sound without interruptions.\n    \n\n    \nPair the Tapela E7 Wireless Headphones wirelessly with 5.0 for a more stable transmission speed, lower latency, and an improved audio input. Along with listening to your favorite tunes and privately watching your favorite streamed content, the built-in mics allow you to have hands-free clear phone calls.\n    \nYou won’t find the stretchable headphones shutting down after... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15313817/tapela-e7-wireless-headphones",
          "publishedOn": "2022-05-19T19:25:00.000Z",
          "wordCount": 545,
          "title": "Save 60% on Tapela E7 Wireless Headphones",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/Tapela-E7-Headphones-Featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?p=489741",
          "author": "Laura Tucker",
          "description": "It’s a reviewer’s dream to review the next version of a product after previously reviewing an earlier model. After just reviewing the yeedi vac max Robot Vacuum, I had the chance to review the yeedi vac 2 pro Robot Vacuum, giving me great perspective to examine the new, updated features. I also had the chance to review the optional yeedi self-empty station.\n    \nThis is a sponsored article and was made possible by yeedi. The actual contents and opinions are the sole views of the author who maintains editorial independence, even when a post is sponsored.\n    \nSetting Up the yeedi vac 2 pro and self-empty station\n    \nWhile many newer robot vacuums now include self-empty stations, yeedi has chosen to make it optional. I see this as a plus. Not everyone wants this feature, nor do they want to pay the extra to have it. yeedi leaves the option up to the consumer. Additionally, it really doesn’t add that much extra setup.\n    \n\n    \nThe yeedi vac 2 pro ships with:\n  ... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15313659/yeedi-vac-2-pro-robot-vacuum",
          "publishedOn": "2022-05-19T17:25:00.000Z",
          "wordCount": 2257,
          "title": "Yeedi vac 2 pro Robot Vacuum and Self-empty Station Review",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/yeedi-vac-2-pro-Featured2.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=pitch&p=477353",
          "author": "Richard Kanyoro",
          "description": "Are you looking to install Windows 11 on your Raspberry Pi 4? Not only is this a fun project to try, but it also opens up a world of possibilities if you need a pocket-sized PC.\n    \nWith our guide, you’ll learn how to bypass Microsoft’s stringent requirements and install Windows 11 on your Raspberry Pi 4. The best part is that you can do the installation from a Raspberry Pi or a PC without too many commands or technical skills.\n   \n\nContent\n\nRequirements for Installing Windows 11 on Raspberry Pi\nUpdate Your Raspberry Pi to the Latest Firmware\nInstall Windows 11 on Raspberry Pi\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:6 of the Best Raspberry Pi Alternatives\n    \nRequirements for Installing Windows 11 on Raspberry Pi\n    \nRaspberry Pi 4 – Both the 4GB and 8GB Pi versions will work. But for a smoother experience... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15313350/install-windows-raspberry-pi",
          "publishedOn": "2022-05-19T15:25:00.000Z",
          "wordCount": 1789,
          "title": "How to Install Windows 11 on a Raspberry Pi 4",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/install-windows-raspberry-pi-featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?p=490442",
          "author": "Laura Tucker",
          "description": "There are many lawsuits filed in U.S. courts, with frivolous legal filings a known commodity. A lawsuit was filed against Apple, accusing the Cupertino tech giant of being negligent after a teen suffered permanent hearing loss from a notification delivered through his AirPods. The question at hand is whether this is a frivolous lawsuit.\n   \nAlso read:How to Use AirPods on Android and Windows\n    \nTeen’s AirPods Injury\n    \nB.G. Ariana Reyes had just turned 12 years old when his AirPods were purchased at a Texas Apple Store. The Apple earbuds had been on the market for just a month.\n    \nJust under six months later, B.G. was watching Netflix on his iPhone while wearing the AirPods. The lawsuit claims he was listening at a low volume. An Amber alert – a notification sent when a child is missing in the area – went off suddenly. The lawsuit stated it was “at a volume that tore apart B.G.’s eardrum,... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15312787/lawsuit-apple-airpods-injury-teen",
          "publishedOn": "2022-05-19T10:25:00.000Z",
          "wordCount": 1021,
          "title": "Lawsuit Filed Against Apple Over AirPods Injury to Teen",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/AirPods-Lawsuit-Featured.jpg"
        },
        {
          "id": "https://www.maketecheasier.com/?p=284130",
          "author": "Sayak Boral",
          "description": "In older versions of Windows, you were forced to reinstall the entire operating system if you wanted to convert legacy BIOS or Master Boot Record (MBR) to UEFI or GUID Partition Table (GPT). However, a new and simple tool called MBR2GPT was introduced in Windows 10. It lets you convert legacy BIOS to UEFI with just two commands. \n    \nHere is how you can convert legacy BIOS to UEFI in Windows 10. If you’re a Windows 11 user, you shouldn’t do anything, as UEFI mode is enabled by default on your device.\n    \nDo not skip any of the prerequisites of legacy BIOS to UEFI conversion mentioned below, as it can lead to system failure and even hardware issues in some cases.\n   \n\nContent\n\nWhy Convert Legacy BIOS to UEFI?\nPrerequisites for Legacy BIOS to UEFI Conversion\nDo I Need to Convert Legacy BIOS to UEFI in Windows 11?\nHow to Check Whether You Are Using Legacy BIOS\nHow to Convert Legacy BIOS to UEFI\nHow to Fix the MBR2GPT \"Disk Layout Validation Failed\" Error\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/10906619/convert-legacy-bios-uefi-windows10",
          "publishedOn": "2022-05-19T00:25:00.000Z",
          "wordCount": 2514,
          "title": "How to Convert Legacy BIOS to UEFI in Windows",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/change-legacy-bios-to-uefi-hero.jpg"
        },
        {
          "id": "https://www.maketecheasier.com/?post_type=post-ideas&p=278327",
          "author": "Mehvish Mushtaq",
          "description": "Chromebooks are Google’s lightweight laptops that run on Chrome OS. These machines are designed to be used primarily while connected to the Internet. They are by design safe, durable, and secure, especially when compared with traditional computers. Google really has done its homework when it comes to Chromebook security. It offers interesting automated and customizable features to keep your information and laptop safe. Let’s check various ways to secure your Chromebook.\n   \n\nContent\n\n1. Update Your Chromebook\n2. Use a PIN Instead of a Password\n3. Show Lock Screen After Waking Up From Sleep\n4. Take Advantage of Guest Mode\n5. Restrict Sign-in to Selected Users\n6. Secure Chrome Browser\nLost Your Chromebook? Sign Out Remotely\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:6 Best Tips to Protect Your Gmail Account Security\n    \n1. Update Your Chromebook\n    \nAs with any operating system, installing... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/10706588/howto-secure-chromebook",
          "publishedOn": "2022-05-18T21:25:00.000Z",
          "wordCount": 1848,
          "title": "How to Secure Your Chromebook",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/04/How-to-Secure-Chromebook.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=deal&p=490329",
          "author": "Laura Tucker",
          "description": "There’s no need to spend $1000 or more on a new smartphone. You can get the Samsung Galaxy A53 5G A Series Smartphone, released in 2022, for just $349.99. You won’t be skimping on features either, as this 6.5″ Android phone is unlocked and has 128GB, an FHD Super AMOLED screen, and a long battery life.\n    \nThis super-fast charging 5,000mAh battery supports 25W charging and is long-lasting, whether you’re on a video call, bingeing your favorite shows, or catching up with social media. You’ll have smooth streaming as well with fast downloads, thanks to 5G.\n    \n\n    \nThis Samsung Galaxy A53 5G A Series Smartphone has the series’ biggest built-in storage with 6GB RAM, and you can expand it to 128GB with a microSD card so that you won’t be deleting photos trying to make more room. The intelligent camera allows you to record video and shoot pictures with just one tap, with all media being clear with image stabilization.\n    \nThe 6.5″ display is meant for entertainment with clarity and... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15310965/samsung-galaxy-a53-5g-smartphone",
          "publishedOn": "2022-05-18T19:25:00.000Z",
          "wordCount": 565,
          "title": "Take $100 Off a Samsung Galaxy A53 5G A Series Smartphone",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/05/Samsung-Galaxy-A53-Featured.jpg"
        },
        {
          "id": "https://admin.maketecheasier.com/?post_type=post-ideas&p=474426",
          "author": "Ojash Yadav",
          "description": "Due to the difference in technology, HDDs are inherently slower than their SSD counterparts, and their performance decreases over time as you store more and more data on them. This can be attributed to data fragmentation during the writing process. However, there is a simple fix for it called defragmentation. In this article, we will go over a few simple methods to help you defrag your Windows hard drive and get a significant performance boost.\n   \n\nContent\n\n1. Use the Disk Optimization Tool\n2. Schedule Optimization\n3. Use the Command Line\n4. Use a Third-Party Defragging Tool\nFrequently Asked Questions\n\n.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}}   \nAlso read:How to Format an Xbox One External Hard Drive for Use with a PC\n    \nWhat Is Defragmentation?\n    \nTo understand what defragmentation is, you need to know how a hard... Read more",
          "link": "https://feeds.maketecheasier.com/link/12555/15309434/defrag-windows-hard-drive",
          "publishedOn": "2022-05-18T15:25:00.000Z",
          "wordCount": 1607,
          "title": "How to Defrag Your Windows Hard Drive",
          "imageUrl": "https://www.maketecheasier.com/assets/uploads/2022/03/windows-defragmentation.jpg"
        }
      ]
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/feed/",
      "siteUrl": "https://blog.mozilla.org/en/",
      "articles": []
    },
    {
      "title": "Navigaweb.net",
      "feedUrl": "https://feeds.feedburner.com/navigaweb/",
      "siteUrl": "https://www.navigaweb.net/",
      "articles": [
        {
          "id": "https://www.navigaweb.net/2011/08/come-prendere-screenshot-in-windows-7-e.html",
          "author": null,
          "description": "Chi vuole condividere rapidamente un'immagine o una foto di un sito con gli amici spesso utilizza gli screenshot da telefono, una delle cose più semplici da imparare (bastano due tasti o una specifica gesture sullo schermo). Se siamo davanti al PC possiamo fare screenshot con la stessa semplicità, appoggiandoci al sistema integrato in Windows 10 e Windows 11 o utilizzando dei programmi dedicati...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2011/08/come-prendere-screenshot-in-windows-7-e.html",
          "publishedOn": "2022-05-19T16:28:00.000Z",
          "wordCount": 1520,
          "title": "Come fare uno screenshot in Windows 10 e 11",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiqf-iCrFvSGSqtjlgy5QqStL3h7KJxasLl3h9ch79mi7VXaGvn2NiKlYWX7nhTNFST-YabjF6zB_GytFhyN38GciXZTpJav5KDcHcnwT316CFGhTqF6_Q93AxGZHYSqTNGjJlV_UzsbkOY4eBa6Wg2-5vaCZrW9Rg6flTwUMdxr0GwK8KQiqs-aRyO/w1200-h630-p-k-no-nu/Screenshot%20Windows.jpg"
        },
        {
          "id": "https://www.navigaweb.net/2022/05/alexa-puo-essere-pericolosa-per-i.html",
          "author": null,
          "description": "I bambini sono ormai circondati da dispositivi tecnologici e spesso imparano ad utilizzarli molto prima dei genitori, vista il loro insaziabile desiderio di scoprire ogni cosa. Ma come comportarsi se il bambino impara ad utilizzare l'Amazon Echo e quindi l'assistente vocale Alexa? Ciò che viene chiesto all'assistente può essere pericoloso? \r\nIn questo approfondimento vi mostreremo quali sono i...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2022/05/alexa-puo-essere-pericolosa-per-i.html",
          "publishedOn": "2022-05-19T15:07:00.004Z",
          "wordCount": 1011,
          "title": "Alexa può essere pericolosa per i bambini?",
          "imageUrl": "https://blogger.googleusercontent.com/img/a/AVvXsEjzGKNnKsqAtNJ_r-wtHQOK0daDWUXg117uQcI1WSTfRwNot0GuLijViq-1fpJt0s2cfSm7QYQz1Mwb76oi_-6yESd8_8DcF4oPD5TthfZu4rmU2l685R-qdnJbecSY4qZqGWXzW51Rms5HT_aMsIP-77u_VuBdEBxQWKrcDq6o2ThaNATTtFWSUDO4=w1200-h630-p-k-no-nu"
        },
        {
          "id": "https://www.navigaweb.net/2015/09/come-accedere-android-se-non-si-ricorda.html",
          "author": null,
          "description": "Sui telefoni Android possiamo proteggere l'accesso non autorizzato utilizzando un sistema di sicurezza integrato direttamente dnella schermata di blocco: possiamo inserire un PIN, una password oppure un disegno da fare col dito. Il PIN è fondamentale anche quando scegliamo di sbloccare il telefono con l'impronta digitale o con il viso, visto che viene proposto comunque come metodo d'accesso di...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2015/09/come-accedere-android-se-non-si-ricorda.html",
          "publishedOn": "2022-05-19T10:29:00.000Z",
          "wordCount": 1143,
          "title": "Sbloccare uno smartphone Android senza codice del telefono",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg7_KYFg2eApWGfHGqFDK6ShXjgdpQQBenSmDxpjI91myWioYcbPBA_49E5b8cEhh20awVHPKenAzJ2LmSqnYYrvj-AyY2jeOa6P-IHhBY9Tyb_Jp9mHKoai_1f0ubs0d5yL1EOrrTFxzCNgWDL853rdK8tUr9tgst_cJiJD3AaMmxP1Y7jhOQf-uGI/w1200-h630-p-k-no-nu/Accedere%20Android%20senza%20codice%20di%20sblocco.jpg"
        },
        {
          "id": "https://www.navigaweb.net/2017/07/app-migliori-per-fotografare-con-iphone.html",
          "author": null,
          "description": "Anche se l'iPhone ha già un'ottima applicazione per fare foto, non è detto che non si possano realizzare scatti migliori scaricando altre app per fotografare con iPhone.\r\n\r\n Utilizzando altre app possiamo ottenere nuovi effetti, nuove funzioni da fotocamera professionale (come le linee dei terzi o il controllo dell'esposizione), aggiungere effetti e filtri live e molto altro ancora.\r\n\r\n In questa...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2017/07/app-migliori-per-fotografare-con-iphone.html",
          "publishedOn": "2022-05-18T16:38:00.000Z",
          "wordCount": 1537,
          "title": "Migliori App per fare foto con iPhone (alternative alla fotocamera)",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdGG_qpppxIkIql2Eqs9VGeoPlm9rYGNMOo7Qg4JsKmuoA1ljw1SKZEyDnJC3ec1oyR3t9ivzzTvhjZxOKy065wCFNujsKx-2_0DLfDgD48jjwyWR6Mq7zgSR60M0xqPx_-oN_HzEYLzu8ydxSLPAqYB9uPIRFWVRDRWUsNq5xZb7NTeyjCCWcpyJb/w1200-h630-p-k-no-nu/Migliori%20app%20fotocamera%20iPhone.jpg"
        },
        {
          "id": "https://www.navigaweb.net/2022/05/come-creare-un-server-ftp-gratis.html",
          "author": null,
          "description": "Chi lavora in azienda sa quanto è importante accedere ai file aziendali in ogni momento della giornata, così da poter verificarne il contenuto ed effettuare le modifiche necessarie anche senza accedere fisicamente al PC aziendale. Per l'accesso remoto dei file viene utilizzato il protocollo FTP, nato agli albori delle reti interconnesse ma ancora oggi molto utilizzato per la sua semplicità di...\n\r\n\r\nContinua a leggere su Navigaweb.net (clicca sul titolo)",
          "link": "https://www.navigaweb.net/2022/05/come-creare-un-server-ftp-gratis.html",
          "publishedOn": "2022-05-18T14:46:00.000Z",
          "wordCount": 1533,
          "title": "Come creare un server FTP gratis",
          "imageUrl": "https://blogger.googleusercontent.com/img/a/AVvXsEge56XFEWVEAQvZUKgYu3QO7Qn0I5TtyFkjEVYQ3ovYHteMsEkGAkMeZOzg477OcHkxCtHA5XNTgVL7YVZyyLlYHfyHGjkGnv2ODACJVdggDlaKVQXhlwzik5_Fz-BDvx050pCumcuvWpmyMflj5KbcyL7kIEGKu2CK_L3dGt2Jjd5tNW6eywXadTd2=w1200-h630-p-k-no-nu"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=System76-Scheduler-1.2",
          "author": null,
          "description": "System76-Scheduler as the Linux PC vendor's effort to provide a Rust-written daemon to enhance Linux desktop responsiveness and shipping as part of their Pop!_OS distribution is out with a new feature release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=System76-Scheduler-1.2",
          "publishedOn": "2022-05-19T22:34:31.000Z",
          "wordCount": 915,
          "title": "System76 Scheduler 1.2 Released - Now Has Defaults For SteamVR, Flatpak Process Support",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Google-PSP-Security-Protocol",
          "author": null,
          "description": "Hearing \"open-source\", \"PSP\", and \"security\" all together got me excited with my initial reaction thinking it was about AMD's Platform Security Processor (PSP) albeit that's not the case here. Google's PSP announced today is the \"PSP Security Protocol\" and is designed for dealing with cryptographic hardware offloading at data center scale and used by Google already in production...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Google-PSP-Security-Protocol",
          "publishedOn": "2022-05-19T17:40:43.000Z",
          "wordCount": 1014,
          "title": "Google Makes Public Their Open-Source PSP Security Protocol",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Framework-Laptop-ADL",
          "author": null,
          "description": "The Framework Laptop is a modular laptop design that launched a year ago and is designed to be upgrade-friendly and allows users for switching out lots of components from different ports to the motherboard itself. And the laptop is Linux-friendly -- see my Framework Laptop review from last year. For new systems or those wishing to upgrade their laptop's motherboard, Intel Core 12th Gen \"Alder Lake\" is now available...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Framework-Laptop-ADL",
          "publishedOn": "2022-05-19T17:24:19.000Z",
          "wordCount": 871,
          "title": "Upgraded Linux-Friendly Framework Laptop Shifts To Intel 12th Gen \"Alder Lake\"",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-SYCLomatic",
          "author": null,
          "description": "Intel today has lifted the embargo on SYCLomatic, their new open-source tool to help migrate code-bases targeting NVIDIA's CUDA so they can be re-purposed to target C++ and SYCL -- thereby being able to leverage Intel's graphics processors and jiving with their oneAPI goals...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-SYCLomatic",
          "publishedOn": "2022-05-19T14:00:00.000Z",
          "wordCount": 981,
          "title": "Intel Announces SYCLomatic For Open-Source Conversion Of CUDA Code To C++ SYCL",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=31127",
          "author": null,
          "description": "Given the recent releases of Ubuntu 22.04 LTS and Fedora 36 among other recent OS updates, it's time for a fresh look at how various Linux distributions are performing. This Linux benchmarking bout is looking at the Xeon Platinum 8380 2P \"Ice Lake\" performance across Arch Linux, Debian, openSUSE, CentOS Stream, AlmaLinux, Fedora, Ubuntu, and Intel's Clear Linux.",
          "link": "https://www.phoronix.com/vr.php?view=31127",
          "publishedOn": "2022-05-19T13:30:00.000Z",
          "wordCount": 843,
          "title": "Intel's Clear Linux Outpacing Ubuntu 22.04 LTS, Fedora 36 & Other H1'2022 Distros",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.25-Beta",
          "author": null,
          "description": "The KDE development community today announced the release of the Plasma 5.25 beta...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.25-Beta",
          "publishedOn": "2022-05-19T13:30:00.000Z",
          "wordCount": 775,
          "title": "KDE Plasma 5.25 Beta Released With Many Improvements, Wayland Support Maturing",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-More-GFX11",
          "author": null,
          "description": "Last week I wrote about how well known Mesa developer Samuel Pitoiset who is employed by Valve already started working on GFX11 (RDNA3) support for RADV, the open-source Radeon Vulkan driver in Mesa that isn't officially supported by AMD but remains more popular than their own \"AMDVLK\" driver. More GFX11/RDNA3 preparation work remains ongoing and it's looking like if trends continue this open-source driver could be ready for RDNA3 graphics cards in time for launch...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-More-GFX11",
          "publishedOn": "2022-05-19T10:46:37.000Z",
          "wordCount": 1148,
          "title": "RADV Vulkan Driver Continues At Full-Speed Preparing For RDNA3/GFX11 GPUs",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-3.0-RC1-OpenCL-3.0",
          "author": null,
          "description": "POCL as the \"Portable Computing Language\" that gets OpenCL running on CPUs as well as via LLVM allowing for targeting NVIDIA GPUs, AMD HSA environments, and other cases, is now preparing to roll-out OpenCL 3.0 support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-3.0-RC1-OpenCL-3.0",
          "publishedOn": "2022-05-19T09:38:49.000Z",
          "wordCount": 824,
          "title": "POCL 3.0-RC1 Released For OpenCL 3.0 Implemented On CPUs",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MGLRU-v11-Linux-Perf",
          "author": null,
          "description": "Multi-Gen LRU (MGLRU) remains a very promising effort for enhancing Linux system performance and particularly about providing a superior experience when the Linux kernel is dealing with system memory pressure. MGLRU v11 was posted this week while we await to see if it will be mainlined come the v5.19 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MGLRU-v11-Linux-Perf",
          "publishedOn": "2022-05-19T09:30:15.000Z",
          "wordCount": 1128,
          "title": "MGLRU Revved Once More For Promising Linux Performance Improvements",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Statx-FAT-Creation-Time",
          "author": null,
          "description": "Back in 2017 for the Linux 4.11 kernel the statx system call was added for allowing enhanced file information reporting. Since then various file-systems began adding Statx support and worked its way up into Glibc and the like in user-space for Linux finally having file creation time reporting and other attributes. Two separate statx-related additions are now working their way to the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Statx-FAT-Creation-Time",
          "publishedOn": "2022-05-19T09:02:27.000Z",
          "wordCount": 824,
          "title": "Linux FAT File Creation/Birth Time Reporting, Proposal For Statx I/O Alignment Info",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-22.1-Released",
          "author": null,
          "description": "Mesa 22.1 is out today as the newest, quarterly feature update to the open-source OpenGL/Vulkan graphics driver stack that also supports video acceleration and other GPU features on the Linux desktop...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-22.1-Released",
          "publishedOn": "2022-05-19T00:40:13.000Z",
          "wordCount": 1235,
          "title": "Mesa 22.1 Released With Many Vulkan Improvements, Kopper For Zink, Imagination Driver",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RHEL-9.0-GA-Official",
          "author": null,
          "description": "Last week Red Hat announced at the Red Hat Summit that RHEL9 would be reach GA in the coming weeks while today it officially crossed that threshold...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RHEL-9.0-GA-Official",
          "publishedOn": "2022-05-18T23:32:20.000Z",
          "wordCount": 864,
          "title": "Red Hat Enterprise Linux 9.0 GA Now Officially Available",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-oneAPI-2022.2",
          "author": null,
          "description": "Intel today published their latest update (v2022.2) to the oneAPI Toolkits, their collection of open-source software components for empowering modern workloads across the growing world of CPUs/GPUs/XPUs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-oneAPI-2022.2",
          "publishedOn": "2022-05-18T19:00:00.000Z",
          "wordCount": 841,
          "title": "Intel oneAPI Toolkits 2022.2 Released With ISPCRT, More Arc Graphics Preparations",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Linux-vRAM-SR",
          "author": null,
          "description": "With the upcoming Linux 5.19 cycle appearing to be the point at which Intel's DG2/Alchemist Linux graphics driver support is settling down and may end up being the base version requirement for their forthcoming discrete graphics cards, we are seeing other non-core feature work happen for these Arc Graphics products. A new feature we've only seen mentioned today for the first time by Intel is \"vRAM SR\", short for vRAM Self-Refresh...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Linux-vRAM-SR",
          "publishedOn": "2022-05-18T18:03:46.000Z",
          "wordCount": 921,
          "title": "Intel Linux Driver Wiring Up New \"vRAM Self Refresh\" Feature For Arc Graphics Cards",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Kria-KR260-Robotics",
          "author": null,
          "description": "AMD on Tuesday released the Kria KR260 Robotics Starter Kit featuring a Xilinx Kria K26 System-on-Module and tailoring it for robotics, machine vision, and industrial communication/control use-cases while running Ubuntu 22.04 LTS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Kria-KR260-Robotics",
          "publishedOn": "2022-05-18T18:00:10.000Z",
          "wordCount": 753,
          "title": "AMD Launches Xilinx + Linux Powered Robotics Starter Kit",
          "imageUrl": null
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=VirtualBox-Leaky-Host-To-Guest",
          "author": null,
          "description": "Security researcher Jason Donenfeld who is known for leading the development of the WireGuard open-source software has outlined a new security vulnerability affecting the Oracle VM VirtualBox software...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=VirtualBox-Leaky-Host-To-Guest",
          "publishedOn": "2022-05-18T17:36:49.000Z",
          "wordCount": 1005,
          "title": "VirtualBox On Linux Affected By Security Vulnerability Leaking Host Data To Guests",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Feed principale [TurboLab.it]",
      "feedUrl": "https://turbolab.it/feed",
      "siteUrl": "http://turbolab.it",
      "articles": [
        {
          "id": "3579|20220520000000",
          "author": "info@turbolab.it (TurboLab.it)",
          "description": "Per lavoro mi trovo a dover aprire decine di link al giorno e cliccarli uno alla volta era diventata una vera scocciatura, oltre che a una grande perdita di tempo. Così mi sono messo a cercare una soluzione e sono riuscito a trovarla con Snap Links Plus l’estensione per Firefox.\n›› Leggi tutto",
          "link": "https://turbolab.it/browser-455/firefox-lestensione-snap-links-plus-puoi-aprire-tanti-link-insieme-senza-cliccarli-volta-3579",
          "publishedOn": "2022-05-19T22:00:00.000Z",
          "wordCount": 885,
          "title": "Con Firefox e l’estensione Snap Links Plus puoi aprire tanti link insieme senza cliccarli uno alla volta",
          "imageUrl": "https://turbolab.it/immagini/21622/max"
        },
        {
          "id": "3576|20220519110509",
          "author": "info@turbolab.it (TurboLab.it)",
          "description": "Non sei l'unico che ha dimenticato la password di un PDF. Molte persone nel mondo smarriscono la password dei propri documenti. Sebbene i file PDF siano dotati di un alto livello di sicurezza, ci sono ancora vai modi per decrittografarli e uno di questi è affidarsi a PassFab per PDF, uno strumento facile da usare, che consente di sbloccare la password di file PDF e accedere facilmente al documento. Ma vediamo nello specifico di cosa si tratta e come funziona questo strumento dal punto di vista operativo\n›› Leggi tutto",
          "link": "https://turbolab.it/crittografia-945/passfab-pdf-sblocca-password-file-pdf-accedere-facilmente-documenti-3576",
          "publishedOn": "2022-05-19T09:05:09.000Z",
          "wordCount": 1452,
          "title": "PassFab per PDF: sblocca la password di file PDF per accedere facilmente ai documenti",
          "imageUrl": "https://turbolab.it/immagini/21610/max"
        },
        {
          "id": "3578|20220519000000",
          "author": "info@turbolab.it (TurboLab.it)",
          "description": "Da quando ho iniziato ad utilizzare Windows 11, una delle cose che mi creava dei problemi era la dimensione della barra di scorrimento laterale e inferiore che, in alcuni programmi che utilizzo, era notevolmente dimagrita. Dovendo io lavorare con un cursore del mouse piuttosto grande, quando la dovevo toccare per farla scorrere più velocemente, a volte, mi risultava difficile “catturarla”.\n›› Leggi tutto",
          "link": "https://turbolab.it/windows-10/come-modificare-dimensioni-barra-scorrimento-alcuni-programmi-windows-11-3578",
          "publishedOn": "2022-05-18T22:00:00.000Z",
          "wordCount": 924,
          "title": "Come modificare le dimensioni della barra di scorrimento di alcuni programmi in Windows 11",
          "imageUrl": "https://turbolab.it/immagini/21619/max"
        }
      ]
    },
    {
      "title": "Latest topics for ZDNet in Windows",
      "feedUrl": "https://www.zdnet.com/topic-windows/rss.xml",
      "siteUrl": "https://www.zdnet.com/",
      "articles": [
        {
          "id": "7878627f-5832-497e-a6c4-9590f8d1c2b3",
          "author": null,
          "description": "We show you how to capture images on Windows with a free tool in this quick how-to. We'll also point you to a capture tool that costs a bit more but does just about everything you could possibly want.",
          "link": "https://www.zdnet.com/article/how-to-screenshot-on-windows/#ftag=RSSbaffb68",
          "publishedOn": "2022-05-18T21:15:54.000Z",
          "wordCount": null,
          "title": "How to take a screenshot on Windows",
          "itunes": {},
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.14.4"
}